(function () {
    var location = [
        {
            "nm": "中国",
            "state": [
                {
                    "nm": "北京",
                    "city": [
                        {
                            "nm": "东城"
                        },
                        {
                            "nm": "西城"
                        },
                        {
                            "nm": "朝阳"
                        },
                        {
                            "nm": "丰台"
                        },
                        {
                            "nm": "石景山"
                        },
                        {
                            "nm": "海淀"
                        },
                        {
                            "nm": "门头沟"
                        },
                        {
                            "nm": "房山"
                        },
                        {
                            "nm": "通州"
                        },
                        {
                            "nm": "顺义"
                        },
                        {
                            "nm": "昌平"
                        },
                        {
                            "nm": "大兴"
                        },
                        {
                            "nm": "平谷"
                        },
                        {
                            "nm": "怀柔"
                        },
                        {
                            "nm": "密云"
                        },
                        {
                            "nm": "延庆"
                        }
                    ]
                },
                {
                    "nm": "天津",
                    "city": [
                        {
                            "nm": "和平"
                        },
                        {
                            "nm": "河东"
                        },
                        {
                            "nm": "河西"
                        },
                        {
                            "nm": "南开"
                        },
                        {
                            "nm": "河北"
                        },
                        {
                            "nm": "红桥"
                        },
                        {
                            "nm": "滨海新区"
                        },
                        {
                            "nm": "东丽"
                        },
                        {
                            "nm": "西青"
                        },
                        {
                            "nm": "津南"
                        },
                        {
                            "nm": "北辰"
                        },
                        {
                            "nm": "宁河"
                        },
                        {
                            "nm": "武清"
                        },
                        {
                            "nm": "静海"
                        },
                        {
                            "nm": "宝坻"
                        },
                        {
                            "nm": "蓟县"
                        }
                    ]
                },
                {
                    "nm": "河北",
                    "city": [
                        {
                            "nm": "石家庄"
                        },
                        {
                            "nm": "唐山"
                        },
                        {
                            "nm": "秦皇岛"
                        },
                        {
                            "nm": "邯郸"
                        },
                        {
                            "nm": "邢台"
                        },
                        {
                            "nm": "保定"
                        },
                        {
                            "nm": "张家口"
                        },
                        {
                            "nm": "承德"
                        },
                        {
                            "nm": "沧州"
                        },
                        {
                            "nm": "廊坊"
                        },
                        {
                            "nm": "衡水"
                        }
                    ]
                },
                {
                    "nm": "山西",
                    "city": [
                        {
                            "nm": "太原"
                        },
                        {
                            "nm": "大同"
                        },
                        {
                            "nm": "阳泉"
                        },
                        {
                            "nm": "长治"
                        },
                        {
                            "nm": "晋城"
                        },
                        {
                            "nm": "朔州"
                        },
                        {
                            "nm": "晋中"
                        },
                        {
                            "nm": "运城"
                        },
                        {
                            "nm": "忻州"
                        },
                        {
                            "nm": "临汾"
                        },
                        {
                            "nm": "吕梁"
                        }
                    ]
                },
                {
                    "nm": "内蒙古",
                    "city": [
                        {
                            "nm": "呼和浩特"
                        },
                        {
                            "nm": "包头"
                        },
                        {
                            "nm": "乌海"
                        },
                        {
                            "nm": "赤峰"
                        },
                        {
                            "nm": "通辽"
                        },
                        {
                            "nm": "鄂尔多斯"
                        },
                        {
                            "nm": "呼伦贝尔"
                        },
                        {
                            "nm": "巴彦淖尔"
                        },
                        {
                            "nm": "乌兰察布"
                        },
                        {
                            "nm": "兴安"
                        },
                        {
                            "nm": "锡林郭勒"
                        },
                        {
                            "nm": "阿拉善"
                        }
                    ]
                },
                {
                    "nm": "辽宁",
                    "city": [
                        {
                            "nm": "沈阳"
                        },
                        {
                            "nm": "大连"
                        },
                        {
                            "nm": "鞍山"
                        },
                        {
                            "nm": "抚顺"
                        },
                        {
                            "nm": "本溪"
                        },
                        {
                            "nm": "丹东"
                        },
                        {
                            "nm": "锦州"
                        },
                        {
                            "nm": "营口"
                        },
                        {
                            "nm": "阜新"
                        },
                        {
                            "nm": "辽阳"
                        },
                        {
                            "nm": "盘锦"
                        },
                        {
                            "nm": "铁岭"
                        },
                        {
                            "nm": "朝阳"
                        },
                        {
                            "nm": "葫芦岛"
                        }
                    ]
                },
                {
                    "nm": "吉林",
                    "city": [
                        {
                            "nm": "长春"
                        },
                        {
                            "nm": "吉林"
                        },
                        {
                            "nm": "四平"
                        },
                        {
                            "nm": "辽源"
                        },
                        {
                            "nm": "通化"
                        },
                        {
                            "nm": "白山"
                        },
                        {
                            "nm": "松原"
                        },
                        {
                            "nm": "白城"
                        },
                        {
                            "nm": "延边"
                        }
                    ]
                },
                {
                    "nm": "黑龙江",
                    "city": [
                        {
                            "nm": "哈尔滨"
                        },
                        {
                            "nm": "齐齐哈尔"
                        },
                        {
                            "nm": "鸡西"
                        },
                        {
                            "nm": "鹤岗"
                        },
                        {
                            "nm": "双鸭山"
                        },
                        {
                            "nm": "大庆"
                        },
                        {
                            "nm": "伊春"
                        },
                        {
                            "nm": "佳木斯"
                        },
                        {
                            "nm": "七台河"
                        },
                        {
                            "nm": "牡丹江"
                        },
                        {
                            "nm": "黑河"
                        },
                        {
                            "nm": "绥化"
                        },
                        {
                            "nm": "大兴安岭"
                        }
                    ]
                },
                {
                    "nm": "上海",
                    "city": [
                        {
                            "nm": "黄浦"
                        },
                        {
                            "nm": "卢湾"
                        },
                        {
                            "nm": "徐汇"
                        },
                        {
                            "nm": "长宁"
                        },
                        {
                            "nm": "静安"
                        },
                        {
                            "nm": "普陀"
                        },
                        {
                            "nm": "闸北"
                        },
                        {
                            "nm": "虹口"
                        },
                        {
                            "nm": "杨浦"
                        },
                        {
                            "nm": "闵行"
                        },
                        {
                            "nm": "宝山"
                        },
                        {
                            "nm": "嘉定"
                        },
                        {
                            "nm": "浦东新区"
                        },
                        {
                            "nm": "金山"
                        },
                        {
                            "nm": "松江"
                        },
                        {
                            "nm": "奉贤"
                        },
                        {
                            "nm": "青浦"
                        },
                        {
                            "nm": "崇明"
                        }
                    ]
                },
                {
                    "nm": "江苏",
                    "city": [
                        {
                            "nm": "南京"
                        },
                        {
                            "nm": "无锡"
                        },
                        {
                            "nm": "徐州"
                        },
                        {
                            "nm": "常州"
                        },
                        {
                            "nm": "苏州"
                        },
                        {
                            "nm": "南通"
                        },
                        {
                            "nm": "连云港"
                        },
                        {
                            "nm": "淮安"
                        },
                        {
                            "nm": "盐城"
                        },
                        {
                            "nm": "扬州"
                        },
                        {
                            "nm": "镇江"
                        },
                        {
                            "nm": "泰州"
                        },
                        {
                            "nm": "宿迁"
                        }
                    ]
                },
                {
                    "nm": "浙江",
                    "city": [
                        {
                            "nm": "杭州"
                        },
                        {
                            "nm": "宁波"
                        },
                        {
                            "nm": "温州"
                        },
                        {
                            "nm": "嘉兴"
                        },
                        {
                            "nm": "湖州"
                        },
                        {
                            "nm": "绍兴"
                        },
                        {
                            "nm": "金华"
                        },
                        {
                            "nm": "衢州"
                        },
                        {
                            "nm": "舟山"
                        },
                        {
                            "nm": "台州"
                        },
                        {
                            "nm": "丽水"
                        }
                    ]
                },
                {
                    "nm": "安徽",
                    "city": [
                        {
                            "nm": "合肥"
                        },
                        {
                            "nm": "芜湖"
                        },
                        {
                            "nm": "蚌埠"
                        },
                        {
                            "nm": "淮南"
                        },
                        {
                            "nm": "马鞍山"
                        },
                        {
                            "nm": "淮北"
                        },
                        {
                            "nm": "铜陵"
                        },
                        {
                            "nm": "安庆"
                        },
                        {
                            "nm": "黄山"
                        },
                        {
                            "nm": "滁州"
                        },
                        {
                            "nm": "阜阳"
                        },
                        {
                            "nm": "宿州"
                        },
                        {
                            "nm": "六安"
                        },
                        {
                            "nm": "亳州"
                        },
                        {
                            "nm": "池州"
                        },
                        {
                            "nm": "宣城"
                        }
                    ]
                },
                {
                    "nm": "福建",
                    "city": [
                        {
                            "nm": "福州"
                        },
                        {
                            "nm": "厦门"
                        },
                        {
                            "nm": "莆田"
                        },
                        {
                            "nm": "三明"
                        },
                        {
                            "nm": "泉州"
                        },
                        {
                            "nm": "漳州"
                        },
                        {
                            "nm": "南平"
                        },
                        {
                            "nm": "龙岩"
                        },
                        {
                            "nm": "宁德"
                        }
                    ]
                },
                {
                    "nm": "江西",
                    "city": [
                        {
                            "nm": "南昌"
                        },
                        {
                            "nm": "景德镇"
                        },
                        {
                            "nm": "萍乡"
                        },
                        {
                            "nm": "九江"
                        },
                        {
                            "nm": "新余"
                        },
                        {
                            "nm": "鹰潭"
                        },
                        {
                            "nm": "赣州"
                        },
                        {
                            "nm": "吉安"
                        },
                        {
                            "nm": "宜春"
                        },
                        {
                            "nm": "抚州"
                        },
                        {
                            "nm": "上饶"
                        }
                    ]
                },
                {
                    "nm": "山东",
                    "city": [
                        {
                            "nm": "济南"
                        },
                        {
                            "nm": "青岛"
                        },
                        {
                            "nm": "淄博"
                        },
                        {
                            "nm": "枣庄"
                        },
                        {
                            "nm": "东营"
                        },
                        {
                            "nm": "烟台"
                        },
                        {
                            "nm": "潍坊"
                        },
                        {
                            "nm": "济宁"
                        },
                        {
                            "nm": "泰安"
                        },
                        {
                            "nm": "威海"
                        },
                        {
                            "nm": "日照"
                        },
                        {
                            "nm": "莱芜"
                        },
                        {
                            "nm": "临沂"
                        },
                        {
                            "nm": "德州"
                        },
                        {
                            "nm": "聊城"
                        },
                        {
                            "nm": "滨州"
                        },
                        {
                            "nm": "菏泽"
                        }
                    ]
                },
                {
                    "nm": "河南",
                    "city": [
                        {
                            "nm": "郑州"
                        },
                        {
                            "nm": "开封"
                        },
                        {
                            "nm": "洛阳"
                        },
                        {
                            "nm": "平顶山"
                        },
                        {
                            "nm": "安阳"
                        },
                        {
                            "nm": "鹤壁"
                        },
                        {
                            "nm": "新乡"
                        },
                        {
                            "nm": "焦作"
                        },
                        {
                            "nm": "濮阳"
                        },
                        {
                            "nm": "许昌"
                        },
                        {
                            "nm": "漯河"
                        },
                        {
                            "nm": "三门峡"
                        },
                        {
                            "nm": "南阳"
                        },
                        {
                            "nm": "商丘"
                        },
                        {
                            "nm": "信阳"
                        },
                        {
                            "nm": "周口"
                        },
                        {
                            "nm": "驻马店"
                        },
                        {
                            "nm": "济源"
                        }
                    ]
                },
                {
                    "nm": "湖北",
                    "city": [
                        {
                            "nm": "武汉"
                        },
                        {
                            "nm": "黄石"
                        },
                        {
                            "nm": "十堰"
                        },
                        {
                            "nm": "宜昌"
                        },
                        {
                            "nm": "襄阳"
                        },
                        {
                            "nm": "鄂州"
                        },
                        {
                            "nm": "荆门"
                        },
                        {
                            "nm": "孝感"
                        },
                        {
                            "nm": "荆州"
                        },
                        {
                            "nm": "黄冈"
                        },
                        {
                            "nm": "咸宁"
                        },
                        {
                            "nm": "随州"
                        },
                        {
                            "nm": "恩施"
                        },
                        {
                            "nm": "仙桃"
                        },
                        {
                            "nm": "潜江"
                        },
                        {
                            "nm": "天门"
                        },
                        {
                            "nm": "神农架"
                        }
                    ]
                },
                {
                    "nm": "湖南",
                    "city": [
                        {
                            "nm": "长沙"
                        },
                        {
                            "nm": "株洲"
                        },
                        {
                            "nm": "湘潭"
                        },
                        {
                            "nm": "衡阳"
                        },
                        {
                            "nm": "邵阳"
                        },
                        {
                            "nm": "岳阳"
                        },
                        {
                            "nm": "常德"
                        },
                        {
                            "nm": "张家界"
                        },
                        {
                            "nm": "益阳"
                        },
                        {
                            "nm": "郴州"
                        },
                        {
                            "nm": "永州"
                        },
                        {
                            "nm": "怀化"
                        },
                        {
                            "nm": "娄底"
                        },
                        {
                            "nm": "湘西"
                        }
                    ]
                },
                {
                    "nm": "广东",
                    "city": [
                        {
                            "nm": "广州"
                        },
                        {
                            "nm": "韶关"
                        },
                        {
                            "nm": "深圳"
                        },
                        {
                            "nm": "珠海"
                        },
                        {
                            "nm": "汕头"
                        },
                        {
                            "nm": "佛山"
                        },
                        {
                            "nm": "江门"
                        },
                        {
                            "nm": "湛江"
                        },
                        {
                            "nm": "茂名"
                        },
                        {
                            "nm": "肇庆"
                        },
                        {
                            "nm": "惠州"
                        },
                        {
                            "nm": "梅州"
                        },
                        {
                            "nm": "汕尾"
                        },
                        {
                            "nm": "河源"
                        },
                        {
                            "nm": "阳江"
                        },
                        {
                            "nm": "清远"
                        },
                        {
                            "nm": "东莞"
                        },
                        {
                            "nm": "中山"
                        },
                        {
                            "nm": "潮州"
                        },
                        {
                            "nm": "揭阳"
                        },
                        {
                            "nm": "云浮"
                        }
                    ]
                },
                {
                    "nm": "广西",
                    "city": [
                        {
                            "nm": "南宁"
                        },
                        {
                            "nm": "柳州"
                        },
                        {
                            "nm": "桂林"
                        },
                        {
                            "nm": "梧州"
                        },
                        {
                            "nm": "北海"
                        },
                        {
                            "nm": "防城港"
                        },
                        {
                            "nm": "钦州"
                        },
                        {
                            "nm": "贵港"
                        },
                        {
                            "nm": "玉林"
                        },
                        {
                            "nm": "百色"
                        },
                        {
                            "nm": "贺州"
                        },
                        {
                            "nm": "河池"
                        },
                        {
                            "nm": "来宾"
                        },
                        {
                            "nm": "崇左"
                        }
                    ]
                },
                {
                    "nm": "海南",
                    "city": [
                        {
                            "nm": "海口"
                        },
                        {
                            "nm": "三亚"
                        },
                        {
                            "nm": "三沙"
                        },
                        {
                            "nm": "五指山"
                        },
                        {
                            "nm": "琼海"
                        },
                        {
                            "nm": "儋州"
                        },
                        {
                            "nm": "文昌"
                        },
                        {
                            "nm": "万宁"
                        },
                        {
                            "nm": "东方"
                        },
                        {
                            "nm": "定安"
                        },
                        {
                            "nm": "屯昌"
                        },
                        {
                            "nm": "澄迈"
                        },
                        {
                            "nm": "临高"
                        },
                        {
                            "nm": "白沙"
                        },
                        {
                            "nm": "昌江"
                        },
                        {
                            "nm": "乐东"
                        },
                        {
                            "nm": "陵水"
                        },
                        {
                            "nm": "保亭"
                        },
                        {
                            "nm": "琼中"
                        }
                    ]
                },
                {
                    "nm": "重庆",
                    "city": [
                        {
                            "nm": "万州"
                        },
                        {
                            "nm": "涪陵"
                        },
                        {
                            "nm": "渝中"
                        },
                        {
                            "nm": "大渡口"
                        },
                        {
                            "nm": "江北"
                        },
                        {
                            "nm": "沙坪坝"
                        },
                        {
                            "nm": "九龙坡"
                        },
                        {
                            "nm": "南岸"
                        },
                        {
                            "nm": "北碚"
                        },
                        {
                            "nm": "两江新区"
                        },
                        {
                            "nm": "万盛"
                        },
                        {
                            "nm": "双桥"
                        },
                        {
                            "nm": "渝北"
                        },
                        {
                            "nm": "巴南"
                        },
                        {
                            "nm": "长寿"
                        },
                        {
                            "nm": "綦江"
                        },
                        {
                            "nm": "潼南"
                        },
                        {
                            "nm": "铜梁"
                        },
                        {
                            "nm": "大足"
                        },
                        {
                            "nm": "荣昌"
                        },
                        {
                            "nm": "璧山"
                        },
                        {
                            "nm": "梁平"
                        },
                        {
                            "nm": "城口"
                        },
                        {
                            "nm": "丰都"
                        },
                        {
                            "nm": "垫江"
                        },
                        {
                            "nm": "武隆"
                        },
                        {
                            "nm": "忠县"
                        },
                        {
                            "nm": "开县"
                        },
                        {
                            "nm": "云阳"
                        },
                        {
                            "nm": "奉节"
                        },
                        {
                            "nm": "巫山"
                        },
                        {
                            "nm": "巫溪"
                        },
                        {
                            "nm": "黔江"
                        },
                        {
                            "nm": "石柱"
                        },
                        {
                            "nm": "秀山"
                        },
                        {
                            "nm": "酉阳"
                        },
                        {
                            "nm": "彭水"
                        },
                        {
                            "nm": "江津"
                        },
                        {
                            "nm": "合川"
                        },
                        {
                            "nm": "永川"
                        },
                        {
                            "nm": "南川"
                        }
                    ]
                },
                {
                    "nm": "四川",
                    "city": [
                        {
                            "nm": "成都"
                        },
                        {
                            "nm": "自贡"
                        },
                        {
                            "nm": "攀枝花"
                        },
                        {
                            "nm": "泸州"
                        },
                        {
                            "nm": "德阳"
                        },
                        {
                            "nm": "绵阳"
                        },
                        {
                            "nm": "广元"
                        },
                        {
                            "nm": "遂宁"
                        },
                        {
                            "nm": "内江"
                        },
                        {
                            "nm": "乐山"
                        },
                        {
                            "nm": "南充"
                        },
                        {
                            "nm": "眉山"
                        },
                        {
                            "nm": "宜宾"
                        },
                        {
                            "nm": "广安"
                        },
                        {
                            "nm": "达州"
                        },
                        {
                            "nm": "雅安"
                        },
                        {
                            "nm": "巴中"
                        },
                        {
                            "nm": "资阳"
                        },
                        {
                            "nm": "阿坝"
                        },
                        {
                            "nm": "甘孜"
                        },
                        {
                            "nm": "凉山"
                        }
                    ]
                },
                {
                    "nm": "贵州",
                    "city": [
                        {
                            "nm": "贵阳"
                        },
                        {
                            "nm": "六盘水"
                        },
                        {
                            "nm": "遵义"
                        },
                        {
                            "nm": "安顺"
                        },
                        {
                            "nm": "铜仁"
                        },
                        {
                            "nm": "黔西南"
                        },
                        {
                            "nm": "毕节"
                        },
                        {
                            "nm": "黔东南"
                        },
                        {
                            "nm": "黔南"
                        }
                    ]
                },
                {
                    "nm": "云南",
                    "city": [
                        {
                            "nm": "昆明"
                        },
                        {
                            "nm": "曲靖"
                        },
                        {
                            "nm": "玉溪"
                        },
                        {
                            "nm": "保山"
                        },
                        {
                            "nm": "昭通"
                        },
                        {
                            "nm": "丽江"
                        },
                        {
                            "nm": "普洱"
                        },
                        {
                            "nm": "临沧"
                        },
                        {
                            "nm": "楚雄"
                        },
                        {
                            "nm": "红河"
                        },
                        {
                            "nm": "文山"
                        },
                        {
                            "nm": "西双版纳"
                        },
                        {
                            "nm": "大理"
                        },
                        {
                            "nm": "德宏"
                        },
                        {
                            "nm": "怒江"
                        },
                        {
                            "nm": "迪庆"
                        }
                    ]
                },
                {
                    "nm": "西藏",
                    "city": [
                        {
                            "nm": "拉萨"
                        },
                        {
                            "nm": "昌都"
                        },
                        {
                            "nm": "山南"
                        },
                        {
                            "nm": "日喀则"
                        },
                        {
                            "nm": "那曲"
                        },
                        {
                            "nm": "阿里"
                        },
                        {
                            "nm": "林芝"
                        }
                    ]
                },
                {
                    "nm": "陕西",
                    "city": [
                        {
                            "nm": "西安"
                        },
                        {
                            "nm": "铜川"
                        },
                        {
                            "nm": "宝鸡"
                        },
                        {
                            "nm": "咸阳"
                        },
                        {
                            "nm": "渭南"
                        },
                        {
                            "nm": "延安"
                        },
                        {
                            "nm": "汉中"
                        },
                        {
                            "nm": "榆林"
                        },
                        {
                            "nm": "安康"
                        },
                        {
                            "nm": "商洛"
                        }
                    ]
                },
                {
                    "nm": "甘肃",
                    "city": [
                        {
                            "nm": "兰州市"
                        },
                        {
                            "nm": "嘉峪关"
                        },
                        {
                            "nm": "金昌"
                        },
                        {
                            "nm": "白银"
                        },
                        {
                            "nm": "天水"
                        },
                        {
                            "nm": "武威"
                        },
                        {
                            "nm": "张掖"
                        },
                        {
                            "nm": "平凉"
                        },
                        {
                            "nm": "酒泉"
                        },
                        {
                            "nm": "庆阳"
                        },
                        {
                            "nm": "定西"
                        },
                        {
                            "nm": "陇南"
                        },
                        {
                            "nm": "临夏"
                        },
                        {
                            "nm": "甘南"
                        }
                    ]
                },
                {
                    "nm": "青海",
                    "city": [
                        {
                            "nm": "西宁"
                        },
                        {
                            "nm": "海东"
                        },
                        {
                            "nm": "海北"
                        },
                        {
                            "nm": "黄南"
                        },
                        {
                            "nm": "海南"
                        },
                        {
                            "nm": "果洛"
                        },
                        {
                            "nm": "玉树"
                        },
                        {
                            "nm": "海西"
                        }
                    ]
                },
                {
                    "nm": "宁夏",
                    "city": [
                        {
                            "nm": "银川"
                        },
                        {
                            "nm": "石嘴山"
                        },
                        {
                            "nm": "吴忠"
                        },
                        {
                            "nm": "固原"
                        },
                        {
                            "nm": "中卫"
                        }
                    ]
                },
                {
                    "nm": "新疆",
                    "city": [
                        {
                            "nm": "乌鲁木齐"
                        },
                        {
                            "nm": "克拉玛依"
                        },
                        {
                            "nm": "吐鲁番"
                        },
                        {
                            "nm": "哈密"
                        },
                        {
                            "nm": "昌吉"
                        },
                        {
                            "nm": "博尔塔拉"
                        },
                        {
                            "nm": "巴音郭楞"
                        },
                        {
                            "nm": "阿克苏"
                        },
                        {
                            "nm": "克孜勒苏"
                        },
                        {
                            "nm": "喀什"
                        },
                        {
                            "nm": "和田"
                        },
                        {
                            "nm": "伊犁"
                        },
                        {
                            "nm": "塔城"
                        },
                        {
                            "nm": "阿勒泰"
                        },
                        {
                            "nm": "石河子"
                        },
                        {
                            "nm": "阿拉尔"
                        },
                        {
                            "nm": "图木舒克"
                        },
                        {
                            "nm": "五家渠"
                        },
                        {
                            "nm": "北屯"
                        }
                    ]
                },
                {
                    "nm": "台湾",
                    "city": [
                        {
                            "nm": "台北市"
                        },
                        {
                            "nm": "高雄市"
                        },
                        {
                            "nm": "基隆市"
                        },
                        {
                            "nm": "台中市"
                        },
                        {
                            "nm": "台南市"
                        },
                        {
                            "nm": "新竹市"
                        },
                        {
                            "nm": "嘉义市"
                        },
                        {
                            "nm": "台北县"
                        },
                        {
                            "nm": "宜兰县"
                        },
                        {
                            "nm": "桃园县"
                        },
                        {
                            "nm": "新竹县"
                        },
                        {
                            "nm": "苗栗县"
                        },
                        {
                            "nm": "台中县"
                        },
                        {
                            "nm": "彰化县"
                        },
                        {
                            "nm": "南投县"
                        },
                        {
                            "nm": "云林县"
                        },
                        {
                            "nm": "嘉义县"
                        },
                        {
                            "nm": "台南县"
                        },
                        {
                            "nm": "高雄县"
                        },
                        {
                            "nm": "屏东县"
                        },
                        {
                            "nm": "台东县"
                        },
                        {
                            "nm": "花莲县"
                        },
                        {
                            "nm": "澎湖县"
                        }
                    ]
                },
                {
                    "nm": "香港",
                    "city": [
                        {
                            "nm": "中西区"
                        },
                        {
                            "nm": "东区"
                        },
                        {
                            "nm": "九龙城区"
                        },
                        {
                            "nm": "观塘区"
                        },
                        {
                            "nm": "南区"
                        },
                        {
                            "nm": "深水埗区"
                        },
                        {
                            "nm": "黄大仙区"
                        },
                        {
                            "nm": "湾仔区"
                        },
                        {
                            "nm": "油尖旺区"
                        },
                        {
                            "nm": "离岛区"
                        },
                        {
                            "nm": "葵青区"
                        },
                        {
                            "nm": "北区"
                        },
                        {
                            "nm": "西贡区"
                        },
                        {
                            "nm": "沙田区"
                        },
                        {
                            "nm": "屯门区"
                        },
                        {
                            "nm": "大埔区"
                        },
                        {
                            "nm": "荃湾区"
                        },
                        {
                            "nm": "元朗区"
                        }
                    ]
                },
                {
                    "nm": "澳门",
                    "city": [
                        {
                            "nm": "花地玛堂区"
                        },
                        {
                            "nm": "圣安多尼堂区"
                        },
                        {
                            "nm": "大堂区"
                        },
                        {
                            "nm": "望德堂区"
                        },
                        {
                            "nm": "风顺堂区"
                        },
                        {
                            "nm": "氹仔"
                        },
                        {
                            "nm": "路环"
                        }
                    ]
                }
            ]
        },
        {
            "nm": "阿尔巴尼亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "爱尔巴桑"
                        },
                        {
                            "nm": "迪勃拉"
                        },
                        {
                            "nm": "地拉那"
                        },
                        {
                            "nm": "都拉斯"
                        },
                        {
                            "nm": "发罗拉"
                        },
                        {
                            "nm": "费里"
                        },
                        {
                            "nm": "吉诺卡斯特"
                        },
                        {
                            "nm": "科尔察"
                        },
                        {
                            "nm": "库克斯"
                        },
                        {
                            "nm": "莱什"
                        },
                        {
                            "nm": "培拉特"
                        },
                        {
                            "nm": "斯库台"
                        }
                    ],
                    "nm": "阿尔巴尼亚"
                }
            ]
        },
        {
            "nm": "阿尔及利亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿德拉尔"
                        },
                        {
                            "nm": "阿尔及尔"
                        },
                        {
                            "nm": "艾因·德夫拉"
                        },
                        {
                            "nm": "艾因·蒂姆尚特"
                        },
                        {
                            "nm": "安纳巴"
                        },
                        {
                            "nm": "奥兰"
                        },
                        {
                            "nm": "巴特纳"
                        },
                        {
                            "nm": "贝贾亚"
                        },
                        {
                            "nm": "贝沙尔"
                        },
                        {
                            "nm": "贝伊德"
                        },
                        {
                            "nm": "比斯克拉"
                        },
                        {
                            "nm": "布尔吉·布阿雷里吉"
                        },
                        {
                            "nm": "布利达"
                        },
                        {
                            "nm": "布迈德斯"
                        },
                        {
                            "nm": "布依拉"
                        },
                        {
                            "nm": "蒂巴扎"
                        },
                        {
                            "nm": "蒂斯姆西勒特"
                        },
                        {
                            "nm": "盖尔达耶"
                        },
                        {
                            "nm": "盖尔马"
                        },
                        {
                            "nm": "罕西拉"
                        },
                        {
                            "nm": "赫利赞"
                        },
                        {
                            "nm": "吉杰尔"
                        },
                        {
                            "nm": "杰勒法"
                        },
                        {
                            "nm": "君士坦丁"
                        },
                        {
                            "nm": "拉格瓦特"
                        },
                        {
                            "nm": "马斯卡拉"
                        },
                        {
                            "nm": "麦迪亚"
                        },
                        {
                            "nm": "密拉"
                        },
                        {
                            "nm": "莫斯塔加纳姆"
                        },
                        {
                            "nm": "姆西拉"
                        },
                        {
                            "nm": "纳阿马"
                        },
                        {
                            "nm": "塞蒂夫"
                        },
                        {
                            "nm": "赛伊达"
                        },
                        {
                            "nm": "斯基克达"
                        },
                        {
                            "nm": "苏克·阿赫拉斯"
                        },
                        {
                            "nm": "塔里夫"
                        },
                        {
                            "nm": "塔曼拉塞特"
                        },
                        {
                            "nm": "特贝萨"
                        },
                        {
                            "nm": "特莱姆森"
                        },
                        {
                            "nm": "提济乌祖"
                        },
                        {
                            "nm": "提亚雷特"
                        },
                        {
                            "nm": "廷杜夫"
                        },
                        {
                            "nm": "瓦德"
                        },
                        {
                            "nm": "瓦尔格拉"
                        },
                        {
                            "nm": "乌姆布阿基"
                        },
                        {
                            "nm": "西迪贝勒阿贝斯"
                        },
                        {
                            "nm": "谢里夫"
                        },
                        {
                            "nm": "伊利齐"
                        }
                    ],
                    "nm": "阿尔及利亚"
                }
            ]
        },
        {
            "nm": "阿富汗",
            "state": [
                {
                    "city": [
                        {
                            "nm": "赫拉特"
                        },
                        {
                            "nm": "喀布尔"
                        },
                        {
                            "nm": "坎大哈"
                        },
                        {
                            "nm": "马扎里沙里夫"
                        }
                    ],
                    "nm": "阿富汗"
                }
            ]
        },
        {
            "nm": "阿根廷",
            "state": [
                {
                    "city": [
                        {
                            "nm": "巴拉那"
                        },
                        {
                            "nm": "别德马"
                        },
                        {
                            "nm": "波萨达斯"
                        },
                        {
                            "nm": "布兰卡港"
                        },
                        {
                            "nm": "布宜诺斯艾利斯"
                        },
                        {
                            "nm": "福莫萨"
                        },
                        {
                            "nm": "胡胡伊"
                        },
                        {
                            "nm": "卡塔马卡"
                        },
                        {
                            "nm": "科尔多瓦"
                        },
                        {
                            "nm": "科连特斯"
                        },
                        {
                            "nm": "克劳斯城"
                        },
                        {
                            "nm": "肯考迪娅"
                        },
                        {
                            "nm": "拉里奥哈"
                        },
                        {
                            "nm": "拉普拉塔"
                        },
                        {
                            "nm": "雷西斯滕匹亚"
                        },
                        {
                            "nm": "里奥加耶戈斯"
                        },
                        {
                            "nm": "里奥夸尔托"
                        },
                        {
                            "nm": "里瓦达维亚海军准将城"
                        },
                        {
                            "nm": "罗萨里奥"
                        },
                        {
                            "nm": "罗森"
                        },
                        {
                            "nm": "马德普拉塔"
                        },
                        {
                            "nm": "门多萨"
                        },
                        {
                            "nm": "内乌肯"
                        },
                        {
                            "nm": "萨尔塔"
                        },
                        {
                            "nm": "圣地亚哥-德尔埃斯特罗"
                        },
                        {
                            "nm": "圣菲"
                        },
                        {
                            "nm": "圣胡安"
                        },
                        {
                            "nm": "圣拉斐尔"
                        },
                        {
                            "nm": "圣路易斯"
                        },
                        {
                            "nm": "圣罗莎"
                        },
                        {
                            "nm": "圣米格尔-德图库曼"
                        },
                        {
                            "nm": "圣尼古拉斯"
                        },
                        {
                            "nm": "特雷利乌"
                        },
                        {
                            "nm": "乌斯怀亚"
                        }
                    ],
                    "nm": "阿根廷"
                }
            ]
        },
        {
            "nm": "阿拉伯联合酋长国",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿布扎比"
                        },
                        {
                            "nm": "艾因"
                        },
                        {
                            "nm": "迪拜"
                        },
                        {
                            "nm": "沙迦"
                        }
                    ],
                    "nm": "阿拉伯联合酋长国"
                }
            ]
        },
        {
            "nm": "阿鲁巴",
            "state": []
        },
        {
            "nm": "阿曼",
            "state": [
                {
                    "city": [
                        {
                            "nm": "巴提奈地区"
                        },
                        {
                            "nm": "达希莱地区"
                        },
                        {
                            "nm": "东部地区"
                        },
                        {
                            "nm": "马斯喀特省"
                        },
                        {
                            "nm": "穆桑达姆省"
                        },
                        {
                            "nm": "内地地区"
                        },
                        {
                            "nm": "中部地区"
                        },
                        {
                            "nm": "佐法尔省"
                        }
                    ],
                    "nm": "阿曼"
                }
            ]
        },
        {
            "nm": "阿塞拜疆",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿布歇隆"
                        },
                        {
                            "nm": "哈奇马斯"
                        },
                        {
                            "nm": "卡尔巴卡尔"
                        },
                        {
                            "nm": "卡扎赫"
                        },
                        {
                            "nm": "连科兰"
                        },
                        {
                            "nm": "密尔-卡拉巴赫"
                        },
                        {
                            "nm": "穆甘-萨连"
                        },
                        {
                            "nm": "纳戈尔诺－卡拉巴赫"
                        },
                        {
                            "nm": "纳希切万"
                        },
                        {
                            "nm": "普利亚拉克斯"
                        },
                        {
                            "nm": "舍基"
                        },
                        {
                            "nm": "苏姆盖特"
                        },
                        {
                            "nm": "锡尔万"
                        },
                        {
                            "nm": "占贾"
                        }
                    ],
                    "nm": "阿塞拜疆"
                }
            ]
        },
        {
            "nm": "阿森松岛",
            "state": []
        },
        {
            "nm": "埃及",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿斯旺"
                        },
                        {
                            "nm": "古尔代盖"
                        },
                        {
                            "nm": "开罗"
                        },
                        {
                            "nm": "苏布拉开马"
                        },
                        {
                            "nm": "亚历山大"
                        }
                    ],
                    "nm": "埃及"
                }
            ]
        },
        {
            "nm": "埃塞俄比亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿法尔"
                        },
                        {
                            "nm": "阿姆哈拉"
                        },
                        {
                            "nm": "奥罗米亚"
                        },
                        {
                            "nm": "宾香古尔"
                        },
                        {
                            "nm": "德雷达瓦"
                        },
                        {
                            "nm": "甘贝拉各族"
                        },
                        {
                            "nm": "哈勒里民族"
                        },
                        {
                            "nm": "南方各族"
                        },
                        {
                            "nm": "索马里"
                        },
                        {
                            "nm": "提格雷"
                        },
                        {
                            "nm": "亚的斯亚贝巴"
                        }
                    ],
                    "nm": "埃塞俄比亚"
                }
            ]
        },
        {
            "nm": "爱尔兰",
            "state": [
                {
                    "city": [
                        {
                            "nm": "奥法利"
                        },
                        {
                            "nm": "蒂珀雷里"
                        },
                        {
                            "nm": "都柏林"
                        },
                        {
                            "nm": "多内加尔"
                        },
                        {
                            "nm": "戈尔韦"
                        },
                        {
                            "nm": "基尔代尔"
                        },
                        {
                            "nm": "基尔肯尼"
                        },
                        {
                            "nm": "卡范"
                        },
                        {
                            "nm": "卡洛"
                        },
                        {
                            "nm": "凯里"
                        },
                        {
                            "nm": "科克"
                        },
                        {
                            "nm": "克莱尔"
                        },
                        {
                            "nm": "朗福德"
                        },
                        {
                            "nm": "劳斯"
                        },
                        {
                            "nm": "崂斯"
                        },
                        {
                            "nm": "利默里克"
                        },
                        {
                            "nm": "利特里姆"
                        },
                        {
                            "nm": "罗斯康芒"
                        },
                        {
                            "nm": "梅奥"
                        },
                        {
                            "nm": "米斯"
                        },
                        {
                            "nm": "莫内根"
                        },
                        {
                            "nm": "斯莱戈"
                        },
                        {
                            "nm": "威克洛"
                        },
                        {
                            "nm": "韦克斯福德"
                        },
                        {
                            "nm": "沃特福德"
                        },
                        {
                            "nm": "西米斯"
                        }
                    ],
                    "nm": "爱尔兰"
                }
            ]
        },
        {
            "nm": "爱沙尼亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "贝尔瓦"
                        },
                        {
                            "nm": "哈留"
                        },
                        {
                            "nm": "拉普拉"
                        },
                        {
                            "nm": "里亚内"
                        },
                        {
                            "nm": "帕尔努"
                        },
                        {
                            "nm": "萨雷"
                        },
                        {
                            "nm": "塔尔图"
                        },
                        {
                            "nm": "瓦尔加"
                        },
                        {
                            "nm": "维良地"
                        },
                        {
                            "nm": "维鲁"
                        },
                        {
                            "nm": "沃鲁"
                        },
                        {
                            "nm": "希尤"
                        },
                        {
                            "nm": "耶尔韦"
                        },
                        {
                            "nm": "耶盖瓦"
                        },
                        {
                            "nm": "依达－维鲁"
                        }
                    ],
                    "nm": "爱沙尼亚"
                }
            ]
        },
        {
            "nm": "安道尔",
            "state": [
                {
                    "city": [
                        {
                            "nm": "安道尔城"
                        },
                        {
                            "nm": "奥尔迪诺"
                        },
                        {
                            "nm": "恩坎普"
                        },
                        {
                            "nm": "卡尼略"
                        },
                        {
                            "nm": "莱塞斯卡尔德－恩戈尔达"
                        },
                        {
                            "nm": "马萨纳"
                        },
                        {
                            "nm": "圣胡利娅－德洛里亚"
                        }
                    ],
                    "nm": "安道尔"
                }
            ]
        },
        {
            "nm": "安哥拉",
            "state": [
                {
                    "city": [
                        {
                            "nm": "北宽扎"
                        },
                        {
                            "nm": "北隆达"
                        },
                        {
                            "nm": "本戈"
                        },
                        {
                            "nm": "本格拉"
                        },
                        {
                            "nm": "比耶"
                        },
                        {
                            "nm": "卡宾达"
                        },
                        {
                            "nm": "库内内"
                        },
                        {
                            "nm": "宽多库邦戈"
                        },
                        {
                            "nm": "罗安达"
                        },
                        {
                            "nm": "马兰热"
                        },
                        {
                            "nm": "莫希科"
                        },
                        {
                            "nm": "纳米贝"
                        },
                        {
                            "nm": "南宽扎"
                        },
                        {
                            "nm": "南隆达"
                        },
                        {
                            "nm": "万博"
                        },
                        {
                            "nm": "威拉"
                        },
                        {
                            "nm": "威热"
                        },
                        {
                            "nm": "扎伊尔"
                        }
                    ],
                    "nm": "安哥拉"
                }
            ]
        },
        {
            "nm": "安圭拉",
            "state": []
        },
        {
            "nm": "安提瓜岛和巴布达",
            "state": []
        },
        {
            "nm": "澳大利亚",
            "state": [
                {
                    "nm": "北部地区",
                    "city": [
                        {
                            "nm": "北帕默斯顿"
                        },
                        {
                            "nm": "达尔文"
                        }
                    ]
                },
                {
                    "nm": "堪培拉",
                    "city": [
                        {
                            "nm": "堪培拉"
                        }
                    ]
                },
                {
                    "nm": "昆士兰",
                    "city": [
                        {
                            "nm": "布里斯班"
                        },
                        {
                            "nm": "黄金海岸"
                        },
                        {
                            "nm": "凯恩斯"
                        },
                        {
                            "nm": "日光海岸"
                        },
                        {
                            "nm": "汤斯维尔"
                        },
                        {
                            "nm": "图文巴"
                        }
                    ]
                },
                {
                    "nm": "南澳大利亚",
                    "city": [
                        {
                            "nm": "阿德莱德"
                        },
                        {
                            "nm": "奥古斯塔港"
                        },
                        {
                            "nm": "甘比亚山"
                        },
                        {
                            "nm": "怀阿拉"
                        },
                        {
                            "nm": "林肯港"
                        },
                        {
                            "nm": "默里布里奇"
                        },
                        {
                            "nm": "皮里港"
                        },
                        {
                            "nm": "维克托港"
                        }
                    ]
                },
                {
                    "nm": "塔斯马尼亚",
                    "city": [
                        {
                            "nm": "伯尼港"
                        },
                        {
                            "nm": "德文波特"
                        },
                        {
                            "nm": "霍巴特"
                        },
                        {
                            "nm": "朗塞斯顿"
                        }
                    ]
                },
                {
                    "nm": "维多利亚",
                    "city": [
                        {
                            "nm": "吉朗"
                        },
                        {
                            "nm": "墨尔本"
                        }
                    ]
                },
                {
                    "nm": "西澳大利亚",
                    "city": [
                        {
                            "nm": "奥尔巴尼"
                        },
                        {
                            "nm": "班伯里"
                        },
                        {
                            "nm": "弗里曼特尔港"
                        },
                        {
                            "nm": "杰拉尔顿"
                        },
                        {
                            "nm": "卡尔古利"
                        },
                        {
                            "nm": "曼哲拉"
                        },
                        {
                            "nm": "珀斯"
                        }
                    ]
                },
                {
                    "nm": "新南威尔士",
                    "city": [
                        {
                            "nm": "纽卡斯尔"
                        },
                        {
                            "nm": "伍伦贡"
                        },
                        {
                            "nm": "悉尼"
                        }
                    ]
                }
            ]
        },
        {
            "nm": "奥地利",
            "state": [
                {
                    "city": [
                        {
                            "nm": "布尔根兰"
                        },
                        {
                            "nm": "蒂罗尔"
                        },
                        {
                            "nm": "福拉尔贝格"
                        },
                        {
                            "nm": "克恩顿"
                        },
                        {
                            "nm": "萨尔茨堡"
                        },
                        {
                            "nm": "上奥地利"
                        },
                        {
                            "nm": "施蒂利亚"
                        },
                        {
                            "nm": "维也纳"
                        },
                        {
                            "nm": "下奥地利"
                        }
                    ],
                    "nm": "奥地利"
                }
            ]
        },
        {
            "nm": "奥兰群岛",
            "state": []
        },
        {
            "nm": "巴巴多斯岛",
            "state": []
        },
        {
            "nm": "巴布亚新几内亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "北部"
                        },
                        {
                            "nm": "布干维尔"
                        },
                        {
                            "nm": "东部高地"
                        },
                        {
                            "nm": "东塞皮克"
                        },
                        {
                            "nm": "东新不列颠"
                        },
                        {
                            "nm": "恩加"
                        },
                        {
                            "nm": "海湾"
                        },
                        {
                            "nm": "马当"
                        },
                        {
                            "nm": "马努斯"
                        },
                        {
                            "nm": "米尔恩湾"
                        },
                        {
                            "nm": "莫尔兹比港"
                        },
                        {
                            "nm": "莫罗贝"
                        },
                        {
                            "nm": "南部高地"
                        },
                        {
                            "nm": "钦布"
                        },
                        {
                            "nm": "桑道恩"
                        },
                        {
                            "nm": "西部"
                        },
                        {
                            "nm": "西部高地"
                        },
                        {
                            "nm": "西新不列颠"
                        },
                        {
                            "nm": "新爱尔兰"
                        }
                    ],
                    "nm": "巴布亚新几内亚"
                }
            ]
        },
        {
            "nm": "巴哈马",
            "state": []
        },
        {
            "nm": "巴基斯坦",
            "state": [
                {
                    "city": [
                        {
                            "nm": "白沙瓦"
                        },
                        {
                            "nm": "费萨拉巴德"
                        },
                        {
                            "nm": "故吉软瓦拉"
                        },
                        {
                            "nm": "海德拉巴"
                        },
                        {
                            "nm": "卡拉奇"
                        },
                        {
                            "nm": "拉合尔"
                        },
                        {
                            "nm": "拉瓦尔品第"
                        },
                        {
                            "nm": "木尔坦"
                        },
                        {
                            "nm": "伊斯兰堡"
                        }
                    ],
                    "nm": "巴基斯坦"
                }
            ]
        },
        {
            "nm": "巴拉圭",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿曼拜"
                        },
                        {
                            "nm": "阿耶斯总统省"
                        },
                        {
                            "nm": "巴拉瓜里"
                        },
                        {
                            "nm": "博克龙"
                        },
                        {
                            "nm": "瓜伊拉"
                        },
                        {
                            "nm": "卡瓜苏"
                        },
                        {
                            "nm": "卡嫩迪尤"
                        },
                        {
                            "nm": "卡萨帕"
                        },
                        {
                            "nm": "康塞普西翁"
                        },
                        {
                            "nm": "科迪勒拉"
                        },
                        {
                            "nm": "米西奥内斯"
                        },
                        {
                            "nm": "涅恩布库"
                        },
                        {
                            "nm": "上巴拉圭"
                        },
                        {
                            "nm": "上巴拉那"
                        },
                        {
                            "nm": "圣佩德罗"
                        },
                        {
                            "nm": "亚松森特别区"
                        },
                        {
                            "nm": "伊塔普亚"
                        },
                        {
                            "nm": "中央"
                        }
                    ],
                    "nm": "巴拉圭"
                }
            ]
        },
        {
            "nm": "巴勒斯坦",
            "state": [
                {
                    "city": [
                        {
                            "nm": "加沙地带"
                        },
                        {
                            "nm": "西岸"
                        }
                    ],
                    "nm": "巴勒斯坦"
                }
            ]
        },
        {
            "nm": "巴林",
            "state": [
                {
                    "city": [
                        {
                            "nm": "北部"
                        },
                        {
                            "nm": "哈德"
                        },
                        {
                            "nm": "哈马德"
                        },
                        {
                            "nm": "里法"
                        },
                        {
                            "nm": "麦纳麦"
                        },
                        {
                            "nm": "穆哈拉格"
                        },
                        {
                            "nm": "西部"
                        },
                        {
                            "nm": "伊萨城"
                        },
                        {
                            "nm": "中部"
                        }
                    ],
                    "nm": "巴林"
                }
            ]
        },
        {
            "nm": "巴拿马",
            "state": []
        },
        {
            "nm": "巴西",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿克里"
                        },
                        {
                            "nm": "阿拉戈斯"
                        },
                        {
                            "nm": "阿马帕"
                        },
                        {
                            "nm": "巴拉那"
                        },
                        {
                            "nm": "巴西利亚"
                        },
                        {
                            "nm": "巴伊亚"
                        },
                        {
                            "nm": "北里奥格兰德"
                        },
                        {
                            "nm": "伯南布哥"
                        },
                        {
                            "nm": "戈亚斯"
                        },
                        {
                            "nm": "朗多尼亚"
                        },
                        {
                            "nm": "里约热内卢"
                        },
                        {
                            "nm": "罗赖马"
                        },
                        {
                            "nm": "马拉尼昂"
                        },
                        {
                            "nm": "马托格罗索"
                        },
                        {
                            "nm": "米纳斯吉拉斯"
                        },
                        {
                            "nm": "南里奥格兰德"
                        },
                        {
                            "nm": "南马托格罗索"
                        },
                        {
                            "nm": "帕拉"
                        },
                        {
                            "nm": "帕拉伊巴"
                        },
                        {
                            "nm": "皮奥伊"
                        },
                        {
                            "nm": "塞阿拉"
                        },
                        {
                            "nm": "塞尔希培"
                        },
                        {
                            "nm": "圣埃斯皮里图"
                        },
                        {
                            "nm": "圣保罗"
                        },
                        {
                            "nm": "圣卡塔琳娜"
                        },
                        {
                            "nm": "托坎廷斯"
                        },
                        {
                            "nm": "亚马孙"
                        }
                    ],
                    "nm": "巴西"
                }
            ]
        },
        {
            "nm": "白俄罗斯",
            "state": [
                {
                    "city": [
                        {
                            "nm": "布列斯特"
                        },
                        {
                            "nm": "戈梅利"
                        },
                        {
                            "nm": "格罗德诺"
                        },
                        {
                            "nm": "明斯克市"
                        },
                        {
                            "nm": "莫吉廖夫"
                        },
                        {
                            "nm": "维捷布斯克"
                        }
                    ],
                    "nm": "白俄罗斯"
                }
            ]
        },
        {
            "nm": "百慕大",
            "state": []
        },
        {
            "nm": "保加利亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "布尔加斯"
                        },
                        {
                            "nm": "卡斯科伏"
                        },
                        {
                            "nm": "鲁塞"
                        },
                        {
                            "nm": "洛维奇"
                        },
                        {
                            "nm": "蒙塔纳"
                        },
                        {
                            "nm": "普罗夫迪夫"
                        },
                        {
                            "nm": "索非亚"
                        },
                        {
                            "nm": "索非亚市"
                        },
                        {
                            "nm": "瓦尔纳"
                        }
                    ],
                    "nm": "保加利亚"
                }
            ]
        },
        {
            "nm": "北马里亚纳群岛",
            "state": []
        },
        {
            "nm": "贝宁",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿黎博里"
                        },
                        {
                            "nm": "阿塔科拉"
                        },
                        {
                            "nm": "滨海"
                        },
                        {
                            "nm": "波希康市"
                        },
                        {
                            "nm": "博尔古"
                        },
                        {
                            "nm": "大西洋"
                        },
                        {
                            "nm": "高原"
                        },
                        {
                            "nm": "库福"
                        },
                        {
                            "nm": "莫诺"
                        },
                        {
                            "nm": "丘陵"
                        },
                        {
                            "nm": "韦梅"
                        },
                        {
                            "nm": "峡谷"
                        },
                        {
                            "nm": "祖"
                        }
                    ],
                    "nm": "贝宁"
                }
            ]
        },
        {
            "nm": "比利时",
            "state": [
                {
                    "city": [
                        {
                            "nm": "埃诺"
                        },
                        {
                            "nm": "安特卫普"
                        },
                        {
                            "nm": "布拉班特-瓦隆"
                        },
                        {
                            "nm": "布鲁塞尔"
                        },
                        {
                            "nm": "东佛兰德"
                        },
                        {
                            "nm": "佛兰芒-布拉班特"
                        },
                        {
                            "nm": "列日"
                        },
                        {
                            "nm": "林堡"
                        },
                        {
                            "nm": "卢森堡"
                        },
                        {
                            "nm": "那慕尔"
                        },
                        {
                            "nm": "西佛兰德"
                        }
                    ],
                    "nm": "比利时"
                }
            ]
        },
        {
            "nm": "冰岛",
            "state": []
        },
        {
            "nm": "波多黎各",
            "state": []
        },
        {
            "nm": "波兰",
            "state": [
                {
                    "city": [
                        {
                            "nm": "埃尔布隆格"
                        },
                        {
                            "nm": "奥尔什丁"
                        },
                        {
                            "nm": "奥斯特罗文卡"
                        },
                        {
                            "nm": "比得哥什"
                        },
                        {
                            "nm": "彼得库夫"
                        },
                        {
                            "nm": "比托姆"
                        },
                        {
                            "nm": "比亚瓦波德拉斯卡"
                        },
                        {
                            "nm": "比亚维斯托克"
                        },
                        {
                            "nm": "波莱"
                        },
                        {
                            "nm": "波兹南"
                        },
                        {
                            "nm": "达布罗瓦戈尼察"
                        },
                        {
                            "nm": "大波兰地区戈茹夫"
                        },
                        {
                            "nm": "弗罗茨瓦夫"
                        },
                        {
                            "nm": "弗沃茨瓦韦克"
                        },
                        {
                            "nm": "格但斯克"
                        },
                        {
                            "nm": "格丁尼亚"
                        },
                        {
                            "nm": "格利维采"
                        },
                        {
                            "nm": "格鲁琼兹"
                        },
                        {
                            "nm": "海乌姆"
                        },
                        {
                            "nm": "华沙"
                        },
                        {
                            "nm": "霍茹夫"
                        },
                        {
                            "nm": "卡利什"
                        },
                        {
                            "nm": "卡托维兹"
                        },
                        {
                            "nm": "凯尔采"
                        },
                        {
                            "nm": "科宁"
                        },
                        {
                            "nm": "科沙林"
                        },
                        {
                            "nm": "克拉科夫"
                        },
                        {
                            "nm": "克罗斯诺"
                        },
                        {
                            "nm": "拉多姆"
                        },
                        {
                            "nm": "莱格尼察"
                        },
                        {
                            "nm": "莱什诺"
                        },
                        {
                            "nm": "卢布林"
                        },
                        {
                            "nm": "鲁达"
                        },
                        {
                            "nm": "罗兹"
                        },
                        {
                            "nm": "绿山城"
                        },
                        {
                            "nm": "米什洛维采"
                        },
                        {
                            "nm": "皮瓦"
                        },
                        {
                            "nm": "普热梅希尔"
                        },
                        {
                            "nm": "普沃茨克"
                        },
                        {
                            "nm": "切哈努夫"
                        },
                        {
                            "nm": "热舒夫"
                        },
                        {
                            "nm": "什切青"
                        },
                        {
                            "nm": "斯凯尔涅维采"
                        },
                        {
                            "nm": "斯武普斯克"
                        },
                        {
                            "nm": "苏瓦乌基"
                        },
                        {
                            "nm": "索波特"
                        },
                        {
                            "nm": "索斯诺维茨"
                        },
                        {
                            "nm": "塔尔努夫"
                        },
                        {
                            "nm": "塔尔诺布热格"
                        },
                        {
                            "nm": "特切"
                        },
                        {
                            "nm": "托伦"
                        },
                        {
                            "nm": "瓦乌布日赫"
                        },
                        {
                            "nm": "沃姆扎"
                        },
                        {
                            "nm": "希米亚诺维采"
                        },
                        {
                            "nm": "希维诺乌伊希切"
                        },
                        {
                            "nm": "希维托赫洛维采"
                        },
                        {
                            "nm": "谢德尔采"
                        },
                        {
                            "nm": "谢拉兹"
                        },
                        {
                            "nm": "新松奇"
                        },
                        {
                            "nm": "雅沃兹诺"
                        },
                        {
                            "nm": "耶莱尼亚古拉"
                        },
                        {
                            "nm": "扎布热"
                        },
                        {
                            "nm": "扎莫希奇"
                        }
                    ],
                    "nm": "波兰"
                }
            ]
        },
        {
            "nm": "玻利维亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "奥尔托"
                        },
                        {
                            "nm": "奥鲁罗"
                        },
                        {
                            "nm": "贝尼"
                        },
                        {
                            "nm": "波多西"
                        },
                        {
                            "nm": "基拉科洛"
                        },
                        {
                            "nm": "科恰班巴"
                        },
                        {
                            "nm": "拉巴斯"
                        },
                        {
                            "nm": "潘多"
                        },
                        {
                            "nm": "丘基萨卡"
                        },
                        {
                            "nm": "萨卡巴"
                        },
                        {
                            "nm": "圣克鲁斯"
                        },
                        {
                            "nm": "塔里哈"
                        }
                    ],
                    "nm": "玻利维亚"
                }
            ]
        },
        {
            "nm": "波斯尼亚和黑塞哥维那",
            "state": [
                {
                    "city": [
                        {
                            "nm": "波萨维纳"
                        },
                        {
                            "nm": "波斯尼亚－波德里涅"
                        },
                        {
                            "nm": "多米斯拉夫格勒"
                        },
                        {
                            "nm": "黑塞哥维那－涅雷特瓦"
                        },
                        {
                            "nm": "萨拉热窝"
                        },
                        {
                            "nm": "图兹拉－波德里涅"
                        },
                        {
                            "nm": "乌纳－萨纳"
                        },
                        {
                            "nm": "西波斯尼亚"
                        },
                        {
                            "nm": "西黑塞哥维那"
                        },
                        {
                            "nm": "泽尼察－多博伊"
                        },
                        {
                            "nm": "中波斯尼亚"
                        }
                    ],
                    "nm": "波斯尼亚和黑塞哥维那"
                }
            ]
        },
        {
            "nm": "博茨瓦纳",
            "state": []
        },
        {
            "nm": "伯利兹",
            "state": [
                {
                    "city": [
                        {
                            "nm": "伯利兹"
                        },
                        {
                            "nm": "橘园"
                        },
                        {
                            "nm": "卡约"
                        },
                        {
                            "nm": "科罗萨尔"
                        },
                        {
                            "nm": "斯坦港"
                        },
                        {
                            "nm": "托莱多"
                        }
                    ],
                    "nm": "伯利兹"
                }
            ]
        },
        {
            "nm": "不丹",
            "state": []
        },
        {
            "nm": "布基纳法索",
            "state": [
                {
                    "city": [
                        {
                            "nm": "巴雷"
                        },
                        {
                            "nm": "巴姆"
                        },
                        {
                            "nm": "巴瓦"
                        },
                        {
                            "nm": "巴泽加"
                        },
                        {
                            "nm": "波尼"
                        },
                        {
                            "nm": "布尔古"
                        },
                        {
                            "nm": "布尔基恩德"
                        },
                        {
                            "nm": "布古里巴"
                        },
                        {
                            "nm": "冈祖尔古"
                        },
                        {
                            "nm": "古尔马"
                        },
                        {
                            "nm": "济罗"
                        },
                        {
                            "nm": "卡焦戈"
                        },
                        {
                            "nm": "凯内杜古"
                        },
                        {
                            "nm": "科蒙加里"
                        },
                        {
                            "nm": "科莫埃"
                        },
                        {
                            "nm": "孔皮恩加"
                        },
                        {
                            "nm": "孔西"
                        },
                        {
                            "nm": "库尔佩罗戈"
                        },
                        {
                            "nm": "库尔维奥戈"
                        },
                        {
                            "nm": "库里滕加"
                        },
                        {
                            "nm": "雷拉巴"
                        },
                        {
                            "nm": "罗卢姆"
                        },
                        {
                            "nm": "穆翁"
                        },
                        {
                            "nm": "纳门滕加"
                        },
                        {
                            "nm": "纳乌里"
                        },
                        {
                            "nm": "纳亚拉"
                        },
                        {
                            "nm": "尼亚尼亚"
                        },
                        {
                            "nm": "努姆比埃尔"
                        },
                        {
                            "nm": "帕索雷"
                        },
                        {
                            "nm": "塞诺"
                        },
                        {
                            "nm": "桑吉"
                        },
                        {
                            "nm": "桑马滕加"
                        },
                        {
                            "nm": "苏鲁"
                        },
                        {
                            "nm": "苏姆"
                        },
                        {
                            "nm": "塔波阿"
                        },
                        {
                            "nm": "图伊"
                        },
                        {
                            "nm": "乌埃"
                        },
                        {
                            "nm": "乌布里滕加"
                        },
                        {
                            "nm": "乌达兰"
                        },
                        {
                            "nm": "锡西里"
                        },
                        {
                            "nm": "亚加"
                        },
                        {
                            "nm": "亚滕加"
                        },
                        {
                            "nm": "伊奥巴"
                        },
                        {
                            "nm": "宗德韦奥戈"
                        },
                        {
                            "nm": "宗多马"
                        }
                    ],
                    "nm": "布基纳法索"
                }
            ]
        },
        {
            "nm": "布隆迪",
            "state": [
                {
                    "city": [
                        {
                            "nm": "布班扎"
                        },
                        {
                            "nm": "布鲁里"
                        },
                        {
                            "nm": "布琼布拉城市"
                        },
                        {
                            "nm": "布琼布拉乡村"
                        },
                        {
                            "nm": "恩戈齐"
                        },
                        {
                            "nm": "基龙多"
                        },
                        {
                            "nm": "基特加"
                        },
                        {
                            "nm": "卡鲁济"
                        },
                        {
                            "nm": "卡扬扎"
                        },
                        {
                            "nm": "坎库佐"
                        },
                        {
                            "nm": "鲁塔纳"
                        },
                        {
                            "nm": "鲁伊吉"
                        },
                        {
                            "nm": "马坎巴"
                        },
                        {
                            "nm": "穆拉姆维亚"
                        },
                        {
                            "nm": "穆瓦洛"
                        },
                        {
                            "nm": "穆因加"
                        },
                        {
                            "nm": "锡比托凯"
                        }
                    ],
                    "nm": "布隆迪"
                }
            ]
        },
        {
            "nm": "布韦岛",
            "state": []
        },
        {
            "nm": "朝鲜",
            "state": [
                {
                    "city": [
                        {
                            "nm": "海州"
                        },
                        {
                            "nm": "惠山"
                        },
                        {
                            "nm": "江界"
                        },
                        {
                            "nm": "开城"
                        },
                        {
                            "nm": "罗先"
                        },
                        {
                            "nm": "南浦"
                        },
                        {
                            "nm": "平壤"
                        },
                        {
                            "nm": "清津"
                        },
                        {
                            "nm": "沙里院"
                        },
                        {
                            "nm": "咸兴"
                        },
                        {
                            "nm": "新义州"
                        },
                        {
                            "nm": "元山"
                        }
                    ],
                    "nm": "朝鲜"
                }
            ]
        },
        {
            "nm": "丹麦",
            "state": [
                {
                    "city": [
                        {
                            "nm": "奥胡斯"
                        },
                        {
                            "nm": "北日德兰"
                        },
                        {
                            "nm": "博恩霍尔姆"
                        },
                        {
                            "nm": "菲特烈堡"
                        },
                        {
                            "nm": "菲茵"
                        },
                        {
                            "nm": "哥本哈根"
                        },
                        {
                            "nm": "里伯"
                        },
                        {
                            "nm": "灵克宾"
                        },
                        {
                            "nm": "罗斯基勒"
                        },
                        {
                            "nm": "南日德兰"
                        },
                        {
                            "nm": "斯多斯特姆"
                        },
                        {
                            "nm": "维堡"
                        },
                        {
                            "nm": "维厄勒"
                        },
                        {
                            "nm": "西希兰"
                        }
                    ],
                    "nm": "丹麦"
                }
            ]
        },
        {
            "nm": "德国",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿恩斯贝格"
                        },
                        {
                            "nm": "爱尔福特"
                        },
                        {
                            "nm": "安斯巴格"
                        },
                        {
                            "nm": "奥格斯堡"
                        },
                        {
                            "nm": "柏林"
                        },
                        {
                            "nm": "拜伊罗特"
                        },
                        {
                            "nm": "比勒费尔德"
                        },
                        {
                            "nm": "波茨坦"
                        },
                        {
                            "nm": "波鸿"
                        },
                        {
                            "nm": "不来梅"
                        },
                        {
                            "nm": "不伦瑞克"
                        },
                        {
                            "nm": "达姆施塔特"
                        },
                        {
                            "nm": "代特莫尔特"
                        },
                        {
                            "nm": "德累斯顿"
                        },
                        {
                            "nm": "德绍"
                        },
                        {
                            "nm": "杜塞尔多夫"
                        },
                        {
                            "nm": "法兰克福"
                        },
                        {
                            "nm": "弗赖堡"
                        },
                        {
                            "nm": "哈雷"
                        },
                        {
                            "nm": "汉堡"
                        },
                        {
                            "nm": "汉诺威"
                        },
                        {
                            "nm": "基尔"
                        },
                        {
                            "nm": "吉森"
                        },
                        {
                            "nm": "卡尔斯鲁厄"
                        },
                        {
                            "nm": "卡塞尔"
                        },
                        {
                            "nm": "开姆尼斯"
                        },
                        {
                            "nm": "科布伦次"
                        },
                        {
                            "nm": "科隆"
                        },
                        {
                            "nm": "莱比锡"
                        },
                        {
                            "nm": "兰茨胡特"
                        },
                        {
                            "nm": "吕讷堡"
                        },
                        {
                            "nm": "马格德堡"
                        },
                        {
                            "nm": "曼海姆"
                        },
                        {
                            "nm": "美因兹"
                        },
                        {
                            "nm": "明斯特"
                        },
                        {
                            "nm": "慕尼黑"
                        },
                        {
                            "nm": "纽伦堡"
                        },
                        {
                            "nm": "什未林"
                        },
                        {
                            "nm": "斯图加特"
                        },
                        {
                            "nm": "特里尔"
                        },
                        {
                            "nm": "威斯巴登"
                        },
                        {
                            "nm": "维尔茨堡"
                        }
                    ],
                    "nm": "德国"
                }
            ]
        },
        {
            "nm": "东帝汶",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿伊莱乌"
                        },
                        {
                            "nm": "阿伊纳罗"
                        },
                        {
                            "nm": "埃尔梅拉"
                        },
                        {
                            "nm": "安贝诺"
                        },
                        {
                            "nm": "包考"
                        },
                        {
                            "nm": "博博纳罗"
                        },
                        {
                            "nm": "帝力"
                        },
                        {
                            "nm": "科瓦利马"
                        },
                        {
                            "nm": "劳滕"
                        },
                        {
                            "nm": "利基卡"
                        },
                        {
                            "nm": "马纳图托"
                        },
                        {
                            "nm": "马努法伊"
                        },
                        {
                            "nm": "维克克"
                        }
                    ],
                    "nm": "东帝汶"
                }
            ]
        },
        {
            "nm": "多哥",
            "state": [
                {
                    "city": [
                        {
                            "nm": "滨海区"
                        },
                        {
                            "nm": "草原区"
                        },
                        {
                            "nm": "高原区"
                        },
                        {
                            "nm": "卡拉区"
                        },
                        {
                            "nm": "中部区"
                        }
                    ],
                    "nm": "多哥"
                }
            ]
        },
        {
            "nm": "多米尼加",
            "state": []
        },
        {
            "nm": "多米尼加共和国",
            "state": []
        },
        {
            "nm": "俄罗斯",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿巴坎"
                        },
                        {
                            "nm": "阿尔汉格尔斯克"
                        },
                        {
                            "nm": "阿金斯科耶"
                        },
                        {
                            "nm": "阿纳德尔"
                        },
                        {
                            "nm": "阿斯特拉罕"
                        },
                        {
                            "nm": "埃利斯塔"
                        },
                        {
                            "nm": "奥廖尔"
                        },
                        {
                            "nm": "奥伦堡"
                        },
                        {
                            "nm": "巴尔瑙尔"
                        },
                        {
                            "nm": "奔萨"
                        },
                        {
                            "nm": "彼得罗巴甫洛夫斯克"
                        },
                        {
                            "nm": "彼得罗扎沃茨克"
                        },
                        {
                            "nm": "彼尔姆"
                        },
                        {
                            "nm": "比罗比詹"
                        },
                        {
                            "nm": "别尔哥罗德"
                        },
                        {
                            "nm": "伯力"
                        },
                        {
                            "nm": "布拉戈维申斯克"
                        },
                        {
                            "nm": "布良斯克"
                        },
                        {
                            "nm": "车里雅宾斯克"
                        },
                        {
                            "nm": "赤塔"
                        },
                        {
                            "nm": "顿河畔罗斯托夫"
                        },
                        {
                            "nm": "鄂木斯克"
                        },
                        {
                            "nm": "伏尔加格勒"
                        },
                        {
                            "nm": "弗拉基米尔"
                        },
                        {
                            "nm": "弗拉季高加索"
                        },
                        {
                            "nm": "戈尔诺－阿尔泰斯克"
                        },
                        {
                            "nm": "格罗兹尼"
                        },
                        {
                            "nm": "海参崴"
                        },
                        {
                            "nm": "汉特－曼西斯克"
                        },
                        {
                            "nm": "基洛夫"
                        },
                        {
                            "nm": "加里宁格勒"
                        },
                        {
                            "nm": "喀山"
                        },
                        {
                            "nm": "卡卢加"
                        },
                        {
                            "nm": "科斯特罗马"
                        },
                        {
                            "nm": "克拉斯诺达尔"
                        },
                        {
                            "nm": "克拉斯诺亚尔斯克"
                        },
                        {
                            "nm": "克麦罗沃"
                        },
                        {
                            "nm": "克孜勒"
                        },
                        {
                            "nm": "库德姆卡尔"
                        },
                        {
                            "nm": "库尔干"
                        },
                        {
                            "nm": "库尔斯克"
                        },
                        {
                            "nm": "利佩茨克"
                        },
                        {
                            "nm": "梁赞"
                        },
                        {
                            "nm": "马哈奇卡拉"
                        },
                        {
                            "nm": "马加丹"
                        },
                        {
                            "nm": "马加斯"
                        },
                        {
                            "nm": "迈科普"
                        },
                        {
                            "nm": "摩尔曼斯克"
                        },
                        {
                            "nm": "莫斯科"
                        },
                        {
                            "nm": "纳尔奇克"
                        },
                        {
                            "nm": "纳里扬马尔"
                        },
                        {
                            "nm": "南萨哈林斯克"
                        },
                        {
                            "nm": "诺夫哥罗德"
                        },
                        {
                            "nm": "帕拉纳"
                        },
                        {
                            "nm": "普斯科夫"
                        },
                        {
                            "nm": "切博克萨雷"
                        },
                        {
                            "nm": "切尔克斯克"
                        },
                        {
                            "nm": "秋明"
                        },
                        {
                            "nm": "萨拉托夫"
                        },
                        {
                            "nm": "萨兰斯克"
                        },
                        {
                            "nm": "萨列哈尔德"
                        },
                        {
                            "nm": "萨马拉"
                        },
                        {
                            "nm": "瑟克特夫卡尔"
                        },
                        {
                            "nm": "圣彼得堡"
                        },
                        {
                            "nm": "斯摩棱斯克"
                        },
                        {
                            "nm": "斯塔夫罗波尔"
                        },
                        {
                            "nm": "坦波夫"
                        },
                        {
                            "nm": "特维尔"
                        },
                        {
                            "nm": "图拉"
                        },
                        {
                            "nm": "托木斯克"
                        },
                        {
                            "nm": "沃罗涅什"
                        },
                        {
                            "nm": "沃洛格达"
                        },
                        {
                            "nm": "乌法"
                        },
                        {
                            "nm": "乌兰乌德"
                        },
                        {
                            "nm": "乌里扬诺夫斯克"
                        },
                        {
                            "nm": "乌斯季奥尔登斯基"
                        },
                        {
                            "nm": "下诺夫哥罗德"
                        },
                        {
                            "nm": "新西伯利亚"
                        },
                        {
                            "nm": "雅库茨克"
                        },
                        {
                            "nm": "雅罗斯拉夫尔"
                        },
                        {
                            "nm": "叶卡捷林堡"
                        },
                        {
                            "nm": "伊尔库茨克"
                        },
                        {
                            "nm": "伊热夫斯克"
                        },
                        {
                            "nm": "伊万诺沃"
                        },
                        {
                            "nm": "约什卡尔奥拉"
                        }
                    ],
                    "nm": "俄罗斯"
                }
            ]
        },
        {
            "nm": "厄瓜多尔",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿苏艾"
                        },
                        {
                            "nm": "埃尔奥罗"
                        },
                        {
                            "nm": "埃斯梅拉尔达斯"
                        },
                        {
                            "nm": "玻利瓦尔"
                        },
                        {
                            "nm": "瓜亚斯"
                        },
                        {
                            "nm": "加拉帕戈斯"
                        },
                        {
                            "nm": "卡尔奇"
                        },
                        {
                            "nm": "卡尼亚尔"
                        },
                        {
                            "nm": "科托帕希"
                        },
                        {
                            "nm": "洛哈"
                        },
                        {
                            "nm": "洛斯里奥斯"
                        },
                        {
                            "nm": "马纳比"
                        },
                        {
                            "nm": "莫罗纳－圣地亚哥"
                        },
                        {
                            "nm": "纳波，奥雷利亚纳"
                        },
                        {
                            "nm": "帕斯塔萨"
                        },
                        {
                            "nm": "皮钦查"
                        },
                        {
                            "nm": "钦博拉索"
                        },
                        {
                            "nm": "萨莫拉－钦奇佩"
                        },
                        {
                            "nm": "苏昆毕奥斯"
                        },
                        {
                            "nm": "通古拉瓦"
                        },
                        {
                            "nm": "因巴布拉"
                        }
                    ],
                    "nm": "厄瓜多尔"
                }
            ]
        },
        {
            "nm": "厄立特里亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "安塞巴"
                        },
                        {
                            "nm": "北红海"
                        },
                        {
                            "nm": "加什·巴尔卡"
                        },
                        {
                            "nm": "南部"
                        },
                        {
                            "nm": "南红海"
                        },
                        {
                            "nm": "中部"
                        }
                    ],
                    "nm": "厄立特里亚"
                }
            ]
        },
        {
            "nm": "法国",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿尔勒"
                        },
                        {
                            "nm": "阿雅克修"
                        },
                        {
                            "nm": "艾克斯"
                        },
                        {
                            "nm": "奥尔良"
                        },
                        {
                            "nm": "巴黎"
                        },
                        {
                            "nm": "贝桑松"
                        },
                        {
                            "nm": "第戎"
                        },
                        {
                            "nm": "弗雷瑞斯"
                        },
                        {
                            "nm": "卡昂"
                        },
                        {
                            "nm": "雷恩"
                        },
                        {
                            "nm": "里昂"
                        },
                        {
                            "nm": "里尔"
                        },
                        {
                            "nm": "利摩日"
                        },
                        {
                            "nm": "鲁昂"
                        },
                        {
                            "nm": "马赛"
                        },
                        {
                            "nm": "梅斯"
                        },
                        {
                            "nm": "蒙彼利埃"
                        },
                        {
                            "nm": "南特"
                        },
                        {
                            "nm": "尼斯"
                        },
                        {
                            "nm": "沙隆"
                        },
                        {
                            "nm": "图卢兹"
                        },
                        {
                            "nm": "瓦朗斯"
                        },
                        {
                            "nm": "亚眠"
                        }
                    ],
                    "nm": "法国"
                }
            ]
        },
        {
            "nm": "法罗群岛",
            "state": []
        },
        {
            "nm": "法属波利尼西亚",
            "state": []
        },
        {
            "nm": "法属圭亚那",
            "state": []
        },
        {
            "nm": "法属南部领地",
            "state": []
        },
        {
            "nm": "梵蒂冈",
            "state": []
        },
        {
            "nm": "菲律宾",
            "state": [
                {
                    "city": [
                        {
                            "nm": "达沃"
                        },
                        {
                            "nm": "卡卢坎"
                        },
                        {
                            "nm": "马尼拉"
                        },
                        {
                            "nm": "宿务"
                        }
                    ],
                    "nm": "菲律宾"
                }
            ]
        },
        {
            "nm": "斐济",
            "state": []
        },
        {
            "nm": "芬兰",
            "state": [
                {
                    "city": [
                        {
                            "nm": "埃斯波"
                        },
                        {
                            "nm": "奥卢"
                        },
                        {
                            "nm": "波里"
                        },
                        {
                            "nm": "博尔沃"
                        },
                        {
                            "nm": "海门林纳"
                        },
                        {
                            "nm": "赫尔辛基"
                        },
                        {
                            "nm": "卡亚尼"
                        },
                        {
                            "nm": "科科拉"
                        },
                        {
                            "nm": "科特卡"
                        },
                        {
                            "nm": "库奥皮奥"
                        },
                        {
                            "nm": "拉赫蒂"
                        },
                        {
                            "nm": "拉彭兰塔"
                        },
                        {
                            "nm": "罗瓦涅米"
                        },
                        {
                            "nm": "玛丽港"
                        },
                        {
                            "nm": "米凯利"
                        },
                        {
                            "nm": "坦佩雷"
                        },
                        {
                            "nm": "图尔库"
                        },
                        {
                            "nm": "瓦萨"
                        },
                        {
                            "nm": "万塔"
                        },
                        {
                            "nm": "约恩苏"
                        }
                    ],
                    "nm": "芬兰"
                }
            ]
        },
        {
            "nm": "佛得角",
            "state": [
                {
                    "city": [
                        {
                            "nm": "保尔"
                        },
                        {
                            "nm": "波多诺伏"
                        },
                        {
                            "nm": "博阿维斯塔岛"
                        },
                        {
                            "nm": "布拉瓦岛"
                        },
                        {
                            "nm": "大里贝拉"
                        },
                        {
                            "nm": "福古岛"
                        },
                        {
                            "nm": "马尤岛"
                        },
                        {
                            "nm": "莫斯特罗"
                        },
                        {
                            "nm": "普拉亚"
                        },
                        {
                            "nm": "萨尔岛"
                        },
                        {
                            "nm": "圣安唐岛"
                        },
                        {
                            "nm": "圣地亚哥岛"
                        },
                        {
                            "nm": "圣多明戈"
                        },
                        {
                            "nm": "圣菲利普"
                        },
                        {
                            "nm": "圣卡塔琳娜"
                        },
                        {
                            "nm": "圣克鲁斯"
                        },
                        {
                            "nm": "圣米戈尔"
                        },
                        {
                            "nm": "圣尼古拉岛"
                        },
                        {
                            "nm": "圣维森特岛"
                        },
                        {
                            "nm": "塔拉法尔"
                        }
                    ],
                    "nm": "佛得角"
                }
            ]
        },
        {
            "nm": "弗兰克群岛",
            "state": []
        },
        {
            "nm": "冈比亚",
            "state": []
        },
        {
            "nm": "刚果",
            "state": []
        },
        {
            "nm": "刚果民主共和国",
            "state": []
        },
        {
            "nm": "哥伦比亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿劳卡"
                        },
                        {
                            "nm": "安提奥基亚"
                        },
                        {
                            "nm": "北桑坦德"
                        },
                        {
                            "nm": "波哥大首都区"
                        },
                        {
                            "nm": "博利瓦尔"
                        },
                        {
                            "nm": "博亚卡"
                        },
                        {
                            "nm": "大西洋"
                        },
                        {
                            "nm": "瓜维亚雷"
                        },
                        {
                            "nm": "瓜希拉"
                        },
                        {
                            "nm": "瓜伊尼亚"
                        },
                        {
                            "nm": "金迪奥"
                        },
                        {
                            "nm": "卡尔达斯"
                        },
                        {
                            "nm": "卡克塔"
                        },
                        {
                            "nm": "卡萨纳雷"
                        },
                        {
                            "nm": "考卡"
                        },
                        {
                            "nm": "考卡山谷"
                        },
                        {
                            "nm": "科尔多巴"
                        },
                        {
                            "nm": "昆迪纳马卡"
                        },
                        {
                            "nm": "利萨拉尔达"
                        },
                        {
                            "nm": "马格达雷那"
                        },
                        {
                            "nm": "梅塔"
                        },
                        {
                            "nm": "纳里尼奥"
                        },
                        {
                            "nm": "普图马约"
                        },
                        {
                            "nm": "乔科"
                        },
                        {
                            "nm": "塞萨尔"
                        },
                        {
                            "nm": "桑坦德"
                        },
                        {
                            "nm": "圣安德烈斯-普罗维登西亚"
                        },
                        {
                            "nm": "苏克雷"
                        },
                        {
                            "nm": "托利马"
                        },
                        {
                            "nm": "维查达"
                        },
                        {
                            "nm": "沃佩斯"
                        },
                        {
                            "nm": "乌伊拉"
                        },
                        {
                            "nm": "亚马孙"
                        }
                    ],
                    "nm": "哥伦比亚"
                }
            ]
        },
        {
            "nm": "哥斯达黎加",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿拉胡埃拉"
                        },
                        {
                            "nm": "埃雷迪亚"
                        },
                        {
                            "nm": "瓜纳卡斯特"
                        },
                        {
                            "nm": "卡塔戈"
                        },
                        {
                            "nm": "利蒙"
                        },
                        {
                            "nm": "蓬塔雷纳斯"
                        },
                        {
                            "nm": "圣何塞"
                        }
                    ],
                    "nm": "哥斯达黎加"
                }
            ]
        },
        {
            "nm": "格恩西岛",
            "state": []
        },
        {
            "nm": "格林纳达",
            "state": []
        },
        {
            "nm": "格陵兰",
            "state": []
        },
        {
            "nm": "古巴",
            "state": [
                {
                    "city": [
                        {
                            "nm": "奥尔金"
                        },
                        {
                            "nm": "比那尔德里奥"
                        },
                        {
                            "nm": "比亚克拉拉"
                        },
                        {
                            "nm": "格拉玛"
                        },
                        {
                            "nm": "关塔那摩"
                        },
                        {
                            "nm": "哈瓦那"
                        },
                        {
                            "nm": "哈瓦那城"
                        },
                        {
                            "nm": "卡马圭"
                        },
                        {
                            "nm": "拉斯图纳斯"
                        },
                        {
                            "nm": "马坦萨斯"
                        },
                        {
                            "nm": "马亚里"
                        },
                        {
                            "nm": "曼萨尼罗"
                        },
                        {
                            "nm": "青年岛特区"
                        },
                        {
                            "nm": "圣地亚哥"
                        },
                        {
                            "nm": "圣斯皮里图斯"
                        },
                        {
                            "nm": "西恩富戈斯"
                        },
                        {
                            "nm": "谢戈德阿维拉"
                        }
                    ],
                    "nm": "古巴"
                }
            ]
        },
        {
            "nm": "瓜德罗普",
            "state": []
        },
        {
            "nm": "关岛",
            "state": []
        },
        {
            "nm": "圭亚那",
            "state": [
                {
                    "city": [
                        {
                            "nm": "埃塞奎博群岛-西德梅拉拉"
                        },
                        {
                            "nm": "巴里马-瓦伊尼"
                        },
                        {
                            "nm": "波默伦-苏佩纳姆"
                        },
                        {
                            "nm": "波塔罗-锡帕鲁尼"
                        },
                        {
                            "nm": "德梅拉拉-马海卡"
                        },
                        {
                            "nm": "东伯比斯-科兰太因"
                        },
                        {
                            "nm": "库尤尼-马扎鲁尼"
                        },
                        {
                            "nm": "马海卡-伯比斯"
                        },
                        {
                            "nm": "上德梅拉拉-伯比斯"
                        },
                        {
                            "nm": "上塔库图-上埃塞奎博"
                        }
                    ],
                    "nm": "圭亚那"
                }
            ]
        },
        {
            "nm": "哈萨克斯坦",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿尔卡累克"
                        },
                        {
                            "nm": "阿克莫拉"
                        },
                        {
                            "nm": "阿克苏"
                        },
                        {
                            "nm": "阿克托别"
                        },
                        {
                            "nm": "阿拉木图"
                        },
                        {
                            "nm": "阿雷斯"
                        },
                        {
                            "nm": "阿斯塔纳市"
                        },
                        {
                            "nm": "阿特劳"
                        },
                        {
                            "nm": "埃基巴斯图兹"
                        },
                        {
                            "nm": "巴尔喀什"
                        },
                        {
                            "nm": "巴甫洛达尔"
                        },
                        {
                            "nm": "北哈萨克斯坦"
                        },
                        {
                            "nm": "东哈萨克斯坦"
                        },
                        {
                            "nm": "济良诺夫斯克"
                        },
                        {
                            "nm": "江布尔"
                        },
                        {
                            "nm": "杰兹卡兹甘"
                        },
                        {
                            "nm": "卡拉干达"
                        },
                        {
                            "nm": "卡拉扎尔"
                        },
                        {
                            "nm": "卡普恰盖"
                        },
                        {
                            "nm": "科斯塔奈"
                        },
                        {
                            "nm": "克孜勒奥尔达"
                        },
                        {
                            "nm": "肯套"
                        },
                        {
                            "nm": "库尔恰托夫"
                        },
                        {
                            "nm": "利萨科夫斯克"
                        },
                        {
                            "nm": "列宁诺戈尔斯克"
                        },
                        {
                            "nm": "鲁德内"
                        },
                        {
                            "nm": "曼格斯套"
                        },
                        {
                            "nm": "南哈萨克斯坦"
                        },
                        {
                            "nm": "萨兰"
                        },
                        {
                            "nm": "塞梅伊"
                        },
                        {
                            "nm": "沙赫京斯克"
                        },
                        {
                            "nm": "斯捷普诺戈尔斯克"
                        },
                        {
                            "nm": "铁克利"
                        },
                        {
                            "nm": "铁米尔套"
                        },
                        {
                            "nm": "突厥斯坦"
                        },
                        {
                            "nm": "西哈萨克斯坦"
                        },
                        {
                            "nm": "扎纳奥津"
                        }
                    ],
                    "nm": "哈萨克斯坦"
                }
            ]
        },
        {
            "nm": "海地",
            "state": []
        },
        {
            "nm": "韩国",
            "state": [
                {
                    "nm": "大邱",
                    "city": [
                        {
                            "nm": "达城郡"
                        },
                        {
                            "nm": "大邱"
                        },
                        {
                            "nm": "寿城区"
                        }
                    ]
                },
                {
                    "nm": "大田",
                    "city": []
                },
                {
                    "nm": "釜山",
                    "city": []
                },
                {
                    "nm": "光州",
                    "city": []
                },
                {
                    "nm": "济州特别自治道",
                    "city": []
                },
                {
                    "nm": "江原道",
                    "city": [
                        {
                            "nm": "春川市"
                        },
                        {
                            "nm": "东海市"
                        },
                        {
                            "nm": "高城郡"
                        },
                        {
                            "nm": "横城郡"
                        },
                        {
                            "nm": "洪川郡"
                        },
                        {
                            "nm": "华川郡"
                        },
                        {
                            "nm": "江陵市"
                        },
                        {
                            "nm": "旌善郡"
                        },
                        {
                            "nm": "麟蹄郡"
                        },
                        {
                            "nm": "宁越郡"
                        },
                        {
                            "nm": "平昌郡"
                        },
                        {
                            "nm": "三陟市"
                        },
                        {
                            "nm": "束草市"
                        },
                        {
                            "nm": "太白市"
                        },
                        {
                            "nm": "铁原郡"
                        },
                        {
                            "nm": "襄阳郡"
                        },
                        {
                            "nm": "杨口郡"
                        },
                        {
                            "nm": "原州市"
                        }
                    ]
                },
                {
                    "nm": "京畿道",
                    "city": [
                        {
                            "nm": "安城市"
                        },
                        {
                            "nm": "安山市"
                        },
                        {
                            "nm": "安养市"
                        },
                        {
                            "nm": "抱川市"
                        },
                        {
                            "nm": "城南市"
                        },
                        {
                            "nm": "东豆川市"
                        },
                        {
                            "nm": "富川市"
                        },
                        {
                            "nm": "高阳市"
                        },
                        {
                            "nm": "光明市"
                        },
                        {
                            "nm": "广州市"
                        },
                        {
                            "nm": "果川市"
                        },
                        {
                            "nm": "河南市"
                        },
                        {
                            "nm": "华城市"
                        },
                        {
                            "nm": "加平郡"
                        },
                        {
                            "nm": "金浦市"
                        },
                        {
                            "nm": "九里市"
                        },
                        {
                            "nm": "军浦市"
                        },
                        {
                            "nm": "骊州郡"
                        },
                        {
                            "nm": "利川市"
                        },
                        {
                            "nm": "涟川郡"
                        },
                        {
                            "nm": "龙仁市"
                        },
                        {
                            "nm": "南杨州市"
                        },
                        {
                            "nm": "平泽市"
                        },
                        {
                            "nm": "坡州市"
                        },
                        {
                            "nm": "始兴市"
                        },
                        {
                            "nm": "水原市"
                        },
                        {
                            "nm": "乌山市"
                        },
                        {
                            "nm": "扬平郡"
                        },
                        {
                            "nm": "杨州市"
                        },
                        {
                            "nm": "仪旺市"
                        },
                        {
                            "nm": "议政府市"
                        }
                    ]
                },
                {
                    "nm": "庆尚北道",
                    "city": [
                        {
                            "nm": "安东市"
                        },
                        {
                            "nm": "奉化郡"
                        },
                        {
                            "nm": "高灵郡"
                        },
                        {
                            "nm": "龟尾市"
                        },
                        {
                            "nm": "金泉市"
                        },
                        {
                            "nm": "军威郡"
                        },
                        {
                            "nm": "醴泉郡"
                        },
                        {
                            "nm": "浦项市"
                        },
                        {
                            "nm": "漆谷郡"
                        },
                        {
                            "nm": "淸道郡"
                        },
                        {
                            "nm": "靑松郡"
                        },
                        {
                            "nm": "庆山市"
                        },
                        {
                            "nm": "庆州市"
                        },
                        {
                            "nm": "荣州市"
                        },
                        {
                            "nm": "尙州市"
                        },
                        {
                            "nm": "蔚珍郡"
                        },
                        {
                            "nm": "闻庆市"
                        },
                        {
                            "nm": "星州郡"
                        },
                        {
                            "nm": "义城郡"
                        },
                        {
                            "nm": "英阳郡"
                        },
                        {
                            "nm": "盈德郡"
                        },
                        {
                            "nm": "永川市"
                        },
                        {
                            "nm": "郁陵郡"
                        }
                    ]
                },
                {
                    "nm": "庆尚南道",
                    "city": [
                        {
                            "nm": "昌宁郡"
                        },
                        {
                            "nm": "昌原市"
                        },
                        {
                            "nm": "固城郡"
                        },
                        {
                            "nm": "河东郡"
                        },
                        {
                            "nm": "金海市"
                        },
                        {
                            "nm": "晋州市"
                        },
                        {
                            "nm": "居昌郡"
                        },
                        {
                            "nm": "巨济市"
                        },
                        {
                            "nm": "梁山市"
                        },
                        {
                            "nm": "马山市"
                        },
                        {
                            "nm": "密阳市"
                        },
                        {
                            "nm": "南海郡"
                        },
                        {
                            "nm": "山淸郡"
                        },
                        {
                            "nm": "泗川市"
                        },
                        {
                            "nm": "统营市"
                        },
                        {
                            "nm": "陜川郡"
                        },
                        {
                            "nm": "咸安郡"
                        },
                        {
                            "nm": "咸阳郡"
                        },
                        {
                            "nm": "宜宁郡"
                        },
                        {
                            "nm": "鎭海市"
                        }
                    ]
                },
                {
                    "nm": "全罗北道",
                    "city": [
                        {
                            "nm": "淳昌郡"
                        },
                        {
                            "nm": "扶安郡"
                        },
                        {
                            "nm": "高敞郡"
                        },
                        {
                            "nm": "金堤市"
                        },
                        {
                            "nm": "井邑市"
                        },
                        {
                            "nm": "茂朱郡"
                        },
                        {
                            "nm": "南原市"
                        },
                        {
                            "nm": "全州市"
                        },
                        {
                            "nm": "群山市"
                        },
                        {
                            "nm": "任实郡"
                        },
                        {
                            "nm": "完州郡"
                        },
                        {
                            "nm": "益山市"
                        },
                        {
                            "nm": "长水郡"
                        },
                        {
                            "nm": "鎭安郡"
                        }
                    ]
                },
                {
                    "nm": "全罗南道",
                    "city": [
                        {
                            "nm": "宝城郡"
                        },
                        {
                            "nm": "高兴郡"
                        },
                        {
                            "nm": "谷城郡"
                        },
                        {
                            "nm": "莞岛郡"
                        },
                        {
                            "nm": "光阳市"
                        },
                        {
                            "nm": "海南郡"
                        },
                        {
                            "nm": "和顺郡"
                        },
                        {
                            "nm": "康津郡"
                        },
                        {
                            "nm": "丽水市"
                        },
                        {
                            "nm": "灵光郡"
                        },
                        {
                            "nm": "灵岩郡"
                        },
                        {
                            "nm": "罗州市"
                        },
                        {
                            "nm": "木浦市"
                        },
                        {
                            "nm": "求礼郡"
                        },
                        {
                            "nm": "顺天市"
                        },
                        {
                            "nm": "潭阳郡"
                        },
                        {
                            "nm": "务安郡"
                        },
                        {
                            "nm": "咸平郡"
                        },
                        {
                            "nm": "新安郡"
                        },
                        {
                            "nm": "长城郡"
                        },
                        {
                            "nm": "长兴郡"
                        },
                        {
                            "nm": "珍岛郡"
                        }
                    ]
                },
                {
                    "nm": "仁川",
                    "city": []
                },
                {
                    "nm": "首尔",
                    "city": []
                },
                {
                    "nm": "蔚山",
                    "city": []
                },
                {
                    "nm": "忠清北道",
                    "city": [
                        {
                            "nm": "报恩郡"
                        },
                        {
                            "nm": "曾坪郡"
                        },
                        {
                            "nm": "丹阳郡"
                        },
                        {
                            "nm": "堤川市"
                        },
                        {
                            "nm": "槐山郡"
                        },
                        {
                            "nm": "淸原郡"
                        },
                        {
                            "nm": "淸州市"
                        },
                        {
                            "nm": "沃川郡"
                        },
                        {
                            "nm": "阴城郡"
                        },
                        {
                            "nm": "永同郡"
                        },
                        {
                            "nm": "鎭川郡"
                        },
                        {
                            "nm": "忠州市"
                        }
                    ]
                },
                {
                    "nm": "忠清南道",
                    "city": [
                        {
                            "nm": "保宁市"
                        },
                        {
                            "nm": "扶余郡"
                        },
                        {
                            "nm": "公州市"
                        },
                        {
                            "nm": "洪城郡"
                        },
                        {
                            "nm": "鸡龙市"
                        },
                        {
                            "nm": "锦山郡"
                        },
                        {
                            "nm": "礼山郡"
                        },
                        {
                            "nm": "论山市"
                        },
                        {
                            "nm": "青阳郡"
                        },
                        {
                            "nm": "瑞山市"
                        },
                        {
                            "nm": "舒川郡"
                        },
                        {
                            "nm": "泰安郡"
                        },
                        {
                            "nm": "唐津郡"
                        },
                        {
                            "nm": "天安市"
                        },
                        {
                            "nm": "牙山市"
                        },
                        {
                            "nm": "燕岐郡"
                        }
                    ]
                }
            ]
        },
        {
            "nm": "荷兰",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿尔梅勒"
                        },
                        {
                            "nm": "阿默斯福特"
                        },
                        {
                            "nm": "阿姆斯特丹"
                        },
                        {
                            "nm": "阿纳姆"
                        },
                        {
                            "nm": "阿珀尔多伦"
                        },
                        {
                            "nm": "阿森"
                        },
                        {
                            "nm": "埃德"
                        },
                        {
                            "nm": "埃门"
                        },
                        {
                            "nm": "埃因霍芬"
                        },
                        {
                            "nm": "布雷达"
                        },
                        {
                            "nm": "蒂尔堡"
                        },
                        {
                            "nm": "多德雷赫特"
                        },
                        {
                            "nm": "恩斯赫德"
                        },
                        {
                            "nm": "格罗宁根"
                        },
                        {
                            "nm": "哈勒姆"
                        },
                        {
                            "nm": "海牙"
                        },
                        {
                            "nm": "霍夫多尔普"
                        },
                        {
                            "nm": "莱顿"
                        },
                        {
                            "nm": "莱利斯塔德"
                        },
                        {
                            "nm": "鹿特丹"
                        },
                        {
                            "nm": "吕伐登"
                        },
                        {
                            "nm": "马斯特里赫特"
                        },
                        {
                            "nm": "米德尔堡"
                        },
                        {
                            "nm": "奈梅亨"
                        },
                        {
                            "nm": "斯海尔托亨博思"
                        },
                        {
                            "nm": "乌得勒支"
                        },
                        {
                            "nm": "兹沃勒"
                        },
                        {
                            "nm": "佐特尔梅"
                        }
                    ],
                    "nm": "荷兰"
                }
            ]
        },
        {
            "nm": "荷属安地列斯",
            "state": []
        },
        {
            "nm": "赫德和麦克唐纳群岛",
            "state": []
        },
        {
            "nm": "洪都拉斯",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿特兰蒂达"
                        },
                        {
                            "nm": "埃尔帕拉伊索"
                        },
                        {
                            "nm": "奥科特佩克"
                        },
                        {
                            "nm": "奥兰乔"
                        },
                        {
                            "nm": "弗朗西斯科-莫拉桑"
                        },
                        {
                            "nm": "格拉西亚斯-阿迪奥斯"
                        },
                        {
                            "nm": "海湾群岛"
                        },
                        {
                            "nm": "科尔特斯"
                        },
                        {
                            "nm": "科隆"
                        },
                        {
                            "nm": "科马亚瓜"
                        },
                        {
                            "nm": "科潘"
                        },
                        {
                            "nm": "拉巴斯"
                        },
                        {
                            "nm": "伦皮拉"
                        },
                        {
                            "nm": "乔卢特卡"
                        },
                        {
                            "nm": "乔罗马"
                        },
                        {
                            "nm": "山谷"
                        },
                        {
                            "nm": "圣巴巴拉"
                        },
                        {
                            "nm": "因蒂布卡"
                        },
                        {
                            "nm": "约罗"
                        }
                    ],
                    "nm": "洪都拉斯"
                }
            ]
        },
        {
            "nm": "基里巴斯",
            "state": [
                {
                    "city": [
                        {
                            "nm": "菲尼克斯群岛"
                        },
                        {
                            "nm": "吉尔伯特群岛"
                        },
                        {
                            "nm": "莱恩群岛"
                        }
                    ],
                    "nm": "基里巴斯"
                }
            ]
        },
        {
            "nm": "吉布提",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿里萨比赫区"
                        },
                        {
                            "nm": "奥博克区"
                        },
                        {
                            "nm": "迪基勒区"
                        },
                        {
                            "nm": "塔朱拉区"
                        }
                    ],
                    "nm": "吉布提"
                }
            ]
        },
        {
            "nm": "吉尔吉斯斯坦",
            "state": [
                {
                    "city": [
                        {
                            "nm": "奥什"
                        },
                        {
                            "nm": "巴特肯"
                        },
                        {
                            "nm": "比什凯克市"
                        },
                        {
                            "nm": "楚河"
                        },
                        {
                            "nm": "贾拉拉巴德"
                        },
                        {
                            "nm": "卡拉巴尔塔"
                        },
                        {
                            "nm": "卡拉库尔"
                        },
                        {
                            "nm": "坎特"
                        },
                        {
                            "nm": "科克扬加克"
                        },
                        {
                            "nm": "迈利赛"
                        },
                        {
                            "nm": "纳伦"
                        },
                        {
                            "nm": "苏卢克图"
                        },
                        {
                            "nm": "塔拉斯"
                        },
                        {
                            "nm": "塔什库梅尔"
                        },
                        {
                            "nm": "乌兹根"
                        },
                        {
                            "nm": "伊塞克湖"
                        }
                    ],
                    "nm": "吉尔吉斯斯坦"
                }
            ]
        },
        {
            "nm": "几内亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "博凯"
                        },
                        {
                            "nm": "恩泽雷科雷"
                        },
                        {
                            "nm": "法拉纳"
                        },
                        {
                            "nm": "金迪亚"
                        },
                        {
                            "nm": "康康"
                        },
                        {
                            "nm": "科纳克里"
                        },
                        {
                            "nm": "拉贝"
                        },
                        {
                            "nm": "玛木"
                        }
                    ],
                    "nm": "几内亚"
                }
            ]
        },
        {
            "nm": "几内亚比绍",
            "state": []
        },
        {
            "nm": "加拿大",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿伯茨福"
                        },
                        {
                            "nm": "埃德蒙顿"
                        },
                        {
                            "nm": "奥沙瓦"
                        },
                        {
                            "nm": "巴里"
                        },
                        {
                            "nm": "布列塔尼角"
                        },
                        {
                            "nm": "多伦多"
                        },
                        {
                            "nm": "弗雷德里顿"
                        },
                        {
                            "nm": "圭尔夫"
                        },
                        {
                            "nm": "哈利法克斯"
                        },
                        {
                            "nm": "哈密尔顿"
                        },
                        {
                            "nm": "怀特霍斯"
                        },
                        {
                            "nm": "基劳纳"
                        },
                        {
                            "nm": "基奇纳"
                        },
                        {
                            "nm": "金斯敦"
                        },
                        {
                            "nm": "卡里加里"
                        },
                        {
                            "nm": "魁北克"
                        },
                        {
                            "nm": "里贾纳"
                        },
                        {
                            "nm": "伦敦"
                        },
                        {
                            "nm": "蒙特利尔"
                        },
                        {
                            "nm": "萨德伯里"
                        },
                        {
                            "nm": "萨斯卡通"
                        },
                        {
                            "nm": "三河城"
                        },
                        {
                            "nm": "桑德贝"
                        },
                        {
                            "nm": "舍布鲁克"
                        },
                        {
                            "nm": "圣卡塔琳娜"
                        },
                        {
                            "nm": "圣约翰斯"
                        },
                        {
                            "nm": "维多利亚"
                        },
                        {
                            "nm": "温哥华"
                        },
                        {
                            "nm": "温尼伯"
                        },
                        {
                            "nm": "温莎"
                        },
                        {
                            "nm": "渥太华"
                        },
                        {
                            "nm": "夏洛特敦"
                        },
                        {
                            "nm": "耶洛奈夫"
                        },
                        {
                            "nm": "伊魁特"
                        }
                    ],
                    "nm": "加拿大"
                }
            ]
        },
        {
            "nm": "加纳",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿散蒂"
                        },
                        {
                            "nm": "奥布阿西"
                        },
                        {
                            "nm": "北部"
                        },
                        {
                            "nm": "布朗阿哈福"
                        },
                        {
                            "nm": "大阿克拉"
                        },
                        {
                            "nm": "东部"
                        },
                        {
                            "nm": "上东部"
                        },
                        {
                            "nm": "上西部"
                        },
                        {
                            "nm": "沃尔特"
                        },
                        {
                            "nm": "西部"
                        },
                        {
                            "nm": "中部"
                        }
                    ],
                    "nm": "加纳"
                }
            ]
        },
        {
            "nm": "加蓬",
            "state": [
                {
                    "city": [
                        {
                            "nm": "奥果韦-洛洛"
                        },
                        {
                            "nm": "奥果韦-伊温多"
                        },
                        {
                            "nm": "滨海奥果韦"
                        },
                        {
                            "nm": "恩古涅"
                        },
                        {
                            "nm": "河口"
                        },
                        {
                            "nm": "尼扬加"
                        },
                        {
                            "nm": "上奥果韦"
                        },
                        {
                            "nm": "沃勒-恩特姆"
                        },
                        {
                            "nm": "中奥果韦"
                        }
                    ],
                    "nm": "加蓬"
                }
            ]
        },
        {
            "nm": "柬埔寨",
            "state": [
                {
                    "city": [
                        {
                            "nm": "奥多棉吉"
                        },
                        {
                            "nm": "白马市"
                        },
                        {
                            "nm": "柏威夏"
                        },
                        {
                            "nm": "拜林市"
                        },
                        {
                            "nm": "班迭棉吉"
                        },
                        {
                            "nm": "磅清扬"
                        },
                        {
                            "nm": "磅士卑"
                        },
                        {
                            "nm": "磅同"
                        },
                        {
                            "nm": "磅湛"
                        },
                        {
                            "nm": "波罗勉"
                        },
                        {
                            "nm": "茶胶"
                        },
                        {
                            "nm": "柴桢"
                        },
                        {
                            "nm": "干丹"
                        },
                        {
                            "nm": "戈公"
                        },
                        {
                            "nm": "贡布"
                        },
                        {
                            "nm": "金边市"
                        },
                        {
                            "nm": "桔井"
                        },
                        {
                            "nm": "腊塔纳基里"
                        },
                        {
                            "nm": "马德望"
                        },
                        {
                            "nm": "蒙多基里"
                        },
                        {
                            "nm": "菩萨"
                        },
                        {
                            "nm": "上丁"
                        },
                        {
                            "nm": "西哈努克市"
                        },
                        {
                            "nm": "暹粒"
                        }
                    ],
                    "nm": "柬埔寨"
                }
            ]
        },
        {
            "nm": "捷克共和国",
            "state": [
                {
                    "city": [
                        {
                            "nm": "奥洛穆茨"
                        },
                        {
                            "nm": "比尔森"
                        },
                        {
                            "nm": "布拉格直辖市"
                        },
                        {
                            "nm": "赫拉德茨-克拉洛韦"
                        },
                        {
                            "nm": "卡罗维发利"
                        },
                        {
                            "nm": "利贝雷克"
                        },
                        {
                            "nm": "摩拉维亚-西里西亚"
                        },
                        {
                            "nm": "南摩拉维亚"
                        },
                        {
                            "nm": "帕尔杜比采"
                        },
                        {
                            "nm": "维索基纳"
                        },
                        {
                            "nm": "乌斯季"
                        },
                        {
                            "nm": "中捷克"
                        },
                        {
                            "nm": "兹林"
                        }
                    ],
                    "nm": "捷克共和国"
                }
            ]
        },
        {
            "nm": "津巴布韦",
            "state": [
                {
                    "city": [
                        {
                            "nm": "北马塔贝莱兰"
                        },
                        {
                            "nm": "布拉瓦约"
                        },
                        {
                            "nm": "东马绍纳兰"
                        },
                        {
                            "nm": "哈拉雷"
                        },
                        {
                            "nm": "马尼卡兰"
                        },
                        {
                            "nm": "马斯温戈"
                        },
                        {
                            "nm": "南马塔贝莱兰"
                        },
                        {
                            "nm": "西马绍纳兰"
                        },
                        {
                            "nm": "中部"
                        },
                        {
                            "nm": "中马绍纳兰"
                        }
                    ],
                    "nm": "津巴布韦"
                }
            ]
        },
        {
            "nm": "喀麦隆",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿达马瓦"
                        },
                        {
                            "nm": "北部"
                        },
                        {
                            "nm": "北端"
                        },
                        {
                            "nm": "滨海"
                        },
                        {
                            "nm": "东部"
                        },
                        {
                            "nm": "南部"
                        },
                        {
                            "nm": "西北"
                        },
                        {
                            "nm": "西部"
                        },
                        {
                            "nm": "西南"
                        },
                        {
                            "nm": "中央"
                        }
                    ],
                    "nm": "喀麦隆"
                }
            ]
        },
        {
            "nm": "卡塔尔",
            "state": [
                {
                    "city": [
                        {
                            "nm": "北部"
                        },
                        {
                            "nm": "多哈"
                        },
                        {
                            "nm": "古韦里耶"
                        },
                        {
                            "nm": "豪尔"
                        },
                        {
                            "nm": "杰里扬拜特奈"
                        },
                        {
                            "nm": "赖扬"
                        },
                        {
                            "nm": "沃克拉"
                        },
                        {
                            "nm": "乌姆锡拉勒"
                        },
                        {
                            "nm": "朱迈利耶"
                        }
                    ],
                    "nm": "卡塔尔"
                }
            ]
        },
        {
            "nm": "开曼群岛",
            "state": []
        },
        {
            "nm": "科科斯群岛",
            "state": []
        },
        {
            "nm": "科摩罗",
            "state": []
        },
        {
            "nm": "科特迪瓦",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿涅比"
                        },
                        {
                            "nm": "巴芬"
                        },
                        {
                            "nm": "邦达马河谷"
                        },
                        {
                            "nm": "登盖莱"
                        },
                        {
                            "nm": "恩济－科莫埃"
                        },
                        {
                            "nm": "弗罗马格尔"
                        },
                        {
                            "nm": "湖泊"
                        },
                        {
                            "nm": "马拉韦"
                        },
                        {
                            "nm": "南邦达马"
                        },
                        {
                            "nm": "南科莫埃"
                        },
                        {
                            "nm": "萨桑德拉"
                        },
                        {
                            "nm": "萨瓦纳"
                        },
                        {
                            "nm": "山地"
                        },
                        {
                            "nm": "沃罗杜古"
                        },
                        {
                            "nm": "下萨桑德拉"
                        },
                        {
                            "nm": "泻湖"
                        },
                        {
                            "nm": "赞赞"
                        },
                        {
                            "nm": "中卡瓦利"
                        },
                        {
                            "nm": "中科莫埃"
                        }
                    ],
                    "nm": "科特迪瓦"
                }
            ]
        },
        {
            "nm": "科威特",
            "state": []
        },
        {
            "nm": "克罗地亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "奥西耶克-巴拉尼亚"
                        },
                        {
                            "nm": "别洛瓦尔-比洛戈拉"
                        },
                        {
                            "nm": "滨海和山区"
                        },
                        {
                            "nm": "波热加-斯拉沃尼亚"
                        },
                        {
                            "nm": "布罗德-波萨维纳"
                        },
                        {
                            "nm": "杜布罗夫斯克-内雷特瓦"
                        },
                        {
                            "nm": "卡尔洛瓦茨"
                        },
                        {
                            "nm": "科普里夫尼察-克里热夫齐"
                        },
                        {
                            "nm": "克拉皮纳-扎戈列"
                        },
                        {
                            "nm": "利卡-塞尼"
                        },
                        {
                            "nm": "梅吉穆列"
                        },
                        {
                            "nm": "萨格勒布"
                        },
                        {
                            "nm": "萨格勒布市"
                        },
                        {
                            "nm": "斯普利特-达尔马提亚"
                        },
                        {
                            "nm": "瓦拉日丁"
                        },
                        {
                            "nm": "维罗维蒂察-波德拉维纳"
                        },
                        {
                            "nm": "武科瓦尔-斯里耶姆"
                        },
                        {
                            "nm": "希贝尼克-克宁"
                        },
                        {
                            "nm": "锡萨克-莫斯拉维纳"
                        },
                        {
                            "nm": "伊斯特拉"
                        },
                        {
                            "nm": "扎达尔"
                        }
                    ],
                    "nm": "克罗地亚"
                }
            ]
        },
        {
            "nm": "肯尼亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "埃尔格约-马拉奎特"
                        },
                        {
                            "nm": "巴林戈"
                        },
                        {
                            "nm": "邦戈马"
                        },
                        {
                            "nm": "博美特"
                        },
                        {
                            "nm": "布希亚"
                        },
                        {
                            "nm": "恩布"
                        },
                        {
                            "nm": "霍马湾"
                        },
                        {
                            "nm": "基安布"
                        },
                        {
                            "nm": "基里菲"
                        },
                        {
                            "nm": "基里尼亚加"
                        },
                        {
                            "nm": "基苏木"
                        },
                        {
                            "nm": "基图伊"
                        },
                        {
                            "nm": "基西"
                        },
                        {
                            "nm": "加里萨"
                        },
                        {
                            "nm": "卡卡梅加"
                        },
                        {
                            "nm": "卡耶亚多"
                        },
                        {
                            "nm": "凯里乔"
                        },
                        {
                            "nm": "夸勒"
                        },
                        {
                            "nm": "拉木"
                        },
                        {
                            "nm": "莱基皮亚"
                        },
                        {
                            "nm": "马查科斯"
                        },
                        {
                            "nm": "马瓜尼"
                        },
                        {
                            "nm": "马萨布布"
                        },
                        {
                            "nm": "曼德拉"
                        },
                        {
                            "nm": "梅鲁"
                        },
                        {
                            "nm": "蒙巴萨"
                        },
                        {
                            "nm": "米戈利"
                        },
                        {
                            "nm": "穆兰卡"
                        },
                        {
                            "nm": "纳库鲁"
                        },
                        {
                            "nm": "纳罗克"
                        },
                        {
                            "nm": "南迪"
                        },
                        {
                            "nm": "内罗毕"
                        },
                        {
                            "nm": "尼蒂"
                        },
                        {
                            "nm": "尼亚米拉"
                        },
                        {
                            "nm": "年达鲁阿"
                        },
                        {
                            "nm": "涅里"
                        },
                        {
                            "nm": "桑布卢"
                        },
                        {
                            "nm": "塔纳河"
                        },
                        {
                            "nm": "泰塔塔维塔"
                        },
                        {
                            "nm": "特兰斯-恩佐亚"
                        },
                        {
                            "nm": "图尔卡纳"
                        },
                        {
                            "nm": "瓦吉尔"
                        },
                        {
                            "nm": "瓦辛基苏"
                        },
                        {
                            "nm": "韦希加"
                        },
                        {
                            "nm": "西波克特"
                        },
                        {
                            "nm": "夏亚"
                        },
                        {
                            "nm": "伊希约洛"
                        },
                        {
                            "nm": "中央"
                        }
                    ],
                    "nm": "肯尼亚"
                }
            ]
        },
        {
            "nm": "库克群岛",
            "state": []
        },
        {
            "nm": "拉脱维亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿卢克斯内"
                        },
                        {
                            "nm": "爱兹克劳克雷"
                        },
                        {
                            "nm": "奥格雷"
                        },
                        {
                            "nm": "巴尔维"
                        },
                        {
                            "nm": "包斯卡"
                        },
                        {
                            "nm": "采西斯"
                        },
                        {
                            "nm": "多贝莱"
                        },
                        {
                            "nm": "古尔贝内"
                        },
                        {
                            "nm": "杰卡布皮尔斯"
                        },
                        {
                            "nm": "克拉斯拉瓦"
                        },
                        {
                            "nm": "库尔迪加"
                        },
                        {
                            "nm": "雷泽克内"
                        },
                        {
                            "nm": "里加"
                        },
                        {
                            "nm": "利耶帕亚"
                        },
                        {
                            "nm": "林巴济"
                        },
                        {
                            "nm": "卢扎"
                        },
                        {
                            "nm": "马多纳"
                        },
                        {
                            "nm": "普雷利"
                        },
                        {
                            "nm": "萨尔杜斯"
                        },
                        {
                            "nm": "塔尔西"
                        },
                        {
                            "nm": "陶格夫皮尔斯"
                        },
                        {
                            "nm": "图库马"
                        },
                        {
                            "nm": "瓦尔加"
                        },
                        {
                            "nm": "瓦尔米耶拉"
                        },
                        {
                            "nm": "文茨皮尔斯"
                        },
                        {
                            "nm": "叶尔加瓦"
                        }
                    ],
                    "nm": "拉脱维亚"
                }
            ]
        },
        {
            "nm": "莱索托",
            "state": [
                {
                    "city": [
                        {
                            "nm": "伯里亚"
                        },
                        {
                            "nm": "布塔布泰"
                        },
                        {
                            "nm": "古廷"
                        },
                        {
                            "nm": "加查斯内克"
                        },
                        {
                            "nm": "莱里贝"
                        },
                        {
                            "nm": "马费滕"
                        },
                        {
                            "nm": "马塞卢"
                        },
                        {
                            "nm": "莫哈莱斯胡克"
                        },
                        {
                            "nm": "莫霍特隆"
                        },
                        {
                            "nm": "塔巴采卡"
                        }
                    ],
                    "nm": "莱索托"
                }
            ]
        },
        {
            "nm": "老挝",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿速坡"
                        },
                        {
                            "nm": "波里坎赛"
                        },
                        {
                            "nm": "博乔"
                        },
                        {
                            "nm": "川圹"
                        },
                        {
                            "nm": "丰沙里"
                        },
                        {
                            "nm": "甘蒙"
                        },
                        {
                            "nm": "华潘"
                        },
                        {
                            "nm": "琅勃拉邦"
                        },
                        {
                            "nm": "琅南塔"
                        },
                        {
                            "nm": "赛宋本行政特区"
                        },
                        {
                            "nm": "色贡"
                        },
                        {
                            "nm": "沙拉湾"
                        },
                        {
                            "nm": "沙湾拿吉"
                        },
                        {
                            "nm": "沙耶武里"
                        },
                        {
                            "nm": "万象"
                        },
                        {
                            "nm": "乌多姆赛"
                        },
                        {
                            "nm": "占巴塞"
                        }
                    ],
                    "nm": "老挝"
                }
            ]
        },
        {
            "nm": "黎巴嫩",
            "state": [
                {
                    "city": [
                        {
                            "nm": "北部"
                        },
                        {
                            "nm": "贝卡"
                        },
                        {
                            "nm": "贝鲁特"
                        },
                        {
                            "nm": "黎巴嫩山"
                        },
                        {
                            "nm": "奈拜提耶市"
                        },
                        {
                            "nm": "南部"
                        }
                    ],
                    "nm": "黎巴嫩"
                }
            ]
        },
        {
            "nm": "利比里亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "巴波卢"
                        },
                        {
                            "nm": "邦"
                        },
                        {
                            "nm": "博波卢"
                        },
                        {
                            "nm": "博米"
                        },
                        {
                            "nm": "大巴萨"
                        },
                        {
                            "nm": "大吉德"
                        },
                        {
                            "nm": "大角山"
                        },
                        {
                            "nm": "大克鲁"
                        },
                        {
                            "nm": "菲什敦"
                        },
                        {
                            "nm": "吉河"
                        },
                        {
                            "nm": "里弗塞斯"
                        },
                        {
                            "nm": "洛法"
                        },
                        {
                            "nm": "马吉比"
                        },
                        {
                            "nm": "马里兰"
                        },
                        {
                            "nm": "蒙特塞拉多"
                        },
                        {
                            "nm": "宁巴"
                        },
                        {
                            "nm": "锡诺"
                        }
                    ],
                    "nm": "利比里亚"
                }
            ]
        },
        {
            "nm": "利比亚",
            "state": []
        },
        {
            "nm": "立陶宛",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿利图斯"
                        },
                        {
                            "nm": "考纳斯"
                        },
                        {
                            "nm": "克莱佩达"
                        },
                        {
                            "nm": "马里扬泊列"
                        },
                        {
                            "nm": "帕涅韦日斯"
                        },
                        {
                            "nm": "陶拉格"
                        },
                        {
                            "nm": "特尔希艾"
                        },
                        {
                            "nm": "维尔纽斯"
                        },
                        {
                            "nm": "乌田纳"
                        },
                        {
                            "nm": "希奥利艾"
                        },
                        {
                            "nm": "亚克曼"
                        }
                    ],
                    "nm": "立陶宛"
                }
            ]
        },
        {
            "nm": "列支敦士登",
            "state": []
        },
        {
            "nm": "留尼旺岛",
            "state": []
        },
        {
            "nm": "卢森堡",
            "state": [
                {
                    "city": [
                        {
                            "nm": "迪基希"
                        },
                        {
                            "nm": "格雷文马赫"
                        },
                        {
                            "nm": "卢森堡"
                        }
                    ],
                    "nm": "卢森堡"
                }
            ]
        },
        {
            "nm": "卢旺达",
            "state": [
                {
                    "city": [
                        {
                            "nm": "比温巴"
                        },
                        {
                            "nm": "布塔雷"
                        },
                        {
                            "nm": "恩延扎"
                        },
                        {
                            "nm": "基本古"
                        },
                        {
                            "nm": "基布耶"
                        },
                        {
                            "nm": "基加利-恩加利"
                        },
                        {
                            "nm": "基加利市"
                        },
                        {
                            "nm": "吉孔戈罗"
                        },
                        {
                            "nm": "吉塞尼"
                        },
                        {
                            "nm": "吉塔拉马"
                        },
                        {
                            "nm": "卡布加"
                        },
                        {
                            "nm": "卢瓦马加纳"
                        },
                        {
                            "nm": "鲁汉戈"
                        },
                        {
                            "nm": "鲁亨盖里"
                        },
                        {
                            "nm": "尚古古"
                        },
                        {
                            "nm": "乌姆塔拉"
                        }
                    ],
                    "nm": "卢旺达"
                }
            ]
        },
        {
            "nm": "罗马尼亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿尔巴尤利亚"
                        },
                        {
                            "nm": "阿拉德"
                        },
                        {
                            "nm": "奥拉迪亚"
                        },
                        {
                            "nm": "巴克乌"
                        },
                        {
                            "nm": "巴亚马雷"
                        },
                        {
                            "nm": "比斯特里察"
                        },
                        {
                            "nm": "博托沙尼"
                        },
                        {
                            "nm": "布加勒斯特"
                        },
                        {
                            "nm": "布拉索夫"
                        },
                        {
                            "nm": "布勒伊拉"
                        },
                        {
                            "nm": "布泽乌"
                        },
                        {
                            "nm": "德罗贝塔-塞维林堡"
                        },
                        {
                            "nm": "德瓦"
                        },
                        {
                            "nm": "蒂米什瓦拉"
                        },
                        {
                            "nm": "福克沙尼"
                        },
                        {
                            "nm": "加拉茨"
                        },
                        {
                            "nm": "久尔久"
                        },
                        {
                            "nm": "康斯坦察"
                        },
                        {
                            "nm": "克拉约瓦"
                        },
                        {
                            "nm": "克勒拉希"
                        },
                        {
                            "nm": "克卢日纳波卡"
                        },
                        {
                            "nm": "勒姆尼库沃尔恰"
                        },
                        {
                            "nm": "雷希察"
                        },
                        {
                            "nm": "梅尔库里亚丘克"
                        },
                        {
                            "nm": "皮特什蒂"
                        },
                        {
                            "nm": "皮亚特拉尼亚姆茨"
                        },
                        {
                            "nm": "普洛耶什蒂"
                        },
                        {
                            "nm": "萨图·马雷"
                        },
                        {
                            "nm": "圣格奥尔基"
                        },
                        {
                            "nm": "斯拉蒂纳"
                        },
                        {
                            "nm": "斯洛博齐亚"
                        },
                        {
                            "nm": "苏恰瓦"
                        },
                        {
                            "nm": "特尔戈维什泰"
                        },
                        {
                            "nm": "特尔古穆列什"
                        },
                        {
                            "nm": "特尔古日乌"
                        },
                        {
                            "nm": "图尔恰"
                        },
                        {
                            "nm": "瓦斯卢伊"
                        },
                        {
                            "nm": "锡比乌"
                        },
                        {
                            "nm": "雅西"
                        },
                        {
                            "nm": "亚厉山德里亚"
                        },
                        {
                            "nm": "扎勒乌"
                        }
                    ],
                    "nm": "罗马尼亚"
                }
            ]
        },
        {
            "nm": "马达加斯加",
            "state": [
                {
                    "city": [
                        {
                            "nm": "安齐拉纳纳"
                        },
                        {
                            "nm": "菲亚纳兰楚阿"
                        },
                        {
                            "nm": "马哈赞加"
                        },
                        {
                            "nm": "塔那那利佛"
                        },
                        {
                            "nm": "图阿马西拉"
                        },
                        {
                            "nm": "图利亚拉"
                        }
                    ],
                    "nm": "马达加斯加"
                }
            ]
        },
        {
            "nm": "马尔代夫",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿杜"
                        },
                        {
                            "nm": "北阿里"
                        },
                        {
                            "nm": "北蒂拉杜马蒂"
                        },
                        {
                            "nm": "北马洛斯马杜卢"
                        },
                        {
                            "nm": "北米拉杜马杜卢"
                        },
                        {
                            "nm": "北尼兰杜"
                        },
                        {
                            "nm": "北苏瓦迪瓦"
                        },
                        {
                            "nm": "法迪福卢"
                        },
                        {
                            "nm": "费利杜"
                        },
                        {
                            "nm": "福阿穆拉库"
                        },
                        {
                            "nm": "哈杜马蒂"
                        },
                        {
                            "nm": "科卢马杜卢"
                        },
                        {
                            "nm": "马累"
                        },
                        {
                            "nm": "马累岛"
                        },
                        {
                            "nm": "穆拉库"
                        },
                        {
                            "nm": "南阿里"
                        },
                        {
                            "nm": "南蒂拉杜马蒂"
                        },
                        {
                            "nm": "南马洛斯马杜卢"
                        },
                        {
                            "nm": "南米拉杜马杜卢"
                        },
                        {
                            "nm": "南尼兰杜"
                        },
                        {
                            "nm": "南苏瓦迪瓦"
                        }
                    ],
                    "nm": "马尔代夫"
                }
            ]
        },
        {
            "nm": "马耳他",
            "state": []
        },
        {
            "nm": "马拉维",
            "state": [
                {
                    "city": [
                        {
                            "nm": "北部区"
                        },
                        {
                            "nm": "南部区"
                        },
                        {
                            "nm": "中央区"
                        }
                    ],
                    "nm": "马拉维"
                }
            ]
        },
        {
            "nm": "马来西亚",
            "state": [
                {
                    "nm": "槟榔屿",
                    "city": [
                        {
                            "nm": "北海"
                        },
                        {
                            "nm": "槟城"
                        },
                        {
                            "nm": "大山脚"
                        },
                        {
                            "nm": "高渊"
                        }
                    ]
                },
                {
                    "nm": "玻璃市",
                    "city": [
                        {
                            "nm": "加央"
                        }
                    ]
                },
                {
                    "nm": "丁加奴",
                    "city": [
                        {
                            "nm": "甘马挽"
                        },
                        {
                            "nm": "瓜拉丁加奴"
                        },
                        {
                            "nm": "龙运"
                        },
                        {
                            "nm": "马江"
                        },
                        {
                            "nm": "实兆"
                        },
                        {
                            "nm": "乌鲁"
                        },
                        {
                            "nm": "勿述"
                        }
                    ]
                },
                {
                    "nm": "吉打",
                    "city": [
                        {
                            "nm": "巴东得腊"
                        },
                        {
                            "nm": "笨筒"
                        },
                        {
                            "nm": "浮罗交怡"
                        },
                        {
                            "nm": "哥打士打"
                        },
                        {
                            "nm": "古邦巴素"
                        },
                        {
                            "nm": "瓜拉姆达"
                        },
                        {
                            "nm": "华玲"
                        },
                        {
                            "nm": "居林"
                        },
                        {
                            "nm": "万拉峇鲁"
                        }
                    ]
                },
                {
                    "nm": "吉兰丹",
                    "city": [
                        {
                            "nm": "巴西富地"
                        },
                        {
                            "nm": "巴西马"
                        },
                        {
                            "nm": "丹那美拉"
                        },
                        {
                            "nm": "道北"
                        },
                        {
                            "nm": "登卓"
                        },
                        {
                            "nm": "哥打巴鲁"
                        },
                        {
                            "nm": "瓜拉吉赖"
                        },
                        {
                            "nm": "话望生"
                        },
                        {
                            "nm": "马樟"
                        },
                        {
                            "nm": "日里"
                        }
                    ]
                },
                {
                    "nm": "吉隆坡",
                    "city": [
                        {
                            "nm": "吉隆坡"
                        }
                    ]
                },
                {
                    "nm": "马六甲",
                    "city": [
                        {
                            "nm": "马六甲市"
                        },
                        {
                            "nm": "亚罗牙也"
                        },
                        {
                            "nm": "野新"
                        }
                    ]
                },
                {
                    "nm": "纳闽",
                    "city": [
                        {
                            "nm": "纳闽"
                        },
                        {
                            "nm": "维多利亚"
                        }
                    ]
                },
                {
                    "nm": "彭亨",
                    "city": [
                        {
                            "nm": "百乐"
                        },
                        {
                            "nm": "北根"
                        },
                        {
                            "nm": "淡马鲁"
                        },
                        {
                            "nm": "而连突"
                        },
                        {
                            "nm": "关丹"
                        },
                        {
                            "nm": "金马仑高原"
                        },
                        {
                            "nm": "劳勿"
                        },
                        {
                            "nm": "立卑"
                        },
                        {
                            "nm": "马兰"
                        },
                        {
                            "nm": "文冬"
                        },
                        {
                            "nm": "云冰"
                        }
                    ]
                },
                {
                    "nm": "霹雳",
                    "city": [
                        {
                            "nm": "安顺"
                        },
                        {
                            "nm": "丹绒马"
                        },
                        {
                            "nm": "和丰"
                        },
                        {
                            "nm": "紅土坎"
                        },
                        {
                            "nm": "华都牙也"
                        },
                        {
                            "nm": "江沙"
                        },
                        {
                            "nm": "太平"
                        },
                        {
                            "nm": "怡保"
                        }
                    ]
                },
                {
                    "nm": "柔佛",
                    "city": [
                        {
                            "nm": "笨珍"
                        },
                        {
                            "nm": "丰盛港"
                        },
                        {
                            "nm": "哥打丁宜"
                        },
                        {
                            "nm": "居銮"
                        },
                        {
                            "nm": "峇株巴辖"
                        },
                        {
                            "nm": "麻坡"
                        },
                        {
                            "nm": "昔加末"
                        },
                        {
                            "nm": "新山"
                        }
                    ]
                },
                {
                    "nm": "森美兰",
                    "city": [
                        {
                            "nm": "波德申"
                        },
                        {
                            "nm": "淡边"
                        },
                        {
                            "nm": "芙蓉"
                        },
                        {
                            "nm": "瓜拉庇劳"
                        },
                        {
                            "nm": "林茂"
                        },
                        {
                            "nm": "仁保"
                        },
                        {
                            "nm": "日叻务"
                        }
                    ]
                },
                {
                    "nm": "沙巴",
                    "city": [
                        {
                            "nm": "吧巴"
                        },
                        {
                            "nm": "保佛"
                        },
                        {
                            "nm": "比鲁兰"
                        },
                        {
                            "nm": "必达士"
                        },
                        {
                            "nm": "兵南邦"
                        },
                        {
                            "nm": "担布南"
                        },
                        {
                            "nm": "丹南"
                        },
                        {
                            "nm": "斗湖"
                        },
                        {
                            "nm": "斗亚兰"
                        },
                        {
                            "nm": "哥打基纳巴鲁"
                        },
                        {
                            "nm": "哥打马鲁都"
                        },
                        {
                            "nm": "根地咬"
                        },
                        {
                            "nm": "古达"
                        },
                        {
                            "nm": "古打毛律"
                        },
                        {
                            "nm": "古纳"
                        },
                        {
                            "nm": "瓜拉班尤"
                        },
                        {
                            "nm": "京那巴登岸"
                        },
                        {
                            "nm": "兰脑"
                        },
                        {
                            "nm": "拿笃"
                        },
                        {
                            "nm": "纳巴湾"
                        },
                        {
                            "nm": "山打根"
                        },
                        {
                            "nm": "西比陶"
                        },
                        {
                            "nm": "仙本那"
                        }
                    ]
                },
                {
                    "nm": "沙捞越",
                    "city": [
                        {
                            "nm": "古晋"
                        },
                        {
                            "nm": "加帛"
                        },
                        {
                            "nm": "林梦"
                        },
                        {
                            "nm": "美里"
                        },
                        {
                            "nm": "民都鲁"
                        },
                        {
                            "nm": "木胶"
                        },
                        {
                            "nm": "木中"
                        },
                        {
                            "nm": "三马拉汉"
                        },
                        {
                            "nm": "斯里阿曼"
                        },
                        {
                            "nm": "泗里街"
                        },
                        {
                            "nm": "泗务"
                        }
                    ]
                },
                {
                    "nm": "雪兰莪",
                    "city": [
                        {
                            "nm": "八打灵"
                        },
                        {
                            "nm": "鹅麦"
                        },
                        {
                            "nm": "瓜拉冷岳"
                        },
                        {
                            "nm": "瓜拉雪兰莪"
                        },
                        {
                            "nm": "沙白安南"
                        },
                        {
                            "nm": "乌鲁冷岳"
                        },
                        {
                            "nm": "乌鲁雪兰莪"
                        },
                        {
                            "nm": "雪邦"
                        }
                    ]
                }
            ]
        },
        {
            "nm": "马里",
            "state": [
                {
                    "city": [
                        {
                            "nm": "巴马科首都区"
                        },
                        {
                            "nm": "基达尔"
                        },
                        {
                            "nm": "加奥"
                        },
                        {
                            "nm": "卡伊"
                        },
                        {
                            "nm": "库利科罗"
                        },
                        {
                            "nm": "莫普提"
                        },
                        {
                            "nm": "塞古"
                        },
                        {
                            "nm": "通布图"
                        },
                        {
                            "nm": "锡卡索"
                        }
                    ],
                    "nm": "马里"
                }
            ]
        },
        {
            "nm": "马其顿",
            "state": []
        },
        {
            "nm": "马绍尔群岛",
            "state": []
        },
        {
            "nm": "马提尼克",
            "state": []
        },
        {
            "nm": "马约特岛",
            "state": []
        },
        {
            "nm": "曼岛",
            "state": []
        },
        {
            "nm": "毛里求斯",
            "state": []
        },
        {
            "nm": "毛里塔尼亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿德拉尔"
                        },
                        {
                            "nm": "阿萨巴"
                        },
                        {
                            "nm": "卜拉克纳"
                        },
                        {
                            "nm": "东胡德"
                        },
                        {
                            "nm": "戈尔戈勒"
                        },
                        {
                            "nm": "吉迪马卡"
                        },
                        {
                            "nm": "努瓦迪布湾"
                        },
                        {
                            "nm": "努瓦克肖特特区"
                        },
                        {
                            "nm": "塔甘特"
                        },
                        {
                            "nm": "特拉扎"
                        },
                        {
                            "nm": "提里斯-宰穆尔"
                        },
                        {
                            "nm": "西胡德"
                        },
                        {
                            "nm": "因希里"
                        }
                    ],
                    "nm": "毛里塔尼亚"
                }
            ]
        },
        {
            "nm": "美国",
            "state": [
                {
                    "nm": "阿肯色",
                    "city": [
                        {
                            "nm": "费耶特维尔"
                        },
                        {
                            "nm": "史密斯堡"
                        },
                        {
                            "nm": "小石城"
                        }
                    ]
                },
                {
                    "nm": "阿拉巴马",
                    "city": [
                        {
                            "nm": "伯明罕"
                        },
                        {
                            "nm": "蒙哥马利"
                        },
                        {
                            "nm": "莫比尔"
                        }
                    ]
                },
                {
                    "nm": "阿拉斯加",
                    "city": [
                        {
                            "nm": "安克雷奇"
                        },
                        {
                            "nm": "费尔班克斯"
                        },
                        {
                            "nm": "朱诺"
                        }
                    ]
                },
                {
                    "nm": "爱达荷",
                    "city": [
                        {
                            "nm": "爱达荷福尔斯"
                        },
                        {
                            "nm": "波卡特洛"
                        },
                        {
                            "nm": "博伊西"
                        },
                        {
                            "nm": "布莱克富特"
                        },
                        {
                            "nm": "科达伦"
                        },
                        {
                            "nm": "刘易斯顿"
                        },
                        {
                            "nm": "莫斯科"
                        },
                        {
                            "nm": "墨菲"
                        },
                        {
                            "nm": "楠帕"
                        },
                        {
                            "nm": "岂彻姆"
                        },
                        {
                            "nm": "森瓦利"
                        },
                        {
                            "nm": "亚美利加瀑布城"
                        }
                    ]
                },
                {
                    "nm": "爱荷华",
                    "city": [
                        {
                            "nm": "达文波特"
                        },
                        {
                            "nm": "得梅因"
                        },
                        {
                            "nm": "锡达拉皮兹"
                        }
                    ]
                },
                {
                    "nm": "北达科他",
                    "city": [
                        {
                            "nm": "俾斯麦"
                        },
                        {
                            "nm": "大福克斯"
                        },
                        {
                            "nm": "法戈"
                        },
                        {
                            "nm": "迈诺特"
                        }
                    ]
                },
                {
                    "nm": "北卡罗来纳",
                    "city": [
                        {
                            "nm": "艾许维尔"
                        },
                        {
                            "nm": "杜罕"
                        },
                        {
                            "nm": "格林斯伯勒"
                        },
                        {
                            "nm": "教堂山"
                        },
                        {
                            "nm": "罗利"
                        },
                        {
                            "nm": "洛利杜罕都会区"
                        },
                        {
                            "nm": "夏洛特"
                        }
                    ]
                },
                {
                    "nm": "宾夕法尼亚",
                    "city": [
                        {
                            "nm": "阿伦敦"
                        },
                        {
                            "nm": "费城"
                        },
                        {
                            "nm": "匹兹堡"
                        }
                    ]
                },
                {
                    "nm": "德克萨斯",
                    "city": [
                        {
                            "nm": "埃尔帕索"
                        },
                        {
                            "nm": "奥斯汀"
                        },
                        {
                            "nm": "达拉斯"
                        },
                        {
                            "nm": "哥帕斯基斯蒂"
                        },
                        {
                            "nm": "交维斯顿"
                        },
                        {
                            "nm": "拉雷多"
                        },
                        {
                            "nm": "麦亚伦"
                        },
                        {
                            "nm": "圣安东尼奥"
                        },
                        {
                            "nm": "休斯敦"
                        }
                    ]
                },
                {
                    "nm": "俄亥俄",
                    "city": [
                        {
                            "nm": "代顿"
                        },
                        {
                            "nm": "哥伦布"
                        },
                        {
                            "nm": "克利夫兰"
                        },
                        {
                            "nm": "托莱多"
                        },
                        {
                            "nm": "辛辛那提"
                        }
                    ]
                },
                {
                    "nm": "俄克拉荷马",
                    "city": [
                        {
                            "nm": "俄克拉荷马城"
                        },
                        {
                            "nm": "诺曼"
                        },
                        {
                            "nm": "塔尔萨"
                        }
                    ]
                },
                {
                    "nm": "俄勒冈",
                    "city": [
                        {
                            "nm": "本德"
                        },
                        {
                            "nm": "波特兰"
                        },
                        {
                            "nm": "达尔斯"
                        },
                        {
                            "nm": "达拉斯"
                        },
                        {
                            "nm": "蒂拉穆克"
                        },
                        {
                            "nm": "格兰茨帕斯"
                        },
                        {
                            "nm": "胡德里弗"
                        },
                        {
                            "nm": "火山口湖"
                        },
                        {
                            "nm": "科瓦利斯"
                        },
                        {
                            "nm": "库斯贝"
                        },
                        {
                            "nm": "梅德福"
                        },
                        {
                            "nm": "塞勒姆"
                        },
                        {
                            "nm": "圣海伦斯"
                        },
                        {
                            "nm": "斯普林菲尔德"
                        },
                        {
                            "nm": "尤金"
                        }
                    ]
                },
                {
                    "nm": "佛罗里达",
                    "city": [
                        {
                            "nm": "奥兰多"
                        },
                        {
                            "nm": "基韦斯特"
                        },
                        {
                            "nm": "杰克逊维尔"
                        },
                        {
                            "nm": "卡纳维尔角"
                        },
                        {
                            "nm": "罗德岱堡"
                        },
                        {
                            "nm": "迈阿密"
                        },
                        {
                            "nm": "圣彼德斯堡市"
                        },
                        {
                            "nm": "塔拉哈西"
                        },
                        {
                            "nm": "坦帕"
                        }
                    ]
                },
                {
                    "nm": "佛蒙特",
                    "city": [
                        {
                            "nm": "伯灵顿"
                        },
                        {
                            "nm": "拉特兰"
                        },
                        {
                            "nm": "南伯灵顿"
                        }
                    ]
                },
                {
                    "nm": "哥伦比亚特区",
                    "city": [
                        {
                            "nm": "华盛顿哥伦比亚特区"
                        }
                    ]
                },
                {
                    "nm": "华盛顿",
                    "city": [
                        {
                            "nm": "斯波坎"
                        },
                        {
                            "nm": "塔科马"
                        },
                        {
                            "nm": "西雅图"
                        }
                    ]
                },
                {
                    "nm": "怀俄明",
                    "city": [
                        {
                            "nm": "埃文斯顿"
                        },
                        {
                            "nm": "卡斯珀"
                        },
                        {
                            "nm": "拉勒米"
                        },
                        {
                            "nm": "罗克斯普林斯"
                        },
                        {
                            "nm": "夏延"
                        },
                        {
                            "nm": "谢里登"
                        }
                    ]
                },
                {
                    "nm": "加利福尼亚",
                    "city": [
                        {
                            "nm": "旧金山"
                        },
                        {
                            "nm": "洛杉矶"
                        },
                        {
                            "nm": "圣迭戈"
                        },
                        {
                            "nm": "圣何塞"
                        }
                    ]
                },
                {
                    "nm": "堪萨斯",
                    "city": [
                        {
                            "nm": "阿比林"
                        },
                        {
                            "nm": "奥弗兰公园"
                        },
                        {
                            "nm": "哈钦森"
                        },
                        {
                            "nm": "堪萨斯城"
                        },
                        {
                            "nm": "莱文沃思"
                        },
                        {
                            "nm": "劳伦斯"
                        },
                        {
                            "nm": "曼哈顿"
                        },
                        {
                            "nm": "托皮卡"
                        },
                        {
                            "nm": "威奇托"
                        }
                    ]
                },
                {
                    "nm": "康涅狄格",
                    "city": [
                        {
                            "nm": "布里奇波特"
                        },
                        {
                            "nm": "达里恩"
                        },
                        {
                            "nm": "格林尼治"
                        },
                        {
                            "nm": "哈特福德"
                        },
                        {
                            "nm": "米德尔顿"
                        },
                        {
                            "nm": "纽黑文"
                        },
                        {
                            "nm": "韦斯特波特"
                        },
                        {
                            "nm": "沃特伯里"
                        },
                        {
                            "nm": "新不列颠"
                        }
                    ]
                },
                {
                    "nm": "科罗拉多",
                    "city": [
                        {
                            "nm": "阿斯彭"
                        },
                        {
                            "nm": "奥罗拉"
                        },
                        {
                            "nm": "博尔德"
                        },
                        {
                            "nm": "大章克申"
                        },
                        {
                            "nm": "丹佛"
                        },
                        {
                            "nm": "柯林斯堡"
                        },
                        {
                            "nm": "科罗拉多斯普林斯"
                        },
                        {
                            "nm": "韦尔"
                        }
                    ]
                },
                {
                    "nm": "肯塔基",
                    "city": [
                        {
                            "nm": "列克星敦"
                        },
                        {
                            "nm": "路易斯维尔"
                        },
                        {
                            "nm": "欧文斯伯勒"
                        }
                    ]
                },
                {
                    "nm": "路易斯安那",
                    "city": [
                        {
                            "nm": "巴吞鲁日"
                        },
                        {
                            "nm": "什里夫波特"
                        },
                        {
                            "nm": "新奥尔良"
                        }
                    ]
                },
                {
                    "nm": "罗德岛",
                    "city": [
                        {
                            "nm": "波塔基特"
                        },
                        {
                            "nm": "克兰斯顿"
                        },
                        {
                            "nm": "纽波特"
                        },
                        {
                            "nm": "普罗维登斯"
                        },
                        {
                            "nm": "韦斯特利"
                        },
                        {
                            "nm": "文索基特"
                        },
                        {
                            "nm": "沃威克"
                        }
                    ]
                },
                {
                    "nm": "马里兰",
                    "city": [
                        {
                            "nm": "巴尔的摩"
                        },
                        {
                            "nm": "盖瑟斯堡"
                        },
                        {
                            "nm": "罗克维尔"
                        }
                    ]
                },
                {
                    "nm": "马萨诸塞",
                    "city": [
                        {
                            "nm": "波士顿"
                        },
                        {
                            "nm": "斯普林菲尔德"
                        },
                        {
                            "nm": "伍斯特"
                        }
                    ]
                },
                {
                    "nm": "蒙大拿",
                    "city": [
                        {
                            "nm": "比灵斯"
                        },
                        {
                            "nm": "大瀑布村"
                        },
                        {
                            "nm": "米苏拉"
                        }
                    ]
                },
                {
                    "nm": "密苏里",
                    "city": [
                        {
                            "nm": "哥伦比亚"
                        },
                        {
                            "nm": "杰佛逊市"
                        },
                        {
                            "nm": "堪萨斯城"
                        },
                        {
                            "nm": "圣路易斯"
                        },
                        {
                            "nm": "斯普林菲尔德"
                        }
                    ]
                },
                {
                    "nm": "密西西比",
                    "city": [
                        {
                            "nm": "比洛克西"
                        },
                        {
                            "nm": "格尔夫波特"
                        },
                        {
                            "nm": "格林维尔"
                        },
                        {
                            "nm": "哈蒂斯堡"
                        },
                        {
                            "nm": "杰克逊"
                        },
                        {
                            "nm": "默里迪恩"
                        },
                        {
                            "nm": "维克斯堡"
                        }
                    ]
                },
                {
                    "nm": "密歇根",
                    "city": [
                        {
                            "nm": "安娜堡"
                        },
                        {
                            "nm": "巴特尔克里克"
                        },
                        {
                            "nm": "贝城"
                        },
                        {
                            "nm": "大急流城"
                        },
                        {
                            "nm": "迪尔伯恩"
                        },
                        {
                            "nm": "底特律"
                        },
                        {
                            "nm": "弗林特"
                        },
                        {
                            "nm": "怀恩多特"
                        },
                        {
                            "nm": "卡拉马袓"
                        },
                        {
                            "nm": "兰辛"
                        },
                        {
                            "nm": "马斯基根"
                        },
                        {
                            "nm": "庞菷亚克"
                        },
                        {
                            "nm": "萨吉诺"
                        },
                        {
                            "nm": "苏圣玛丽"
                        },
                        {
                            "nm": "沃伦"
                        },
                        {
                            "nm": "休伦港"
                        }
                    ]
                },
                {
                    "nm": "缅因",
                    "city": [
                        {
                            "nm": "班戈"
                        },
                        {
                            "nm": "波特兰"
                        },
                        {
                            "nm": "刘易斯顿"
                        }
                    ]
                },
                {
                    "nm": "明尼苏达",
                    "city": [
                        {
                            "nm": "罗切斯特"
                        },
                        {
                            "nm": "明尼阿波利斯"
                        },
                        {
                            "nm": "圣保罗"
                        }
                    ]
                },
                {
                    "nm": "南达科他",
                    "city": [
                        {
                            "nm": "阿伯丁"
                        },
                        {
                            "nm": "拉皮德城"
                        },
                        {
                            "nm": "苏福尔斯"
                        }
                    ]
                },
                {
                    "nm": "南卡罗来纳",
                    "city": [
                        {
                            "nm": "北查尔斯顿"
                        },
                        {
                            "nm": "查尔斯顿"
                        },
                        {
                            "nm": "哥伦比亚"
                        }
                    ]
                },
                {
                    "nm": "内布拉斯加",
                    "city": [
                        {
                            "nm": "奥马哈"
                        },
                        {
                            "nm": "贝尔维尤"
                        },
                        {
                            "nm": "林肯"
                        }
                    ]
                },
                {
                    "nm": "内华达",
                    "city": [
                        {
                            "nm": "埃尔科"
                        },
                        {
                            "nm": "北拉斯维加斯"
                        },
                        {
                            "nm": "弗吉尼亚城"
                        },
                        {
                            "nm": "亨德森"
                        },
                        {
                            "nm": "卡森城"
                        },
                        {
                            "nm": "拉斯维加斯"
                        },
                        {
                            "nm": "里诺"
                        },
                        {
                            "nm": "斯帕克斯"
                        }
                    ]
                },
                {
                    "nm": "纽约",
                    "city": [
                        {
                            "nm": "布法罗"
                        },
                        {
                            "nm": "罗切斯特"
                        },
                        {
                            "nm": "纽约市"
                        }
                    ]
                },
                {
                    "nm": "特拉华",
                    "city": [
                        {
                            "nm": "多佛"
                        },
                        {
                            "nm": "纽瓦克"
                        },
                        {
                            "nm": "威明顿"
                        }
                    ]
                },
                {
                    "nm": "田纳西",
                    "city": [
                        {
                            "nm": "布利斯托"
                        },
                        {
                            "nm": "查塔努加"
                        },
                        {
                            "nm": "金斯波特"
                        },
                        {
                            "nm": "孟菲斯"
                        },
                        {
                            "nm": "纳什维尔"
                        },
                        {
                            "nm": "诺克斯维尔"
                        },
                        {
                            "nm": "三城区"
                        },
                        {
                            "nm": "士麦那"
                        },
                        {
                            "nm": "斯普林希尔"
                        },
                        {
                            "nm": "约翰逊城"
                        }
                    ]
                },
                {
                    "nm": "威斯康星",
                    "city": [
                        {
                            "nm": "阿普尓顿"
                        },
                        {
                            "nm": "奥什科什"
                        },
                        {
                            "nm": "格林贝"
                        },
                        {
                            "nm": "基诺沙"
                        },
                        {
                            "nm": "拉克罗斯"
                        },
                        {
                            "nm": "拉辛"
                        },
                        {
                            "nm": "马尼托沃克"
                        },
                        {
                            "nm": "迈迪逊"
                        },
                        {
                            "nm": "密尔沃基"
                        },
                        {
                            "nm": "欧克莱尓"
                        },
                        {
                            "nm": "沃索"
                        },
                        {
                            "nm": "希博伊根"
                        }
                    ]
                },
                {
                    "nm": "维吉尼亚",
                    "city": [
                        {
                            "nm": "弗吉尼亚比奇"
                        },
                        {
                            "nm": "诺福克"
                        },
                        {
                            "nm": "切萨皮克"
                        }
                    ]
                },
                {
                    "nm": "西佛吉尼亚",
                    "city": [
                        {
                            "nm": "查尔斯顿"
                        },
                        {
                            "nm": "亨廷顿"
                        },
                        {
                            "nm": "帕克斯堡"
                        }
                    ]
                },
                {
                    "nm": "夏威夷",
                    "city": [
                        {
                            "nm": "凯卢阿"
                        },
                        {
                            "nm": "檀香山"
                        },
                        {
                            "nm": "希洛"
                        }
                    ]
                },
                {
                    "nm": "新罕布什尔",
                    "city": [
                        {
                            "nm": "康科德"
                        },
                        {
                            "nm": "曼彻斯特"
                        },
                        {
                            "nm": "纳舒厄"
                        }
                    ]
                },
                {
                    "nm": "新墨西哥",
                    "city": [
                        {
                            "nm": "阿尔伯克基"
                        },
                        {
                            "nm": "拉斯克鲁塞斯"
                        },
                        {
                            "nm": "罗斯韦尔"
                        },
                        {
                            "nm": "圣菲"
                        }
                    ]
                },
                {
                    "nm": "新泽西",
                    "city": [
                        {
                            "nm": "纽瓦克"
                        },
                        {
                            "nm": "帕特森"
                        },
                        {
                            "nm": "泽西城"
                        }
                    ]
                },
                {
                    "nm": "亚利桑那",
                    "city": [
                        {
                            "nm": "凤凰城"
                        },
                        {
                            "nm": "格兰代尔"
                        },
                        {
                            "nm": "梅萨"
                        },
                        {
                            "nm": "史卡兹代尔"
                        },
                        {
                            "nm": "坦普"
                        },
                        {
                            "nm": "图森"
                        },
                        {
                            "nm": "优玛"
                        }
                    ]
                },
                {
                    "nm": "伊利诺斯",
                    "city": [
                        {
                            "nm": "奥尔顿"
                        },
                        {
                            "nm": "奥罗拉"
                        },
                        {
                            "nm": "布卢明顿"
                        },
                        {
                            "nm": "丹维尓"
                        },
                        {
                            "nm": "迪卡尔布"
                        },
                        {
                            "nm": "迪凯持"
                        },
                        {
                            "nm": "东圣路易斯"
                        },
                        {
                            "nm": "厄巴纳-香槟"
                        },
                        {
                            "nm": "盖尔斯堡"
                        },
                        {
                            "nm": "卡本代尔"
                        },
                        {
                            "nm": "罗克艾兰"
                        },
                        {
                            "nm": "罗克福德"
                        },
                        {
                            "nm": "诺黙尔"
                        },
                        {
                            "nm": "皮奥里亚"
                        },
                        {
                            "nm": "森特勒利亚"
                        },
                        {
                            "nm": "斯普林菲尔德"
                        },
                        {
                            "nm": "沃其根"
                        },
                        {
                            "nm": "芝加哥"
                        }
                    ]
                },
                {
                    "nm": "印第安那",
                    "city": [
                        {
                            "nm": "埃文斯维尔"
                        },
                        {
                            "nm": "韦恩堡"
                        },
                        {
                            "nm": "印第安纳波利斯"
                        }
                    ]
                },
                {
                    "nm": "犹他",
                    "city": [
                        {
                            "nm": "奥格登"
                        },
                        {
                            "nm": "雷登"
                        },
                        {
                            "nm": "欧仁"
                        },
                        {
                            "nm": "帕克城"
                        },
                        {
                            "nm": "普罗沃"
                        },
                        {
                            "nm": "圣乔治"
                        },
                        {
                            "nm": "西瓦利城"
                        },
                        {
                            "nm": "盐湖城"
                        }
                    ]
                },
                {
                    "nm": "佐治亚",
                    "city": [
                        {
                            "nm": "奥古斯塔"
                        },
                        {
                            "nm": "哥伦布"
                        },
                        {
                            "nm": "梅肯"
                        },
                        {
                            "nm": "沙瓦纳"
                        },
                        {
                            "nm": "亚特兰大"
                        }
                    ]
                }
            ]
        },
        {
            "nm": "美属萨摩亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿纳"
                        },
                        {
                            "nm": "阿图阿"
                        },
                        {
                            "nm": "艾加伊勒泰"
                        },
                        {
                            "nm": "法塞莱莱阿加"
                        },
                        {
                            "nm": "加盖福毛加"
                        },
                        {
                            "nm": "加加埃毛加"
                        },
                        {
                            "nm": "帕劳利"
                        },
                        {
                            "nm": "萨图帕伊泰阿"
                        },
                        {
                            "nm": "萨瓦伊岛"
                        },
                        {
                            "nm": "图阿马萨加"
                        },
                        {
                            "nm": "瓦奥福诺蒂"
                        },
                        {
                            "nm": "韦西加诺"
                        },
                        {
                            "nm": "乌波卢岛"
                        }
                    ],
                    "nm": "美属萨摩亚"
                }
            ]
        },
        {
            "nm": "美属外岛",
            "state": []
        },
        {
            "nm": "蒙古",
            "state": [
                {
                    "city": [
                        {
                            "nm": "巴彦洪格尔"
                        },
                        {
                            "nm": "巴彦乌勒盖"
                        },
                        {
                            "nm": "布尔干"
                        },
                        {
                            "nm": "达尔汗乌勒"
                        },
                        {
                            "nm": "东方"
                        },
                        {
                            "nm": "东戈壁"
                        },
                        {
                            "nm": "鄂尔浑"
                        },
                        {
                            "nm": "戈壁阿尔泰"
                        },
                        {
                            "nm": "戈壁苏木贝尔"
                        },
                        {
                            "nm": "后杭爱"
                        },
                        {
                            "nm": "科布多"
                        },
                        {
                            "nm": "肯特"
                        },
                        {
                            "nm": "库苏古尔"
                        },
                        {
                            "nm": "南戈壁"
                        },
                        {
                            "nm": "前杭爱"
                        },
                        {
                            "nm": "色楞格"
                        },
                        {
                            "nm": "苏赫巴托尔"
                        },
                        {
                            "nm": "乌布苏"
                        },
                        {
                            "nm": "乌兰巴托市"
                        },
                        {
                            "nm": "扎布汗"
                        },
                        {
                            "nm": "中戈壁"
                        },
                        {
                            "nm": "中央"
                        }
                    ],
                    "nm": "蒙古"
                }
            ]
        },
        {
            "nm": "蒙特塞拉特",
            "state": []
        },
        {
            "nm": "孟加拉",
            "state": [
                {
                    "city": [
                        {
                            "nm": "达卡"
                        },
                        {
                            "nm": "吉大港"
                        },
                        {
                            "nm": "库尔纳"
                        }
                    ],
                    "nm": "孟加拉"
                }
            ]
        },
        {
            "nm": "密克罗尼西亚",
            "state": []
        },
        {
            "nm": "秘鲁",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿雷基帕"
                        },
                        {
                            "nm": "阿普里马克"
                        },
                        {
                            "nm": "阿亚库乔"
                        },
                        {
                            "nm": "安卡什"
                        },
                        {
                            "nm": "胡利亚卡"
                        },
                        {
                            "nm": "胡宁"
                        },
                        {
                            "nm": "卡哈马卡"
                        },
                        {
                            "nm": "卡亚俄"
                        },
                        {
                            "nm": "库斯科"
                        },
                        {
                            "nm": "拉利伯塔德"
                        },
                        {
                            "nm": "兰巴耶克"
                        },
                        {
                            "nm": "利马"
                        },
                        {
                            "nm": "洛雷托"
                        },
                        {
                            "nm": "马德雷德迪奥斯"
                        },
                        {
                            "nm": "莫克瓜"
                        },
                        {
                            "nm": "帕斯科"
                        },
                        {
                            "nm": "皮乌拉"
                        },
                        {
                            "nm": "普诺"
                        },
                        {
                            "nm": "钦博特"
                        },
                        {
                            "nm": "钦查阿尔塔"
                        },
                        {
                            "nm": "圣马丁"
                        },
                        {
                            "nm": "苏拉纳"
                        },
                        {
                            "nm": "塔克纳"
                        },
                        {
                            "nm": "通贝斯"
                        },
                        {
                            "nm": "瓦努科"
                        },
                        {
                            "nm": "万卡维利卡"
                        },
                        {
                            "nm": "乌卡亚利"
                        },
                        {
                            "nm": "亚马孙"
                        },
                        {
                            "nm": "伊卡"
                        }
                    ],
                    "nm": "秘鲁"
                }
            ]
        },
        {
            "nm": "缅甸",
            "state": [
                {
                    "city": [
                        {
                            "nm": "勃固省"
                        },
                        {
                            "nm": "掸邦"
                        },
                        {
                            "nm": "德林达依省"
                        },
                        {
                            "nm": "克伦邦"
                        },
                        {
                            "nm": "克钦邦"
                        },
                        {
                            "nm": "克耶邦"
                        },
                        {
                            "nm": "马圭省"
                        },
                        {
                            "nm": "曼德勒省"
                        },
                        {
                            "nm": "孟邦"
                        },
                        {
                            "nm": "钦邦"
                        },
                        {
                            "nm": "若开邦"
                        },
                        {
                            "nm": "实皆省"
                        },
                        {
                            "nm": "仰光省"
                        },
                        {
                            "nm": "伊洛瓦底省"
                        }
                    ],
                    "nm": "缅甸"
                }
            ]
        },
        {
            "nm": "摩尔多瓦",
            "state": []
        },
        {
            "nm": "摩洛哥",
            "state": [
                {
                    "city": [
                        {
                            "nm": "丹吉尔"
                        },
                        {
                            "nm": "得土安"
                        },
                        {
                            "nm": "非斯"
                        },
                        {
                            "nm": "卡萨布兰卡"
                        },
                        {
                            "nm": "拉巴特"
                        },
                        {
                            "nm": "马拉喀什"
                        },
                        {
                            "nm": "梅克内斯"
                        },
                        {
                            "nm": "乌季达"
                        },
                        {
                            "nm": "西撒哈拉"
                        }
                    ],
                    "nm": "摩洛哥"
                }
            ]
        },
        {
            "nm": "摩纳哥",
            "state": []
        },
        {
            "nm": "莫桑比克",
            "state": []
        },
        {
            "nm": "墨西哥",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿瓜斯卡连斯特"
                        },
                        {
                            "nm": "阿卡普尔科"
                        },
                        {
                            "nm": "埃莫西约"
                        },
                        {
                            "nm": "埃佩切"
                        },
                        {
                            "nm": "奥夫雷贡城"
                        },
                        {
                            "nm": "奥里萨巴"
                        },
                        {
                            "nm": "巴利城"
                        },
                        {
                            "nm": "巴亚尔塔港"
                        },
                        {
                            "nm": "比利亚埃尔莫萨"
                        },
                        {
                            "nm": "波萨里卡"
                        },
                        {
                            "nm": "蒂华纳"
                        },
                        {
                            "nm": "杜兰戈"
                        },
                        {
                            "nm": "恩塞纳达"
                        },
                        {
                            "nm": "瓜达拉哈拉"
                        },
                        {
                            "nm": "瓜纳华托"
                        },
                        {
                            "nm": "哈拉帕"
                        },
                        {
                            "nm": "华雷斯"
                        },
                        {
                            "nm": "华雷斯港"
                        },
                        {
                            "nm": "卡门"
                        },
                        {
                            "nm": "科利马"
                        },
                        {
                            "nm": "克雷塔罗"
                        },
                        {
                            "nm": "库埃纳瓦卡"
                        },
                        {
                            "nm": "库利阿坎"
                        },
                        {
                            "nm": "夸察夸拉克斯"
                        },
                        {
                            "nm": "拉巴斯"
                        },
                        {
                            "nm": "莱昂"
                        },
                        {
                            "nm": "雷诺萨"
                        },
                        {
                            "nm": "洛斯莫奇斯"
                        },
                        {
                            "nm": "马萨特兰"
                        },
                        {
                            "nm": "马塔莫罗斯"
                        },
                        {
                            "nm": "梅里达"
                        },
                        {
                            "nm": "蒙克洛瓦"
                        },
                        {
                            "nm": "蒙特雷"
                        },
                        {
                            "nm": "莫雷利亚"
                        },
                        {
                            "nm": "墨西哥城"
                        },
                        {
                            "nm": "墨西卡利"
                        },
                        {
                            "nm": "诺加莱斯"
                        },
                        {
                            "nm": "帕丘卡"
                        },
                        {
                            "nm": "普埃布拉"
                        },
                        {
                            "nm": "奇尔潘辛戈"
                        },
                        {
                            "nm": "奇瓦瓦"
                        },
                        {
                            "nm": "切图马尔"
                        },
                        {
                            "nm": "萨尔蒂约"
                        },
                        {
                            "nm": "萨卡特卡斯"
                        },
                        {
                            "nm": "塞拉亚"
                        },
                        {
                            "nm": "圣路易斯波托亚"
                        },
                        {
                            "nm": "塔帕丘拉"
                        },
                        {
                            "nm": "坦皮科"
                        },
                        {
                            "nm": "特拉斯卡拉"
                        },
                        {
                            "nm": "特皮克"
                        },
                        {
                            "nm": "特瓦坎"
                        },
                        {
                            "nm": "图斯特拉-古铁雷斯"
                        },
                        {
                            "nm": "托雷翁"
                        },
                        {
                            "nm": "托卢卡"
                        },
                        {
                            "nm": "瓦哈卡"
                        },
                        {
                            "nm": "维多利亚城"
                        },
                        {
                            "nm": "韦拉克鲁斯"
                        },
                        {
                            "nm": "乌鲁阿潘"
                        },
                        {
                            "nm": "新拉雷多"
                        },
                        {
                            "nm": "伊拉普阿托"
                        }
                    ],
                    "nm": "墨西哥"
                }
            ]
        },
        {
            "nm": "纳米比亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "埃龙戈"
                        },
                        {
                            "nm": "奥汉圭纳"
                        },
                        {
                            "nm": "奥卡万戈"
                        },
                        {
                            "nm": "奥马赫科"
                        },
                        {
                            "nm": "奥姆沙蒂"
                        },
                        {
                            "nm": "奥乔宗蒂约巴"
                        },
                        {
                            "nm": "奥沙纳"
                        },
                        {
                            "nm": "奥希科托"
                        },
                        {
                            "nm": "哈达普"
                        },
                        {
                            "nm": "霍马斯"
                        },
                        {
                            "nm": "卡拉斯"
                        },
                        {
                            "nm": "卡普里维"
                        },
                        {
                            "nm": "库内内"
                        }
                    ],
                    "nm": "纳米比亚"
                }
            ]
        },
        {
            "nm": "南非",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿平顿"
                        },
                        {
                            "nm": "艾利弗山"
                        },
                        {
                            "nm": "彼德马里茨堡"
                        },
                        {
                            "nm": "彼德斯堡"
                        },
                        {
                            "nm": "比勒陀利亚"
                        },
                        {
                            "nm": "比索"
                        },
                        {
                            "nm": "布雷达斯多普"
                        },
                        {
                            "nm": "布隆方丹"
                        },
                        {
                            "nm": "布隆克斯特斯普利特"
                        },
                        {
                            "nm": "德阿尔"
                        },
                        {
                            "nm": "德班"
                        },
                        {
                            "nm": "邓迪"
                        },
                        {
                            "nm": "东巴克利"
                        },
                        {
                            "nm": "东伦敦"
                        },
                        {
                            "nm": "弗雷堡"
                        },
                        {
                            "nm": "弗里尼欣"
                        },
                        {
                            "nm": "格罗布莱斯达尔"
                        },
                        {
                            "nm": "基雅尼"
                        },
                        {
                            "nm": "金伯利"
                        },
                        {
                            "nm": "开普敦"
                        },
                        {
                            "nm": "克莱克斯多普"
                        },
                        {
                            "nm": "库鲁曼"
                        },
                        {
                            "nm": "昆士敦"
                        },
                        {
                            "nm": "莱迪史密斯"
                        },
                        {
                            "nm": "兰德方丹"
                        },
                        {
                            "nm": "理查兹湾"
                        },
                        {
                            "nm": "利斯滕堡"
                        },
                        {
                            "nm": "米德尔堡"
                        },
                        {
                            "nm": "姆库泽"
                        },
                        {
                            "nm": "穆里斯堡"
                        },
                        {
                            "nm": "内尔斯普雷特"
                        },
                        {
                            "nm": "尼尔斯特隆"
                        },
                        {
                            "nm": "纽卡斯尔"
                        },
                        {
                            "nm": "乔治"
                        },
                        {
                            "nm": "萨索尔堡"
                        },
                        {
                            "nm": "瑟孔达"
                        },
                        {
                            "nm": "特克索波"
                        },
                        {
                            "nm": "特隆普斯堡"
                        },
                        {
                            "nm": "跳羚"
                        },
                        {
                            "nm": "图拉马哈谢"
                        },
                        {
                            "nm": "托霍延杜"
                        },
                        {
                            "nm": "韦茨肖克"
                        },
                        {
                            "nm": "韦尔科姆"
                        },
                        {
                            "nm": "乌伦迪"
                        },
                        {
                            "nm": "乌姆塔塔"
                        },
                        {
                            "nm": "伍斯特"
                        },
                        {
                            "nm": "西博福特"
                        },
                        {
                            "nm": "谢普斯通港"
                        },
                        {
                            "nm": "伊丽莎白港"
                        },
                        {
                            "nm": "约翰内斯堡"
                        }
                    ],
                    "nm": "南非"
                }
            ]
        },
        {
            "nm": "南极洲",
            "state": []
        },
        {
            "nm": "南乔治亚和南桑德威奇群岛",
            "state": []
        },
        {
            "nm": "瑙鲁",
            "state": []
        },
        {
            "nm": "尼泊尔",
            "state": [
                {
                    "city": [
                        {
                            "nm": "巴格马蒂"
                        },
                        {
                            "nm": "道拉吉里"
                        },
                        {
                            "nm": "甘达基"
                        },
                        {
                            "nm": "戈西"
                        },
                        {
                            "nm": "格尔纳利"
                        },
                        {
                            "nm": "贾纳克布尔"
                        },
                        {
                            "nm": "拉布蒂"
                        },
                        {
                            "nm": "蓝毗尼"
                        },
                        {
                            "nm": "马哈卡利"
                        },
                        {
                            "nm": "梅吉"
                        },
                        {
                            "nm": "纳拉亚尼"
                        },
                        {
                            "nm": "佩里"
                        },
                        {
                            "nm": "萨加玛塔"
                        },
                        {
                            "nm": "塞蒂"
                        }
                    ],
                    "nm": "尼泊尔"
                }
            ]
        },
        {
            "nm": "尼加拉瓜",
            "state": [
                {
                    "city": [
                        {
                            "nm": "埃斯特利"
                        },
                        {
                            "nm": "北大西洋"
                        },
                        {
                            "nm": "博阿科"
                        },
                        {
                            "nm": "格拉纳达"
                        },
                        {
                            "nm": "卡拉索"
                        },
                        {
                            "nm": "莱昂"
                        },
                        {
                            "nm": "里瓦斯"
                        },
                        {
                            "nm": "马德里斯"
                        },
                        {
                            "nm": "马那瓜"
                        },
                        {
                            "nm": "马萨亚"
                        },
                        {
                            "nm": "马塔加尔帕"
                        },
                        {
                            "nm": "南大西洋"
                        },
                        {
                            "nm": "奇南德加"
                        },
                        {
                            "nm": "琼塔莱斯"
                        },
                        {
                            "nm": "圣胡安河"
                        },
                        {
                            "nm": "希诺特加"
                        },
                        {
                            "nm": "新塞哥维亚"
                        }
                    ],
                    "nm": "尼加拉瓜"
                }
            ]
        },
        {
            "nm": "尼日尔",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿加德兹"
                        },
                        {
                            "nm": "迪法"
                        },
                        {
                            "nm": "蒂拉贝里"
                        },
                        {
                            "nm": "多索"
                        },
                        {
                            "nm": "津德尔"
                        },
                        {
                            "nm": "马拉迪"
                        },
                        {
                            "nm": "尼亚美市"
                        },
                        {
                            "nm": "塔瓦"
                        }
                    ],
                    "nm": "尼日尔"
                }
            ]
        },
        {
            "nm": "尼日利亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿比亚"
                        },
                        {
                            "nm": "奥博莫绍"
                        },
                        {
                            "nm": "卡诺"
                        },
                        {
                            "nm": "拉各斯"
                        },
                        {
                            "nm": "伊巴丹"
                        }
                    ],
                    "nm": "尼日利亚"
                }
            ]
        },
        {
            "nm": "纽埃",
            "state": []
        },
        {
            "nm": "挪威",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿克什胡斯"
                        },
                        {
                            "nm": "奥普兰"
                        },
                        {
                            "nm": "奥斯陆市"
                        },
                        {
                            "nm": "北特伦德拉格"
                        },
                        {
                            "nm": "布斯克吕"
                        },
                        {
                            "nm": "东阿格德尔"
                        },
                        {
                            "nm": "东福尔"
                        },
                        {
                            "nm": "芬马克"
                        },
                        {
                            "nm": "海德马克"
                        },
                        {
                            "nm": "霍达兰"
                        },
                        {
                            "nm": "罗加兰"
                        },
                        {
                            "nm": "默勒－鲁姆斯达尔"
                        },
                        {
                            "nm": "南特伦德拉格"
                        },
                        {
                            "nm": "诺尔兰"
                        },
                        {
                            "nm": "松恩－菲尤拉讷"
                        },
                        {
                            "nm": "泰勒马克"
                        },
                        {
                            "nm": "特罗姆斯"
                        },
                        {
                            "nm": "西阿格德尔"
                        },
                        {
                            "nm": "西福尔"
                        }
                    ],
                    "nm": "挪威"
                }
            ]
        },
        {
            "nm": "诺福克",
            "state": []
        },
        {
            "nm": "帕劳群岛",
            "state": []
        },
        {
            "nm": "皮特凯恩",
            "state": []
        },
        {
            "nm": "葡萄牙",
            "state": [
                {
                    "city": [
                        {
                            "nm": "滨海阿连特茹"
                        },
                        {
                            "nm": "滨海皮尼亚尔"
                        },
                        {
                            "nm": "波尔图"
                        },
                        {
                            "nm": "杜罗"
                        },
                        {
                            "nm": "恩特拉杜罗伏日"
                        },
                        {
                            "nm": "法鲁"
                        },
                        {
                            "nm": "丰沙尔"
                        },
                        {
                            "nm": "卡瓦多"
                        },
                        {
                            "nm": "科瓦贝拉"
                        },
                        {
                            "nm": "里斯本"
                        },
                        {
                            "nm": "利巴特茹"
                        },
                        {
                            "nm": "梅地奥特茹"
                        },
                        {
                            "nm": "米尼奥-利马"
                        },
                        {
                            "nm": "内贝拉北"
                        },
                        {
                            "nm": "内贝拉南"
                        },
                        {
                            "nm": "内皮尼亚尔北"
                        },
                        {
                            "nm": "内皮尼亚尔南"
                        },
                        {
                            "nm": "蓬塔德尔加达"
                        },
                        {
                            "nm": "塞图巴尔半岛"
                        },
                        {
                            "nm": "山后"
                        },
                        {
                            "nm": "上阿连特茹"
                        },
                        {
                            "nm": "上特拉斯山"
                        },
                        {
                            "nm": "塔梅加"
                        },
                        {
                            "nm": "万福"
                        },
                        {
                            "nm": "西部"
                        },
                        {
                            "nm": "下阿连特茹"
                        },
                        {
                            "nm": "下伏日"
                        },
                        {
                            "nm": "下蒙德古"
                        },
                        {
                            "nm": "中阿连特茹"
                        }
                    ],
                    "nm": "葡萄牙"
                }
            ]
        },
        {
            "nm": "乔治亚",
            "state": []
        },
        {
            "nm": "日本",
            "state": [
                {
                    "city": [
                        {
                            "nm": "爱媛"
                        },
                        {
                            "nm": "爱知"
                        },
                        {
                            "nm": "北海道"
                        },
                        {
                            "nm": "兵库"
                        },
                        {
                            "nm": "冲绳"
                        },
                        {
                            "nm": "茨城"
                        },
                        {
                            "nm": "大阪"
                        },
                        {
                            "nm": "大分"
                        },
                        {
                            "nm": "岛根"
                        },
                        {
                            "nm": "徳岛"
                        },
                        {
                            "nm": "东京"
                        },
                        {
                            "nm": "福岛"
                        },
                        {
                            "nm": "福冈"
                        },
                        {
                            "nm": "福井"
                        },
                        {
                            "nm": "富山"
                        },
                        {
                            "nm": "冈山"
                        },
                        {
                            "nm": "高知"
                        },
                        {
                            "nm": "宮城"
                        },
                        {
                            "nm": "宫崎"
                        },
                        {
                            "nm": "广岛"
                        },
                        {
                            "nm": "和歌山"
                        },
                        {
                            "nm": "京都"
                        },
                        {
                            "nm": "静冈"
                        },
                        {
                            "nm": "枥木"
                        },
                        {
                            "nm": "鹿儿岛"
                        },
                        {
                            "nm": "奈良"
                        },
                        {
                            "nm": "鸟取"
                        },
                        {
                            "nm": "岐阜"
                        },
                        {
                            "nm": "埼玉"
                        },
                        {
                            "nm": "千叶"
                        },
                        {
                            "nm": "青森"
                        },
                        {
                            "nm": "秋田"
                        },
                        {
                            "nm": "群马"
                        },
                        {
                            "nm": "三重"
                        },
                        {
                            "nm": "山口"
                        },
                        {
                            "nm": "山梨"
                        },
                        {
                            "nm": "山形"
                        },
                        {
                            "nm": "神奈川"
                        },
                        {
                            "nm": "石川"
                        },
                        {
                            "nm": "香川"
                        },
                        {
                            "nm": "新潟"
                        },
                        {
                            "nm": "熊本"
                        },
                        {
                            "nm": "岩手"
                        },
                        {
                            "nm": "长崎"
                        },
                        {
                            "nm": "长野"
                        },
                        {
                            "nm": "滋贺"
                        },
                        {
                            "nm": "佐贺"
                        }
                    ],
                    "nm": "日本"
                }
            ]
        },
        {
            "nm": "瑞典",
            "state": [
                {
                    "city": [
                        {
                            "nm": "北博滕"
                        },
                        {
                            "nm": "布莱金厄"
                        },
                        {
                            "nm": "达拉纳"
                        },
                        {
                            "nm": "东约特兰"
                        },
                        {
                            "nm": "厄勒布鲁"
                        },
                        {
                            "nm": "哥得兰"
                        },
                        {
                            "nm": "哈兰"
                        },
                        {
                            "nm": "卡尔马"
                        },
                        {
                            "nm": "克鲁努贝里"
                        },
                        {
                            "nm": "南曼兰"
                        },
                        {
                            "nm": "斯德哥尔摩"
                        },
                        {
                            "nm": "斯科耐"
                        },
                        {
                            "nm": "韦姆兰"
                        },
                        {
                            "nm": "乌普萨拉"
                        },
                        {
                            "nm": "西博滕"
                        },
                        {
                            "nm": "西曼兰"
                        },
                        {
                            "nm": "西诺尔兰"
                        },
                        {
                            "nm": "西约特兰"
                        },
                        {
                            "nm": "延雪平"
                        },
                        {
                            "nm": "耶夫勒堡"
                        },
                        {
                            "nm": "耶姆特兰"
                        }
                    ],
                    "nm": "瑞典"
                }
            ]
        },
        {
            "nm": "瑞士",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿尔高"
                        },
                        {
                            "nm": "巴塞尔城市"
                        },
                        {
                            "nm": "巴塞尔乡村"
                        },
                        {
                            "nm": "伯尔尼"
                        },
                        {
                            "nm": "楚格"
                        },
                        {
                            "nm": "弗里堡"
                        },
                        {
                            "nm": "格拉鲁斯"
                        },
                        {
                            "nm": "格劳宾登"
                        },
                        {
                            "nm": "卢塞恩"
                        },
                        {
                            "nm": "洛桑"
                        },
                        {
                            "nm": "纳沙泰尔"
                        },
                        {
                            "nm": "内阿彭策尔"
                        },
                        {
                            "nm": "日内瓦"
                        },
                        {
                            "nm": "汝拉"
                        },
                        {
                            "nm": "沙夫豪森"
                        },
                        {
                            "nm": "上瓦尔登"
                        },
                        {
                            "nm": "圣加仑"
                        },
                        {
                            "nm": "施维茨"
                        },
                        {
                            "nm": "苏黎世"
                        },
                        {
                            "nm": "索洛图恩"
                        },
                        {
                            "nm": "提契诺"
                        },
                        {
                            "nm": "图尔高"
                        },
                        {
                            "nm": "瓦莱"
                        },
                        {
                            "nm": "外阿彭策尔"
                        },
                        {
                            "nm": "沃"
                        },
                        {
                            "nm": "乌里"
                        },
                        {
                            "nm": "下瓦尔登"
                        }
                    ],
                    "nm": "瑞士"
                }
            ]
        },
        {
            "nm": "萨尔瓦多",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿波帕"
                        },
                        {
                            "nm": "阿瓦查潘"
                        },
                        {
                            "nm": "滨海"
                        },
                        {
                            "nm": "查拉特南戈"
                        },
                        {
                            "nm": "德尔加多"
                        },
                        {
                            "nm": "基埃-恩特姆"
                        },
                        {
                            "nm": "卡瓦尼亚斯"
                        },
                        {
                            "nm": "库斯卡特兰"
                        },
                        {
                            "nm": "拉巴斯"
                        },
                        {
                            "nm": "拉利伯塔德"
                        },
                        {
                            "nm": "拉乌尼翁"
                        },
                        {
                            "nm": "梅基卡诺斯"
                        },
                        {
                            "nm": "莫拉桑"
                        },
                        {
                            "nm": "圣安娜"
                        },
                        {
                            "nm": "圣米格尔"
                        },
                        {
                            "nm": "圣萨尔瓦多"
                        },
                        {
                            "nm": "圣维森特"
                        },
                        {
                            "nm": "松索纳特"
                        },
                        {
                            "nm": "索亚潘戈"
                        },
                        {
                            "nm": "韦莱-恩萨斯"
                        },
                        {
                            "nm": "乌苏卢坦"
                        },
                        {
                            "nm": "伊洛潘戈"
                        },
                        {
                            "nm": "中南"
                        }
                    ],
                    "nm": "萨尔瓦多"
                }
            ]
        },
        {
            "nm": "萨摩亚",
            "state": []
        },
        {
            "nm": "塞尔维亚,黑山",
            "state": [
                {
                    "city": [
                        {
                            "nm": "贝尔格莱德"
                        },
                        {
                            "nm": "波德戈里察"
                        },
                        {
                            "nm": "克拉古涅瓦茨"
                        },
                        {
                            "nm": "尼什"
                        },
                        {
                            "nm": "诺维萨德"
                        },
                        {
                            "nm": "普里什蒂纳"
                        },
                        {
                            "nm": "苏博蒂察"
                        },
                        {
                            "nm": "泽蒙"
                        }
                    ],
                    "nm": "塞尔维亚,黑山"
                }
            ]
        },
        {
            "nm": "塞拉利昂",
            "state": [
                {
                    "city": [
                        {
                            "nm": "北部"
                        },
                        {
                            "nm": "东部"
                        },
                        {
                            "nm": "南部"
                        },
                        {
                            "nm": "西部区"
                        }
                    ],
                    "nm": "塞拉利昂"
                }
            ]
        },
        {
            "nm": "塞内加尔",
            "state": [
                {
                    "city": [
                        {
                            "nm": "达喀尔"
                        },
                        {
                            "nm": "法蒂克"
                        },
                        {
                            "nm": "济金绍尔"
                        },
                        {
                            "nm": "捷斯"
                        },
                        {
                            "nm": "久尔贝勒"
                        },
                        {
                            "nm": "考拉克"
                        },
                        {
                            "nm": "科尔达"
                        },
                        {
                            "nm": "卢加"
                        },
                        {
                            "nm": "马塔姆"
                        },
                        {
                            "nm": "圣路易"
                        },
                        {
                            "nm": "坦巴昆达"
                        }
                    ],
                    "nm": "塞内加尔"
                }
            ]
        },
        {
            "nm": "塞浦路斯",
            "state": [
                {
                    "city": [
                        {
                            "nm": "法马古斯塔"
                        },
                        {
                            "nm": "凯里尼亚"
                        },
                        {
                            "nm": "拉纳卡"
                        },
                        {
                            "nm": "利马索尔"
                        },
                        {
                            "nm": "尼科西亚"
                        },
                        {
                            "nm": "帕福斯"
                        }
                    ],
                    "nm": "塞浦路斯"
                }
            ]
        },
        {
            "nm": "塞舌尔",
            "state": []
        },
        {
            "nm": "沙特阿拉伯",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿尔阿尔"
                        },
                        {
                            "nm": "艾卜哈"
                        },
                        {
                            "nm": "巴哈"
                        },
                        {
                            "nm": "布赖代"
                        },
                        {
                            "nm": "达曼"
                        },
                        {
                            "nm": "哈费尔巴廷"
                        },
                        {
                            "nm": "哈伊勒"
                        },
                        {
                            "nm": "海米斯穆谢特"
                        },
                        {
                            "nm": "海耶"
                        },
                        {
                            "nm": "胡富夫"
                        },
                        {
                            "nm": "吉达"
                        },
                        {
                            "nm": "吉赞"
                        },
                        {
                            "nm": "利雅得"
                        },
                        {
                            "nm": "麦地那"
                        },
                        {
                            "nm": "麦加"
                        },
                        {
                            "nm": "姆巴拉兹"
                        },
                        {
                            "nm": "纳季兰"
                        },
                        {
                            "nm": "塞卡卡"
                        },
                        {
                            "nm": "塔布克"
                        },
                        {
                            "nm": "塔伊夫"
                        },
                        {
                            "nm": "延布"
                        },
                        {
                            "nm": "朱拜勒"
                        }
                    ],
                    "nm": "沙特阿拉伯"
                }
            ]
        },
        {
            "nm": "圣诞岛",
            "state": []
        },
        {
            "nm": "圣多美和普林西比",
            "state": []
        },
        {
            "nm": "圣赫勒拿",
            "state": []
        },
        {
            "nm": "圣基茨和尼维斯",
            "state": []
        },
        {
            "nm": "圣卢西亚",
            "state": []
        },
        {
            "nm": "圣马力诺",
            "state": []
        },
        {
            "nm": "圣皮埃尔和米克隆群岛",
            "state": []
        },
        {
            "nm": "圣文森特和格林纳丁斯",
            "state": []
        },
        {
            "nm": "斯里兰卡",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿努拉德普勒"
                        },
                        {
                            "nm": "安帕赖"
                        },
                        {
                            "nm": "巴杜勒"
                        },
                        {
                            "nm": "拜蒂克洛"
                        },
                        {
                            "nm": "波隆纳鲁沃"
                        },
                        {
                            "nm": "汉班托特"
                        },
                        {
                            "nm": "基里诺奇"
                        },
                        {
                            "nm": "加勒"
                        },
                        {
                            "nm": "加姆珀哈"
                        },
                        {
                            "nm": "贾夫纳"
                        },
                        {
                            "nm": "卡卢特勒"
                        },
                        {
                            "nm": "凯格勒"
                        },
                        {
                            "nm": "康提"
                        },
                        {
                            "nm": "科伦坡"
                        },
                        {
                            "nm": "库鲁内格勒"
                        },
                        {
                            "nm": "拉特纳普勒"
                        },
                        {
                            "nm": "马纳尔"
                        },
                        {
                            "nm": "马特莱"
                        },
                        {
                            "nm": "马特勒"
                        },
                        {
                            "nm": "莫讷勒格勒"
                        },
                        {
                            "nm": "穆莱蒂武"
                        },
                        {
                            "nm": "努沃勒埃利耶"
                        },
                        {
                            "nm": "普塔勒姆"
                        },
                        {
                            "nm": "亭可马里"
                        },
                        {
                            "nm": "瓦武尼亚"
                        }
                    ],
                    "nm": "斯里兰卡"
                }
            ]
        },
        {
            "nm": "斯洛伐克",
            "state": [
                {
                    "city": [
                        {
                            "nm": "班斯卡-比斯特里察"
                        },
                        {
                            "nm": "布拉迪斯拉发"
                        },
                        {
                            "nm": "科希策"
                        },
                        {
                            "nm": "尼特拉"
                        },
                        {
                            "nm": "普雷绍夫"
                        },
                        {
                            "nm": "日利纳"
                        },
                        {
                            "nm": "特尔纳瓦"
                        },
                        {
                            "nm": "特伦钦"
                        }
                    ],
                    "nm": "斯洛伐克"
                }
            ]
        },
        {
            "nm": "斯洛文尼亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "奥巴尔诺-克拉"
                        },
                        {
                            "nm": "奥斯雷德涅斯洛文"
                        },
                        {
                            "nm": "波德拉夫"
                        },
                        {
                            "nm": "波穆尔"
                        },
                        {
                            "nm": "多雷尼"
                        },
                        {
                            "nm": "戈雷尼"
                        },
                        {
                            "nm": "戈里"
                        },
                        {
                            "nm": "科洛"
                        },
                        {
                            "nm": "诺特拉尼"
                        },
                        {
                            "nm": "萨维尼"
                        },
                        {
                            "nm": "斯波德涅波萨夫"
                        },
                        {
                            "nm": "扎萨夫"
                        }
                    ],
                    "nm": "斯洛文尼亚"
                }
            ]
        },
        {
            "nm": "斯瓦尔巴和扬马廷",
            "state": []
        },
        {
            "nm": "斯威士兰",
            "state": []
        },
        {
            "nm": "苏丹",
            "state": [
                {
                    "city": [
                        {
                            "nm": "北部"
                        },
                        {
                            "nm": "赤道"
                        },
                        {
                            "nm": "达尔富尔"
                        },
                        {
                            "nm": "东部"
                        },
                        {
                            "nm": "加扎勒河"
                        },
                        {
                            "nm": "喀土穆"
                        },
                        {
                            "nm": "科尔多凡"
                        },
                        {
                            "nm": "上尼罗"
                        },
                        {
                            "nm": "中部"
                        }
                    ],
                    "nm": "苏丹"
                }
            ]
        },
        {
            "nm": "苏里南",
            "state": [
                {
                    "city": [
                        {
                            "nm": "布罗科蓬多"
                        },
                        {
                            "nm": "科罗尼"
                        },
                        {
                            "nm": "科默韦讷"
                        },
                        {
                            "nm": "马罗韦讷"
                        },
                        {
                            "nm": "尼克里"
                        },
                        {
                            "nm": "帕拉"
                        },
                        {
                            "nm": "帕拉马里博"
                        },
                        {
                            "nm": "萨拉马卡"
                        },
                        {
                            "nm": "瓦尼卡"
                        },
                        {
                            "nm": "西帕里韦尼"
                        }
                    ],
                    "nm": "苏里南"
                }
            ]
        },
        {
            "nm": "所罗门群岛",
            "state": [
                {
                    "city": [
                        {
                            "nm": "瓜达尔卡纳尔"
                        },
                        {
                            "nm": "霍尼亚拉"
                        },
                        {
                            "nm": "拉纳尔和贝罗纳"
                        },
                        {
                            "nm": "马基拉"
                        },
                        {
                            "nm": "马莱塔"
                        },
                        {
                            "nm": "乔伊索"
                        },
                        {
                            "nm": "泰莫图"
                        },
                        {
                            "nm": "西部"
                        },
                        {
                            "nm": "伊萨贝尔"
                        },
                        {
                            "nm": "中部群岛"
                        }
                    ],
                    "nm": "所罗门群岛"
                }
            ]
        },
        {
            "nm": "索马里",
            "state": []
        },
        {
            "nm": "塔吉克斯坦",
            "state": [
                {
                    "city": [
                        {
                            "nm": "杜尚别"
                        },
                        {
                            "nm": "霍罗格"
                        },
                        {
                            "nm": "卡尼巴达姆"
                        },
                        {
                            "nm": "科法尔尼洪"
                        },
                        {
                            "nm": "苦盏"
                        },
                        {
                            "nm": "库尔干-秋别"
                        },
                        {
                            "nm": "库洛布"
                        },
                        {
                            "nm": "洛贡"
                        },
                        {
                            "nm": "努雷克"
                        },
                        {
                            "nm": "彭吉肯特"
                        },
                        {
                            "nm": "萨班特"
                        },
                        {
                            "nm": "塔博沙尔"
                        },
                        {
                            "nm": "图尔孙扎德"
                        },
                        {
                            "nm": "乌拉秋别"
                        },
                        {
                            "nm": "伊斯法拉"
                        }
                    ],
                    "nm": "塔吉克斯坦"
                }
            ]
        },
        {
            "nm": "泰国",
            "state": [
                {
                    "city": [
                        {
                            "nm": "安纳乍能"
                        },
                        {
                            "nm": "巴蜀"
                        },
                        {
                            "nm": "巴吞他尼"
                        },
                        {
                            "nm": "巴真"
                        },
                        {
                            "nm": "北碧"
                        },
                        {
                            "nm": "北标"
                        },
                        {
                            "nm": "北大年"
                        },
                        {
                            "nm": "北揽"
                        },
                        {
                            "nm": "北榄坡"
                        },
                        {
                            "nm": "北柳"
                        },
                        {
                            "nm": "碧差汶"
                        },
                        {
                            "nm": "博达伦"
                        },
                        {
                            "nm": "猜那"
                        },
                        {
                            "nm": "猜也奔"
                        },
                        {
                            "nm": "程逸"
                        },
                        {
                            "nm": "春蓬"
                        },
                        {
                            "nm": "春武里"
                        },
                        {
                            "nm": "达"
                        },
                        {
                            "nm": "达叻"
                        },
                        {
                            "nm": "大城"
                        },
                        {
                            "nm": "董里"
                        },
                        {
                            "nm": "佛丕"
                        },
                        {
                            "nm": "佛统"
                        },
                        {
                            "nm": "甘烹碧"
                        },
                        {
                            "nm": "红统"
                        },
                        {
                            "nm": "华富里"
                        },
                        {
                            "nm": "加拉信"
                        },
                        {
                            "nm": "甲米"
                        },
                        {
                            "nm": "尖竹汶"
                        },
                        {
                            "nm": "孔敬"
                        },
                        {
                            "nm": "拉农"
                        },
                        {
                            "nm": "廊开"
                        },
                        {
                            "nm": "廊莫那浦"
                        },
                        {
                            "nm": "叻丕"
                        },
                        {
                            "nm": "黎"
                        },
                        {
                            "nm": "黎逸"
                        },
                        {
                            "nm": "龙仔厝"
                        },
                        {
                            "nm": "罗勇"
                        },
                        {
                            "nm": "洛坤"
                        },
                        {
                            "nm": "玛哈沙拉堪"
                        },
                        {
                            "nm": "曼谷"
                        },
                        {
                            "nm": "莫达汉"
                        },
                        {
                            "nm": "那空那育"
                        },
                        {
                            "nm": "那空帕农"
                        },
                        {
                            "nm": "难"
                        },
                        {
                            "nm": "南奔"
                        },
                        {
                            "nm": "暖武里"
                        },
                        {
                            "nm": "帕"
                        },
                        {
                            "nm": "帕尧"
                        },
                        {
                            "nm": "攀牙"
                        },
                        {
                            "nm": "彭世洛"
                        },
                        {
                            "nm": "披集"
                        },
                        {
                            "nm": "普吉"
                        },
                        {
                            "nm": "清莱"
                        },
                        {
                            "nm": "清迈"
                        },
                        {
                            "nm": "色军"
                        },
                        {
                            "nm": "沙敦"
                        },
                        {
                            "nm": "沙缴"
                        },
                        {
                            "nm": "四色菊"
                        },
                        {
                            "nm": "宋卡"
                        },
                        {
                            "nm": "素可泰"
                        },
                        {
                            "nm": "素叻"
                        },
                        {
                            "nm": "素林"
                        },
                        {
                            "nm": "素攀武里"
                        },
                        {
                            "nm": "陶公"
                        },
                        {
                            "nm": "乌隆"
                        },
                        {
                            "nm": "乌泰他尼"
                        },
                        {
                            "nm": "乌汶"
                        },
                        {
                            "nm": "武里南"
                        },
                        {
                            "nm": "信武里"
                        },
                        {
                            "nm": "耶梭通"
                        },
                        {
                            "nm": "也拉"
                        },
                        {
                            "nm": "夜丰颂"
                        },
                        {
                            "nm": "夜功"
                        }
                    ],
                    "nm": "泰国"
                }
            ]
        },
        {
            "nm": "坦桑尼亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿鲁沙"
                        },
                        {
                            "nm": "奔巴北"
                        },
                        {
                            "nm": "奔巴南"
                        },
                        {
                            "nm": "滨海"
                        },
                        {
                            "nm": "达累斯萨拉姆"
                        },
                        {
                            "nm": "多多马"
                        },
                        {
                            "nm": "基戈马"
                        },
                        {
                            "nm": "卡盖拉"
                        },
                        {
                            "nm": "林迪"
                        },
                        {
                            "nm": "鲁夸"
                        },
                        {
                            "nm": "鲁伍马"
                        },
                        {
                            "nm": "马腊"
                        },
                        {
                            "nm": "曼亚拉"
                        },
                        {
                            "nm": "莫洛戈罗"
                        },
                        {
                            "nm": "姆贝亚"
                        },
                        {
                            "nm": "姆特瓦拉"
                        },
                        {
                            "nm": "姆万扎"
                        },
                        {
                            "nm": "乞力马扎罗"
                        },
                        {
                            "nm": "桑给巴尔"
                        },
                        {
                            "nm": "桑给巴尔北"
                        },
                        {
                            "nm": "桑给巴尔南"
                        },
                        {
                            "nm": "桑给巴尔市和西"
                        },
                        {
                            "nm": "塔波拉"
                        },
                        {
                            "nm": "坦噶"
                        },
                        {
                            "nm": "辛吉达"
                        },
                        {
                            "nm": "欣延加"
                        },
                        {
                            "nm": "伊林加"
                        }
                    ],
                    "nm": "坦桑尼亚"
                }
            ]
        },
        {
            "nm": "汤加",
            "state": [
                {
                    "city": [
                        {
                            "nm": "埃瓦"
                        },
                        {
                            "nm": "哈派"
                        },
                        {
                            "nm": "纽阿斯"
                        },
                        {
                            "nm": "汤加塔布"
                        },
                        {
                            "nm": "瓦瓦乌"
                        }
                    ],
                    "nm": "汤加"
                }
            ]
        },
        {
            "nm": "特克斯和凯克特斯群岛",
            "state": []
        },
        {
            "nm": "特里斯坦达昆哈",
            "state": []
        },
        {
            "nm": "特立尼达和多巴哥",
            "state": []
        },
        {
            "nm": "突尼斯",
            "state": [
                {
                    "city": [
                        {
                            "nm": "艾尔亚奈"
                        },
                        {
                            "nm": "巴杰"
                        },
                        {
                            "nm": "本阿鲁斯"
                        },
                        {
                            "nm": "比塞大"
                        },
                        {
                            "nm": "吉比利"
                        },
                        {
                            "nm": "加贝斯"
                        },
                        {
                            "nm": "加夫萨"
                        },
                        {
                            "nm": "坚杜拜"
                        },
                        {
                            "nm": "卡夫"
                        },
                        {
                            "nm": "卡塞林"
                        },
                        {
                            "nm": "凯鲁万"
                        },
                        {
                            "nm": "马赫迪耶"
                        },
                        {
                            "nm": "马努巴"
                        },
                        {
                            "nm": "梅德宁"
                        },
                        {
                            "nm": "莫纳斯提尔"
                        },
                        {
                            "nm": "纳布勒"
                        },
                        {
                            "nm": "斯法克斯"
                        },
                        {
                            "nm": "苏塞"
                        },
                        {
                            "nm": "泰塔温"
                        },
                        {
                            "nm": "突尼斯"
                        },
                        {
                            "nm": "托泽尔"
                        },
                        {
                            "nm": "西迪布济德"
                        },
                        {
                            "nm": "锡勒亚奈"
                        },
                        {
                            "nm": "宰格万"
                        }
                    ],
                    "nm": "突尼斯"
                }
            ]
        },
        {
            "nm": "图瓦卢",
            "state": []
        },
        {
            "nm": "土耳其",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿达纳"
                        },
                        {
                            "nm": "阿德亚曼"
                        },
                        {
                            "nm": "阿尔达罕"
                        },
                        {
                            "nm": "阿尔特温"
                        },
                        {
                            "nm": "阿菲永"
                        },
                        {
                            "nm": "阿克萨赖"
                        },
                        {
                            "nm": "阿勒"
                        },
                        {
                            "nm": "阿马西亚"
                        },
                        {
                            "nm": "埃迪尔内"
                        },
                        {
                            "nm": "埃尔津詹"
                        },
                        {
                            "nm": "埃尔祖鲁姆"
                        },
                        {
                            "nm": "埃拉泽"
                        },
                        {
                            "nm": "埃斯基谢希尔"
                        },
                        {
                            "nm": "艾登"
                        },
                        {
                            "nm": "安卡拉"
                        },
                        {
                            "nm": "安塔利亚"
                        },
                        {
                            "nm": "奥尔杜"
                        },
                        {
                            "nm": "巴尔腾"
                        },
                        {
                            "nm": "巴勒克埃西尔"
                        },
                        {
                            "nm": "巴特曼"
                        },
                        {
                            "nm": "巴伊布尔特"
                        },
                        {
                            "nm": "比莱吉克"
                        },
                        {
                            "nm": "比特利斯"
                        },
                        {
                            "nm": "宾格尔"
                        },
                        {
                            "nm": "博卢"
                        },
                        {
                            "nm": "布尔杜尔"
                        },
                        {
                            "nm": "布尔萨"
                        },
                        {
                            "nm": "昌克勒"
                        },
                        {
                            "nm": "代尼兹利"
                        },
                        {
                            "nm": "迪亚巴克尔"
                        },
                        {
                            "nm": "凡"
                        },
                        {
                            "nm": "哈卡里"
                        },
                        {
                            "nm": "哈塔伊"
                        },
                        {
                            "nm": "基利斯"
                        },
                        {
                            "nm": "吉雷松"
                        },
                        {
                            "nm": "加济安泰普"
                        },
                        {
                            "nm": "居米什哈内"
                        },
                        {
                            "nm": "卡尔斯"
                        },
                        {
                            "nm": "卡赫拉曼马拉什"
                        },
                        {
                            "nm": "卡拉比克"
                        },
                        {
                            "nm": "卡拉曼"
                        },
                        {
                            "nm": "卡斯塔莫努"
                        },
                        {
                            "nm": "开塞利"
                        },
                        {
                            "nm": "科贾埃利"
                        },
                        {
                            "nm": "柯克拉雷利"
                        },
                        {
                            "nm": "科尼亚"
                        },
                        {
                            "nm": "克尔谢希尔"
                        },
                        {
                            "nm": "克勒克卡莱"
                        },
                        {
                            "nm": "拉飞"
                        },
                        {
                            "nm": "里泽"
                        },
                        {
                            "nm": "马尔丁"
                        },
                        {
                            "nm": "马拉蒂亚"
                        },
                        {
                            "nm": "马尼萨"
                        },
                        {
                            "nm": "穆拉"
                        },
                        {
                            "nm": "穆什"
                        },
                        {
                            "nm": "内夫谢希尔"
                        },
                        {
                            "nm": "尼代"
                        },
                        {
                            "nm": "恰纳卡莱"
                        },
                        {
                            "nm": "乔鲁姆"
                        },
                        {
                            "nm": "屈塔希亚"
                        },
                        {
                            "nm": "萨卡里亚"
                        },
                        {
                            "nm": "萨姆松"
                        },
                        {
                            "nm": "泰基尔达"
                        },
                        {
                            "nm": "特拉布宗"
                        },
                        {
                            "nm": "通杰利"
                        },
                        {
                            "nm": "托卡特"
                        },
                        {
                            "nm": "乌萨克"
                        },
                        {
                            "nm": "锡尔纳克"
                        },
                        {
                            "nm": "锡尔特"
                        },
                        {
                            "nm": "锡诺普"
                        },
                        {
                            "nm": "锡瓦斯"
                        },
                        {
                            "nm": "伊迪尔"
                        },
                        {
                            "nm": "伊切尔"
                        },
                        {
                            "nm": "伊斯帕尔塔"
                        },
                        {
                            "nm": "伊斯坦布尔"
                        },
                        {
                            "nm": "伊兹密尔"
                        },
                        {
                            "nm": "约兹加特"
                        },
                        {
                            "nm": "宗古尔达克"
                        }
                    ],
                    "nm": "土耳其"
                }
            ]
        },
        {
            "nm": "土库曼斯坦",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿哈尔"
                        },
                        {
                            "nm": "阿什哈巴德市"
                        },
                        {
                            "nm": "巴尔坎"
                        },
                        {
                            "nm": "达沙古兹"
                        },
                        {
                            "nm": "列巴普"
                        },
                        {
                            "nm": "马雷"
                        },
                        {
                            "nm": "涅比特达格"
                        }
                    ],
                    "nm": "土库曼斯坦"
                }
            ]
        },
        {
            "nm": "托克劳",
            "state": []
        },
        {
            "nm": "瓦利斯和福图纳",
            "state": []
        },
        {
            "nm": "瓦努阿图",
            "state": [
                {
                    "city": [
                        {
                            "nm": "马朗帕"
                        },
                        {
                            "nm": "彭纳马"
                        },
                        {
                            "nm": "桑马"
                        },
                        {
                            "nm": "塔菲阿"
                        },
                        {
                            "nm": "托尔巴"
                        },
                        {
                            "nm": "谢法"
                        }
                    ],
                    "nm": "瓦努阿图"
                }
            ]
        },
        {
            "nm": "危地马拉",
            "state": [
                {
                    "city": [
                        {
                            "nm": "埃尔普罗格雷索"
                        },
                        {
                            "nm": "埃斯昆特拉"
                        },
                        {
                            "nm": "哈拉帕"
                        },
                        {
                            "nm": "胡蒂亚帕"
                        },
                        {
                            "nm": "基切"
                        },
                        {
                            "nm": "克萨尔特南戈"
                        },
                        {
                            "nm": "雷塔卢莱乌"
                        },
                        {
                            "nm": "米克斯科"
                        },
                        {
                            "nm": "佩滕"
                        },
                        {
                            "nm": "奇基穆拉"
                        },
                        {
                            "nm": "奇马尔特南戈"
                        },
                        {
                            "nm": "萨卡帕"
                        },
                        {
                            "nm": "萨卡特佩克斯"
                        },
                        {
                            "nm": "上韦拉帕斯"
                        },
                        {
                            "nm": "圣罗莎"
                        },
                        {
                            "nm": "圣马科斯"
                        },
                        {
                            "nm": "苏奇特佩克斯"
                        },
                        {
                            "nm": "索洛拉"
                        },
                        {
                            "nm": "托托尼卡潘"
                        },
                        {
                            "nm": "危地马拉"
                        },
                        {
                            "nm": "韦韦特南戈"
                        },
                        {
                            "nm": "下韦拉帕斯"
                        },
                        {
                            "nm": "新城"
                        },
                        {
                            "nm": "伊萨瓦尔"
                        }
                    ],
                    "nm": "危地马拉"
                }
            ]
        },
        {
            "nm": "维尔京群岛，美属",
            "state": []
        },
        {
            "nm": "维尔京群岛，英属",
            "state": []
        },
        {
            "nm": "委内瑞拉",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿拉瓜"
                        },
                        {
                            "nm": "阿马库罗三角洲"
                        },
                        {
                            "nm": "阿普雷"
                        },
                        {
                            "nm": "安索阿特吉"
                        },
                        {
                            "nm": "巴里纳斯"
                        },
                        {
                            "nm": "玻利瓦尔"
                        },
                        {
                            "nm": "波图格萨"
                        },
                        {
                            "nm": "法尔孔"
                        },
                        {
                            "nm": "瓜里科"
                        },
                        {
                            "nm": "加拉加斯"
                        },
                        {
                            "nm": "卡拉沃沃"
                        },
                        {
                            "nm": "科赫德斯"
                        },
                        {
                            "nm": "拉腊"
                        },
                        {
                            "nm": "联邦属地"
                        },
                        {
                            "nm": "梅里达"
                        },
                        {
                            "nm": "米兰达"
                        },
                        {
                            "nm": "莫纳加斯"
                        },
                        {
                            "nm": "苏克雷"
                        },
                        {
                            "nm": "苏利亚"
                        },
                        {
                            "nm": "塔奇拉"
                        },
                        {
                            "nm": "特鲁希略"
                        },
                        {
                            "nm": "新埃斯帕塔"
                        },
                        {
                            "nm": "亚拉奎"
                        },
                        {
                            "nm": "亚马孙"
                        }
                    ],
                    "nm": "委内瑞拉"
                }
            ]
        },
        {
            "nm": "文莱",
            "state": []
        },
        {
            "nm": "乌干达",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿鲁阿"
                        },
                        {
                            "nm": "阿帕克"
                        },
                        {
                            "nm": "阿朱马尼"
                        },
                        {
                            "nm": "本迪布焦"
                        },
                        {
                            "nm": "布吉里"
                        },
                        {
                            "nm": "布西亚"
                        },
                        {
                            "nm": "布谢尼"
                        },
                        {
                            "nm": "恩通加莫"
                        },
                        {
                            "nm": "古卢"
                        },
                        {
                            "nm": "霍伊马"
                        },
                        {
                            "nm": "基巴莱"
                        },
                        {
                            "nm": "基博加"
                        },
                        {
                            "nm": "基恩乔乔"
                        },
                        {
                            "nm": "基索罗"
                        },
                        {
                            "nm": "基特古姆"
                        },
                        {
                            "nm": "金贾"
                        },
                        {
                            "nm": "卡巴莱"
                        },
                        {
                            "nm": "卡巴罗莱"
                        },
                        {
                            "nm": "卡贝拉马伊多"
                        },
                        {
                            "nm": "卡兰加拉"
                        },
                        {
                            "nm": "卡姆文盖"
                        },
                        {
                            "nm": "卡穆利"
                        },
                        {
                            "nm": "卡农古"
                        },
                        {
                            "nm": "卡普乔鲁瓦"
                        },
                        {
                            "nm": "卡塞塞"
                        },
                        {
                            "nm": "卡塔奎"
                        },
                        {
                            "nm": "卡永加"
                        },
                        {
                            "nm": "坎帕拉"
                        },
                        {
                            "nm": "科蒂多"
                        },
                        {
                            "nm": "库米"
                        },
                        {
                            "nm": "拉卡伊"
                        },
                        {
                            "nm": "利拉"
                        },
                        {
                            "nm": "卢韦罗"
                        },
                        {
                            "nm": "鲁昆吉里"
                        },
                        {
                            "nm": "马萨卡"
                        },
                        {
                            "nm": "马辛迪"
                        },
                        {
                            "nm": "马尤盖"
                        },
                        {
                            "nm": "莫罗托"
                        },
                        {
                            "nm": "莫约"
                        },
                        {
                            "nm": "姆巴拉拉"
                        },
                        {
                            "nm": "姆巴莱"
                        },
                        {
                            "nm": "姆皮吉"
                        },
                        {
                            "nm": "穆本德"
                        },
                        {
                            "nm": "穆科诺"
                        },
                        {
                            "nm": "纳卡皮里皮里特"
                        },
                        {
                            "nm": "纳卡松戈拉"
                        },
                        {
                            "nm": "内比"
                        },
                        {
                            "nm": "帕德尔"
                        },
                        {
                            "nm": "帕利萨"
                        },
                        {
                            "nm": "森巴布莱"
                        },
                        {
                            "nm": "索罗提"
                        },
                        {
                            "nm": "托罗罗"
                        },
                        {
                            "nm": "瓦基索"
                        },
                        {
                            "nm": "锡龙科"
                        },
                        {
                            "nm": "伊甘加"
                        },
                        {
                            "nm": "永贝"
                        }
                    ],
                    "nm": "乌干达"
                }
            ]
        },
        {
            "nm": "乌克兰",
            "state": [
                {
                    "city": [
                        {
                            "nm": "敖德萨"
                        },
                        {
                            "nm": "波尔塔瓦"
                        },
                        {
                            "nm": "第聂伯罗波得罗夫斯克"
                        },
                        {
                            "nm": "顿涅茨克"
                        },
                        {
                            "nm": "哈尔科夫"
                        },
                        {
                            "nm": "赫尔松州"
                        },
                        {
                            "nm": "赫梅利尼茨基"
                        },
                        {
                            "nm": "基辅"
                        },
                        {
                            "nm": "基洛夫格勒"
                        },
                        {
                            "nm": "捷尔诺波尔"
                        },
                        {
                            "nm": "克里米亚自治共和国"
                        },
                        {
                            "nm": "利沃夫"
                        },
                        {
                            "nm": "卢甘斯克"
                        },
                        {
                            "nm": "罗夫诺"
                        },
                        {
                            "nm": "尼古拉耶夫"
                        },
                        {
                            "nm": "切尔卡瑟"
                        },
                        {
                            "nm": "切尔尼戈夫"
                        },
                        {
                            "nm": "切尔诺夫策"
                        },
                        {
                            "nm": "日托米尔"
                        },
                        {
                            "nm": "苏梅"
                        },
                        {
                            "nm": "外喀尔巴阡"
                        },
                        {
                            "nm": "文尼察"
                        },
                        {
                            "nm": "沃伦"
                        },
                        {
                            "nm": "伊万－弗兰科夫州"
                        },
                        {
                            "nm": "扎波罗热"
                        }
                    ],
                    "nm": "乌克兰"
                }
            ]
        },
        {
            "nm": "乌拉圭",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿蒂加斯"
                        },
                        {
                            "nm": "杜拉斯诺"
                        },
                        {
                            "nm": "佛罗里达"
                        },
                        {
                            "nm": "弗洛雷斯"
                        },
                        {
                            "nm": "卡内洛内斯"
                        },
                        {
                            "nm": "科洛尼亚"
                        },
                        {
                            "nm": "拉瓦耶哈"
                        },
                        {
                            "nm": "里韦拉"
                        },
                        {
                            "nm": "罗恰"
                        },
                        {
                            "nm": "马尔多纳多"
                        },
                        {
                            "nm": "蒙得维的亚"
                        },
                        {
                            "nm": "内格罗河"
                        },
                        {
                            "nm": "派桑杜"
                        },
                        {
                            "nm": "萨尔托"
                        },
                        {
                            "nm": "塞罗拉尔戈"
                        },
                        {
                            "nm": "三十三人"
                        },
                        {
                            "nm": "圣何塞"
                        },
                        {
                            "nm": "索里亚诺"
                        },
                        {
                            "nm": "塔夸伦博"
                        }
                    ],
                    "nm": "乌拉圭"
                }
            ]
        },
        {
            "nm": "乌兹别克斯坦",
            "state": [
                {
                    "city": [
                        {
                            "nm": "安集延"
                        },
                        {
                            "nm": "布哈拉"
                        },
                        {
                            "nm": "费尔干纳"
                        },
                        {
                            "nm": "花拉子模"
                        },
                        {
                            "nm": "吉扎克"
                        },
                        {
                            "nm": "卡拉卡尔帕克斯坦共和国"
                        },
                        {
                            "nm": "卡什卡达里亚"
                        },
                        {
                            "nm": "纳曼干"
                        },
                        {
                            "nm": "纳沃伊"
                        },
                        {
                            "nm": "撒马尔罕"
                        },
                        {
                            "nm": "苏尔汉河"
                        },
                        {
                            "nm": "塔什干"
                        },
                        {
                            "nm": "塔什干市"
                        },
                        {
                            "nm": "锡尔河"
                        }
                    ],
                    "nm": "乌兹别克斯坦"
                }
            ]
        },
        {
            "nm": "西班牙",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿尔梅里亚"
                        },
                        {
                            "nm": "阿尔瓦塞特"
                        },
                        {
                            "nm": "阿拉瓦"
                        },
                        {
                            "nm": "阿利坎特"
                        },
                        {
                            "nm": "阿斯图利亚斯"
                        },
                        {
                            "nm": "阿维拉"
                        },
                        {
                            "nm": "奥伦塞"
                        },
                        {
                            "nm": "巴达霍斯"
                        },
                        {
                            "nm": "巴利阿里"
                        },
                        {
                            "nm": "巴利亚多利德"
                        },
                        {
                            "nm": "巴伦西亚"
                        },
                        {
                            "nm": "巴塞罗那"
                        },
                        {
                            "nm": "比斯开"
                        },
                        {
                            "nm": "布尔戈斯"
                        },
                        {
                            "nm": "格拉纳达"
                        },
                        {
                            "nm": "瓜达拉哈拉"
                        },
                        {
                            "nm": "哈恩"
                        },
                        {
                            "nm": "赫罗纳"
                        },
                        {
                            "nm": "吉普斯夸"
                        },
                        {
                            "nm": "加的斯"
                        },
                        {
                            "nm": "卡塞雷斯"
                        },
                        {
                            "nm": "卡斯蒂利亚"
                        },
                        {
                            "nm": "卡斯特利翁"
                        },
                        {
                            "nm": "科尔多瓦"
                        },
                        {
                            "nm": "昆卡"
                        },
                        {
                            "nm": "拉科鲁尼亚"
                        },
                        {
                            "nm": "拉里奥哈"
                        },
                        {
                            "nm": "拉斯帕尔马斯"
                        },
                        {
                            "nm": "莱昂"
                        },
                        {
                            "nm": "莱里达"
                        },
                        {
                            "nm": "卢戈"
                        },
                        {
                            "nm": "马德里"
                        },
                        {
                            "nm": "马拉加"
                        },
                        {
                            "nm": "穆尔西亚"
                        },
                        {
                            "nm": "纳瓦拉"
                        },
                        {
                            "nm": "帕伦西亚"
                        },
                        {
                            "nm": "蓬特韦德拉"
                        },
                        {
                            "nm": "萨拉戈萨"
                        },
                        {
                            "nm": "萨拉曼卡"
                        },
                        {
                            "nm": "萨莫拉"
                        },
                        {
                            "nm": "塞哥维亚"
                        },
                        {
                            "nm": "塞维利亚"
                        },
                        {
                            "nm": "桑坦德"
                        },
                        {
                            "nm": "圣克鲁斯-德特内里费"
                        },
                        {
                            "nm": "索里亚"
                        },
                        {
                            "nm": "塔拉戈纳"
                        },
                        {
                            "nm": "特鲁埃尔"
                        },
                        {
                            "nm": "托莱多"
                        },
                        {
                            "nm": "韦尔瓦"
                        },
                        {
                            "nm": "韦斯卡"
                        }
                    ],
                    "nm": "西班牙"
                }
            ]
        },
        {
            "nm": "希腊",
            "state": [
                {
                    "city": [
                        {
                            "nm": "比雷埃夫斯"
                        },
                        {
                            "nm": "多德卡尼斯"
                        },
                        {
                            "nm": "干尼亚"
                        },
                        {
                            "nm": "基克拉迪"
                        },
                        {
                            "nm": "拉西锡"
                        },
                        {
                            "nm": "莱斯博斯"
                        },
                        {
                            "nm": "雷西姆农"
                        },
                        {
                            "nm": "萨摩斯"
                        },
                        {
                            "nm": "雅典"
                        },
                        {
                            "nm": "伊拉克里翁"
                        }
                    ],
                    "nm": "希腊"
                }
            ]
        },
        {
            "nm": "新加坡",
            "state": []
        },
        {
            "nm": "新喀里多尼亚",
            "state": []
        },
        {
            "nm": "新西兰",
            "state": [
                {
                    "city": [
                        {
                            "nm": "奥克兰"
                        },
                        {
                            "nm": "北岸"
                        },
                        {
                            "nm": "北帕默斯顿"
                        },
                        {
                            "nm": "北远"
                        },
                        {
                            "nm": "布莱尼姆"
                        },
                        {
                            "nm": "达尼丁"
                        },
                        {
                            "nm": "格雷茅斯"
                        },
                        {
                            "nm": "哈密尔顿"
                        },
                        {
                            "nm": "黑斯廷斯"
                        },
                        {
                            "nm": "怀塔科拉"
                        },
                        {
                            "nm": "吉斯伯恩"
                        },
                        {
                            "nm": "凯帕拉"
                        },
                        {
                            "nm": "克赖斯特彻奇"
                        },
                        {
                            "nm": "里士满"
                        },
                        {
                            "nm": "马努考"
                        },
                        {
                            "nm": "纳尔逊"
                        },
                        {
                            "nm": "内皮尔"
                        },
                        {
                            "nm": "斯特拉特福德"
                        },
                        {
                            "nm": "陶马鲁努伊"
                        },
                        {
                            "nm": "瓦卡塔尼"
                        },
                        {
                            "nm": "旺阿雷"
                        },
                        {
                            "nm": "旺格努伊"
                        },
                        {
                            "nm": "新普利茅斯"
                        },
                        {
                            "nm": "因弗卡吉尔"
                        }
                    ],
                    "nm": "新西兰"
                }
            ]
        },
        {
            "nm": "匈牙利",
            "state": [
                {
                    "city": [
                        {
                            "nm": "巴兰尼亚"
                        },
                        {
                            "nm": "巴奇-基什孔"
                        },
                        {
                            "nm": "包尔绍德-奥包乌伊-曾普伦"
                        },
                        {
                            "nm": "贝凯什"
                        },
                        {
                            "nm": "布达佩斯"
                        },
                        {
                            "nm": "费耶尔"
                        },
                        {
                            "nm": "豪伊杜-比豪尔"
                        },
                        {
                            "nm": "赫维什"
                        },
                        {
                            "nm": "加兹-纳杰孔-索尔诺克"
                        },
                        {
                            "nm": "杰尔-莫松-肖普朗"
                        },
                        {
                            "nm": "科马罗姆"
                        },
                        {
                            "nm": "诺格拉德"
                        },
                        {
                            "nm": "佩斯"
                        },
                        {
                            "nm": "琼格拉德"
                        },
                        {
                            "nm": "绍莫吉"
                        },
                        {
                            "nm": "索博尔奇-索特马尔-贝拉格"
                        },
                        {
                            "nm": "托尔瑙"
                        },
                        {
                            "nm": "维斯普雷姆"
                        },
                        {
                            "nm": "沃什"
                        },
                        {
                            "nm": "佐洛"
                        }
                    ],
                    "nm": "匈牙利"
                }
            ]
        },
        {
            "nm": "叙利亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿勒颇"
                        },
                        {
                            "nm": "大马士革"
                        },
                        {
                            "nm": "大马士革市"
                        },
                        {
                            "nm": "代尔祖尔"
                        },
                        {
                            "nm": "德拉"
                        },
                        {
                            "nm": "哈马"
                        },
                        {
                            "nm": "哈塞克"
                        },
                        {
                            "nm": "霍姆斯"
                        },
                        {
                            "nm": "加布"
                        },
                        {
                            "nm": "卡米什利"
                        },
                        {
                            "nm": "库奈特拉"
                        },
                        {
                            "nm": "拉卡"
                        },
                        {
                            "nm": "拉塔基亚"
                        },
                        {
                            "nm": "苏韦达"
                        },
                        {
                            "nm": "塔尔图斯"
                        },
                        {
                            "nm": "伊德利卜"
                        }
                    ],
                    "nm": "叙利亚"
                }
            ]
        },
        {
            "nm": "牙买加",
            "state": [
                {
                    "city": [
                        {
                            "nm": "波特兰"
                        },
                        {
                            "nm": "汉诺威"
                        },
                        {
                            "nm": "金斯敦"
                        },
                        {
                            "nm": "克拉伦登"
                        },
                        {
                            "nm": "曼彻斯特"
                        },
                        {
                            "nm": "圣安德鲁斯"
                        },
                        {
                            "nm": "圣安娜"
                        },
                        {
                            "nm": "圣凯瑟琳"
                        },
                        {
                            "nm": "圣玛丽"
                        },
                        {
                            "nm": "圣托马斯"
                        },
                        {
                            "nm": "圣伊丽莎白"
                        },
                        {
                            "nm": "圣詹姆斯"
                        },
                        {
                            "nm": "特里洛尼"
                        },
                        {
                            "nm": "西摩兰"
                        }
                    ],
                    "nm": "牙买加"
                }
            ]
        },
        {
            "nm": "亚美尼亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿尔马维尔"
                        },
                        {
                            "nm": "阿拉加措特恩"
                        },
                        {
                            "nm": "阿拉拉特"
                        },
                        {
                            "nm": "埃里温市"
                        },
                        {
                            "nm": "格加尔库尼克"
                        },
                        {
                            "nm": "科泰克"
                        },
                        {
                            "nm": "洛里"
                        },
                        {
                            "nm": "塔武什"
                        },
                        {
                            "nm": "瓦约茨·佐尔"
                        },
                        {
                            "nm": "希拉克"
                        },
                        {
                            "nm": "休尼克"
                        }
                    ],
                    "nm": "亚美尼亚"
                }
            ]
        },
        {
            "nm": "也门",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿比扬"
                        },
                        {
                            "nm": "阿姆兰"
                        },
                        {
                            "nm": "贝达"
                        },
                        {
                            "nm": "达利"
                        },
                        {
                            "nm": "哈德拉毛"
                        },
                        {
                            "nm": "哈杰"
                        },
                        {
                            "nm": "荷台达"
                        },
                        {
                            "nm": "焦夫"
                        },
                        {
                            "nm": "拉赫季"
                        },
                        {
                            "nm": "马里卜"
                        },
                        {
                            "nm": "迈赫拉"
                        },
                        {
                            "nm": "迈赫维特"
                        },
                        {
                            "nm": "萨达"
                        },
                        {
                            "nm": "萨那"
                        },
                        {
                            "nm": "赛文"
                        },
                        {
                            "nm": "舍卜沃"
                        },
                        {
                            "nm": "塔伊兹"
                        },
                        {
                            "nm": "希赫尔"
                        },
                        {
                            "nm": "亚丁"
                        },
                        {
                            "nm": "伊卜"
                        },
                        {
                            "nm": "扎玛尔"
                        }
                    ],
                    "nm": "也门"
                }
            ]
        },
        {
            "nm": "伊拉克",
            "state": []
        },
        {
            "nm": "伊朗",
            "state": []
        },
        {
            "nm": "以色列",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿什杜德"
                        },
                        {
                            "nm": "贝尔谢巴"
                        },
                        {
                            "nm": "贝特雁"
                        },
                        {
                            "nm": "海法"
                        },
                        {
                            "nm": "霍隆"
                        },
                        {
                            "nm": "内坦亚"
                        },
                        {
                            "nm": "特拉维夫"
                        },
                        {
                            "nm": "耶路撒冷"
                        }
                    ],
                    "nm": "以色列"
                }
            ]
        },
        {
            "nm": "意大利",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿斯蒂"
                        },
                        {
                            "nm": "阿斯科利皮切诺"
                        },
                        {
                            "nm": "安科纳"
                        },
                        {
                            "nm": "奥尔比亚"
                        },
                        {
                            "nm": "奥里斯塔诺"
                        },
                        {
                            "nm": "奥斯塔"
                        },
                        {
                            "nm": "巴勒莫"
                        },
                        {
                            "nm": "巴里"
                        },
                        {
                            "nm": "贝加莫"
                        },
                        {
                            "nm": "贝内文托"
                        },
                        {
                            "nm": "比萨"
                        },
                        {
                            "nm": "波代诺内"
                        },
                        {
                            "nm": "波坦察"
                        },
                        {
                            "nm": "博洛尼亚"
                        },
                        {
                            "nm": "布拉"
                        },
                        {
                            "nm": "布雷西亚"
                        },
                        {
                            "nm": "布林迪西"
                        },
                        {
                            "nm": "的里雅斯特"
                        },
                        {
                            "nm": "都灵"
                        },
                        {
                            "nm": "费拉拉"
                        },
                        {
                            "nm": "佛罗伦萨"
                        },
                        {
                            "nm": "福贾"
                        },
                        {
                            "nm": "卡利亚里"
                        },
                        {
                            "nm": "卡塞塔"
                        },
                        {
                            "nm": "卡塔尼亚"
                        },
                        {
                            "nm": "卡坦扎罗"
                        },
                        {
                            "nm": "坎波巴索"
                        },
                        {
                            "nm": "科摩"
                        },
                        {
                            "nm": "科森扎"
                        },
                        {
                            "nm": "克罗托内"
                        },
                        {
                            "nm": "库内奥"
                        },
                        {
                            "nm": "拉奎拉"
                        },
                        {
                            "nm": "拉斯佩齐亚"
                        },
                        {
                            "nm": "莱科"
                        },
                        {
                            "nm": "莱切"
                        },
                        {
                            "nm": "雷焦艾米利亚"
                        },
                        {
                            "nm": "雷焦卡拉布里亚"
                        },
                        {
                            "nm": "里窝那"
                        },
                        {
                            "nm": "罗马"
                        },
                        {
                            "nm": "马萨"
                        },
                        {
                            "nm": "马泰拉"
                        },
                        {
                            "nm": "蒙扎"
                        },
                        {
                            "nm": "米兰"
                        },
                        {
                            "nm": "摩德纳"
                        },
                        {
                            "nm": "墨西拿"
                        },
                        {
                            "nm": "那不勒斯"
                        },
                        {
                            "nm": "努奥罗"
                        },
                        {
                            "nm": "诺瓦拉"
                        },
                        {
                            "nm": "帕尔马"
                        },
                        {
                            "nm": "帕维亚"
                        },
                        {
                            "nm": "佩鲁贾"
                        },
                        {
                            "nm": "热那亚"
                        },
                        {
                            "nm": "萨莱诺"
                        },
                        {
                            "nm": "萨萨里"
                        },
                        {
                            "nm": "萨沃纳"
                        },
                        {
                            "nm": "塔兰托"
                        },
                        {
                            "nm": "特拉帕尼"
                        },
                        {
                            "nm": "特伦托"
                        },
                        {
                            "nm": "威尼斯"
                        },
                        {
                            "nm": "韦尔切利"
                        },
                        {
                            "nm": "维泰博"
                        },
                        {
                            "nm": "乌迪内"
                        },
                        {
                            "nm": "锡拉库扎"
                        },
                        {
                            "nm": "锡耶纳"
                        },
                        {
                            "nm": "亚历山德里亚"
                        },
                        {
                            "nm": "伊塞尔尼亚"
                        }
                    ],
                    "nm": "意大利"
                }
            ]
        },
        {
            "nm": "印度",
            "state": [
                {
                    "city": [
                        {
                            "nm": "艾藻尔"
                        },
                        {
                            "nm": "班加罗尔"
                        },
                        {
                            "nm": "本地治里"
                        },
                        {
                            "nm": "博帕尔"
                        },
                        {
                            "nm": "布巴内斯瓦尔"
                        },
                        {
                            "nm": "昌迪加尔"
                        },
                        {
                            "nm": "达曼"
                        },
                        {
                            "nm": "第乌"
                        },
                        {
                            "nm": "甘托克"
                        },
                        {
                            "nm": "哥印拜陀"
                        },
                        {
                            "nm": "加尔各答"
                        },
                        {
                            "nm": "加里加尔"
                        },
                        {
                            "nm": "贾巴尔普尔"
                        },
                        {
                            "nm": "贾朗达尔"
                        },
                        {
                            "nm": "焦特布尔"
                        },
                        {
                            "nm": "金奈"
                        },
                        {
                            "nm": "卡瓦拉蒂"
                        },
                        {
                            "nm": "科希马"
                        },
                        {
                            "nm": "马埃"
                        },
                        {
                            "nm": "马杜赖"
                        },
                        {
                            "nm": "森伯尔布尔"
                        },
                        {
                            "nm": "特里凡得琅"
                        },
                        {
                            "nm": "乌代布尔"
                        },
                        {
                            "nm": "西隆"
                        },
                        {
                            "nm": "锡尔萨瓦"
                        },
                        {
                            "nm": "新德里"
                        },
                        {
                            "nm": "亚南"
                        },
                        {
                            "nm": "因帕尔"
                        },
                        {
                            "nm": "印多尔"
                        },
                        {
                            "nm": "斋普尔"
                        }
                    ],
                    "nm": "印度"
                }
            ]
        },
        {
            "nm": "印度尼西亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "巴厘"
                        },
                        {
                            "nm": "邦加－勿里洞群岛"
                        },
                        {
                            "nm": "北苏拉威西"
                        },
                        {
                            "nm": "北苏门答腊"
                        },
                        {
                            "nm": "大雅加达首都特区"
                        },
                        {
                            "nm": "东加里曼丹"
                        },
                        {
                            "nm": "东南苏拉威西"
                        },
                        {
                            "nm": "东努沙登加拉"
                        },
                        {
                            "nm": "东爪哇"
                        },
                        {
                            "nm": "廖内"
                        },
                        {
                            "nm": "马鲁古"
                        },
                        {
                            "nm": "明古鲁"
                        },
                        {
                            "nm": "楠榜"
                        },
                        {
                            "nm": "南加里曼丹"
                        },
                        {
                            "nm": "南苏拉威西"
                        },
                        {
                            "nm": "南苏门答腊"
                        },
                        {
                            "nm": "日惹特区"
                        },
                        {
                            "nm": "万丹"
                        },
                        {
                            "nm": "西努沙登加拉"
                        },
                        {
                            "nm": "西苏门答腊"
                        },
                        {
                            "nm": "西爪哇"
                        },
                        {
                            "nm": "雅加达"
                        },
                        {
                            "nm": "亚齐"
                        },
                        {
                            "nm": "伊里安查亚"
                        },
                        {
                            "nm": "占碑"
                        },
                        {
                            "nm": "中加里曼丹"
                        },
                        {
                            "nm": "中苏拉威西"
                        },
                        {
                            "nm": "中爪哇"
                        }
                    ],
                    "nm": "印度尼西亚"
                }
            ]
        },
        {
            "nm": "英国",
            "state": [
                {
                    "nm": "北爱尔兰",
                    "city": [
                        {
                            "nm": "贝尔法斯特"
                        },
                        {
                            "nm": "德里"
                        },
                        {
                            "nm": "利斯本"
                        },
                        {
                            "nm": "纽里"
                        }
                    ]
                },
                {
                    "nm": "苏格兰",
                    "city": [
                        {
                            "nm": "阿伯丁"
                        },
                        {
                            "nm": "爱丁堡"
                        },
                        {
                            "nm": "丹迪"
                        },
                        {
                            "nm": "格拉斯哥"
                        },
                        {
                            "nm": "斯特灵"
                        },
                        {
                            "nm": "因弗内斯"
                        }
                    ]
                },
                {
                    "nm": "威尔士",
                    "city": [
                        {
                            "nm": "班戈"
                        },
                        {
                            "nm": "卡迪夫"
                        },
                        {
                            "nm": "纽波特"
                        },
                        {
                            "nm": "斯旺西"
                        }
                    ]
                },
                {
                    "nm": "英格兰",
                    "city": [
                        {
                            "nm": "埃克塞特"
                        },
                        {
                            "nm": "巴斯"
                        },
                        {
                            "nm": "彼得伯勒"
                        },
                        {
                            "nm": "伯明翰"
                        },
                        {
                            "nm": "布拉德福德"
                        },
                        {
                            "nm": "布莱顿与赫福"
                        },
                        {
                            "nm": "布里斯托尔"
                        },
                        {
                            "nm": "德比"
                        },
                        {
                            "nm": "德罕"
                        },
                        {
                            "nm": "格洛斯特"
                        },
                        {
                            "nm": "赫尔河畔京斯敦"
                        },
                        {
                            "nm": "赫里福德"
                        },
                        {
                            "nm": "剑桥"
                        },
                        {
                            "nm": "卡莱尔"
                        },
                        {
                            "nm": "坎特伯雷"
                        },
                        {
                            "nm": "考文垂"
                        },
                        {
                            "nm": "兰开斯特"
                        },
                        {
                            "nm": "里彭"
                        },
                        {
                            "nm": "利奇菲尔德"
                        },
                        {
                            "nm": "利物浦"
                        },
                        {
                            "nm": "利茲"
                        },
                        {
                            "nm": "列斯特"
                        },
                        {
                            "nm": "林肯"
                        },
                        {
                            "nm": "伦敦"
                        },
                        {
                            "nm": "曼彻斯特"
                        },
                        {
                            "nm": "南安普敦"
                        },
                        {
                            "nm": "牛津"
                        },
                        {
                            "nm": "纽卡斯尔"
                        },
                        {
                            "nm": "诺丁汉"
                        },
                        {
                            "nm": "诺里奇"
                        },
                        {
                            "nm": "朴茨茅斯"
                        },
                        {
                            "nm": "普雷斯顿"
                        },
                        {
                            "nm": "普利茅斯"
                        },
                        {
                            "nm": "奇切斯特"
                        },
                        {
                            "nm": "切斯特"
                        },
                        {
                            "nm": "桑德兰"
                        },
                        {
                            "nm": "圣阿本斯"
                        },
                        {
                            "nm": "索尔斯堡"
                        },
                        {
                            "nm": "索福特"
                        },
                        {
                            "nm": "特鲁罗"
                        },
                        {
                            "nm": "特伦特河畔斯多克"
                        },
                        {
                            "nm": "威尔斯"
                        },
                        {
                            "nm": "韦克菲尔德"
                        },
                        {
                            "nm": "温彻斯特"
                        },
                        {
                            "nm": "伍尔弗汉普顿"
                        },
                        {
                            "nm": "伍斯特"
                        },
                        {
                            "nm": "谢菲尔德"
                        },
                        {
                            "nm": "伊利"
                        },
                        {
                            "nm": "约克"
                        }
                    ]
                }
            ]
        },
        {
            "nm": "英属印度洋领地",
            "state": []
        },
        {
            "nm": "约旦",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿吉隆"
                        },
                        {
                            "nm": "安曼"
                        },
                        {
                            "nm": "拜勒加"
                        },
                        {
                            "nm": "杰拉什"
                        },
                        {
                            "nm": "卡拉克"
                        },
                        {
                            "nm": "鲁赛法"
                        },
                        {
                            "nm": "马安"
                        },
                        {
                            "nm": "马德巴"
                        },
                        {
                            "nm": "马夫拉克"
                        },
                        {
                            "nm": "塔菲拉"
                        },
                        {
                            "nm": "亚喀巴"
                        },
                        {
                            "nm": "伊尔比德"
                        },
                        {
                            "nm": "扎尔卡"
                        }
                    ],
                    "nm": "约旦"
                }
            ]
        },
        {
            "nm": "越南",
            "state": [
                {
                    "city": [
                        {
                            "nm": "海防"
                        },
                        {
                            "nm": "河内"
                        },
                        {
                            "nm": "胡志明市"
                        }
                    ],
                    "nm": "越南"
                }
            ]
        },
        {
            "nm": "赞比亚",
            "state": [
                {
                    "city": [
                        {
                            "nm": "北方"
                        },
                        {
                            "nm": "东方"
                        },
                        {
                            "nm": "卢阿普拉"
                        },
                        {
                            "nm": "卢萨卡"
                        },
                        {
                            "nm": "南方"
                        },
                        {
                            "nm": "铜带"
                        },
                        {
                            "nm": "西北"
                        },
                        {
                            "nm": "西方"
                        },
                        {
                            "nm": "中央"
                        }
                    ],
                    "nm": "赞比亚"
                }
            ]
        },
        {
            "nm": "泽西岛",
            "state": []
        },
        {
            "nm": "乍得",
            "state": []
        },
        {
            "nm": "直布罗陀",
            "state": []
        },
        {
            "nm": "智利",
            "state": [
                {
                    "city": [
                        {
                            "nm": "阿劳卡尼亚大区"
                        },
                        {
                            "nm": "阿塔卡马大区"
                        },
                        {
                            "nm": "安托法加斯塔大区"
                        },
                        {
                            "nm": "比奥比奥大区"
                        },
                        {
                            "nm": "复活节岛"
                        },
                        {
                            "nm": "湖大区"
                        },
                        {
                            "nm": "科金博大区"
                        },
                        {
                            "nm": "马乌莱大区"
                        },
                        {
                            "nm": "麦哲伦-智利南极大区"
                        },
                        {
                            "nm": "圣地亚哥"
                        },
                        {
                            "nm": "塔拉帕卡大区"
                        },
                        {
                            "nm": "瓦尔帕莱索大区"
                        },
                        {
                            "nm": "伊瓦涅斯将军的艾森大区"
                        }
                    ],
                    "nm": "智利"
                }
            ]
        },
        {
            "nm": "中非共和国",
            "state": [
                {
                    "city": [
                        {
                            "nm": "巴明吉-班戈兰"
                        },
                        {
                            "nm": "班吉直辖市"
                        },
                        {
                            "nm": "宾博"
                        },
                        {
                            "nm": "凯莫"
                        },
                        {
                            "nm": "洛巴伊"
                        },
                        {
                            "nm": "曼贝雷-卡代"
                        },
                        {
                            "nm": "姆博穆"
                        },
                        {
                            "nm": "纳纳-格里比齐"
                        },
                        {
                            "nm": "纳纳-曼贝雷"
                        },
                        {
                            "nm": "桑加-姆巴埃雷"
                        },
                        {
                            "nm": "上科托"
                        },
                        {
                            "nm": "上姆博穆"
                        },
                        {
                            "nm": "瓦卡"
                        },
                        {
                            "nm": "瓦卡加"
                        },
                        {
                            "nm": "瓦姆"
                        },
                        {
                            "nm": "瓦姆-彭代"
                        },
                        {
                            "nm": "翁贝拉-姆波科"
                        },
                        {
                            "nm": "下科托"
                        }
                    ],
                    "nm": "中非共和国"
                }
            ]
        }
    ];


    window.$location = location;
})()
