({
	"hmaker" : {
		"create"       : "新建 ...",
		"site_new"     : "新建站点...",
		"site_dup"     : "复制当前站点...",
		"site_del"     : "删除当前站点",
		"site_conf"    : "站点设置",
    	"pub_site"     : "整站发布",
    	"pub_site_tip" : "将站点全部内容发布你预先设置好的目录(可以在站点配置动设置)。",
    	"pub_current_page" : "发布当前页",
    	"rename_lib"   : "重命名库组件 ...",
    	"html"       : "页面",
        "html_tip"   : "一个站点包括多个页面，通过我们提供的各种控件你可以随意定制页面的布局和显示数据，甚至包括呈现系统的动态数据",
        "folder"     : "文件夹",
        "folder_tip" : "文件夹主要用来放置当前站点需要用到的各种媒体文件，以及存放你定义好的组件",
        "css"        : "样式表单",
        "css_tip"    : "站点专属的样式表单文件存放你编写的各种样式规则（如果你很熟CSS，你可以获得极大的页面布局灵活性），在页面引用后，该页面各个控件都可以使用这些样式规则了",
        "js"         : "JS脚本",
        "js_tip"     : "站点专属的JS脚本可以让你随意为一个页面添加各种炫酷的行为"
    }
})